// chunk_id: 0
var main_trials_ident = [
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/6e\/Stanford%2C_California%2C_United_States_Post_Office%2C_March_2019.jpg",
	  "page_title":"Stanford, California",
	  "section_title":null,
	  "caption":"Stanford post office",
	  "caption_attribution_description":"English: The photograph is of the front exterior of the Stanford Post Office as viewed from the southwest. Photograph taken on 2019-03-15T20:43:14Z.",
	  "description":"Stanford post office",
	  "page_context":"Stanford is a census-designated place in the northwest corner of Santa Clara County, California, United States and is the home of Stanford University. The population was 13,809 at the 2010 census, with a daily population of 35,000.\nStanford is an unincorporated area of Santa Clara County and is adjacent to the city of Palo Alto.\nMost of the Stanford University campus and other core University owned land is situated within the census-designated place of Stanford though the Stanford University Medical Center, the Stanford Shopping Center, and the Stanford Research Park are officially part of the city of Palo Alto. Its resident population consists of the inhabitants of on-campus housing, including graduate student residences and single-family homes and condominiums owned by their faculty inhabitants but located on leased Stanford land. A residential neighborhood adjacent to the Stanford campus, College Terrace, featuring streets named after universities and colleges, is neither part of the Stanford CDP nor owned by the University but is instead part of Palo Alto.",
	  "section_context":"Stanford is a census-designated place (CDP) in the northwest corner of Santa Clara County, California, United States and is the home of Stanford University. The population was 13,809 at the 2010 census, with a daily population of 35,000.\nStanford is an unincorporated area of Santa Clara County and is adjacent to the city of Palo Alto.\nMost of the Stanford University campus and other core University owned land is situated within the census-designated place of Stanford though the Stanford University Medical Center, the Stanford Shopping Center, and the Stanford Research Park are officially part of the city of Palo Alto. Its resident population consists of the inhabitants of on-campus housing, including graduate student residences and single-family homes and condominiums owned by their faculty inhabitants but located on leased Stanford land.  A residential neighborhood adjacent to the Stanford campus, College Terrace, featuring streets named after universities and colleges, is neither part of the Stanford CDP nor owned by the University (except for a few individual houses) but is instead part of Palo Alto.",
	  "description_length":20,
	  "caption_length":20,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1155.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/be\/Edward_Brooke-Hitching.jpg",
	  "page_title":"Edward Brooke-Hitching",
	  "section_title":null,
	  "caption":"Edward Brooke-Hitching",
	  "caption_attribution_description":"English: Edward Brooke-Hitching",
	  "description":"Edward Brooke-Hitching",
	  "page_context":"Edward Brooke-Hitching is an English author, and a writer and researcher for the BBC panel show QI, as a member of the team known as the \"QI Elves\". He is the son of the rare book dealer Franklin Brooke-Hitching and a descendant of the printer and bibliographer William Blades, who wrote the history of book preservation The Enemies of Books.\nHis Fox Tossing, Octopus Wrestling and Other Forgotten Sports described 90 obsolete pastimes and The Spectator's reviewer said \"A book like this, the result of enormously diligent library ferreting, doesn't have any pressing reason to exist, but I am glad it does. Its pointlessness is its pleasure.\" It described sports including fox tossing, octopus wrestling and ski ballet. His The Phantom Atlas describes places which appear on maps but do not exist: the Times reviewer says that it \"shows how places that aren’t there can endure, sometimes for centuries, once a map-maker has inked them in\". The Sky Atlas was shortlisted for the 2019 Edward Stanford Travel Writing Awards in the \"Illustrated travel book\" category and picked as one of the 50 Christmas books of the year by The Herald.",
	  "section_context":"Edward Brooke-Hitching is an English author, and a writer and researcher for the BBC panel show QI, as a member of the team known as the \"QI Elves\". He is the son of the rare book dealer Franklin Brooke-Hitching and a descendant of the printer and bibliographer William Blades, who wrote the history of book preservation The Enemies of Books.\nHis Fox Tossing, Octopus Wrestling and Other Forgotten Sports described 90 obsolete pastimes and  The Spectator's reviewer said \"A book like this, the result of enormously diligent library ferreting, doesn't have any pressing reason to exist, but I am glad it does. Its pointlessness is its pleasure.\" It described sports including fox tossing, octopus wrestling and ski ballet. His The Phantom Atlas describes places which appear on maps but do not exist: the Times reviewer says that it \"shows how places that aren’t there can endure, sometimes for centuries, once a map-maker has inked them in\".  The Sky Atlas was shortlisted for the 2019 Edward Stanford Travel Writing Awards in the \"Illustrated travel book\" category and picked as one of the 50 Christmas books of the year by The Herald.\nIn 2007 he directed a short documentary about the Edinburgh-based Really Terrible Orchestra. \nHe appeared on BBC Radio 4's The Museum of Curiosity in October 2019. His hypothetical donation to this imaginary museum was \"A land grant for 60 acres of land in Poyais\", being a document produced by 1820s fraudster Gregor MacGregor.",
	  "description_length":22,
	  "caption_length":22,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1047.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/a7\/AKMap-doton-PortAlsworth.PNG",
	  "page_title":"Port Alsworth, Alaska",
	  "section_title":null,
	  "caption":"Location of Port Alsworth, Alaska",
	  "caption_attribution_description":"Adapted from Wikipedia's AK borough maps by Seth Ilys.",
	  "description":"Location of Port Alsworth, Alaska",
	  "page_context":"Port Alsworth is a census-designated place in Lake and Peninsula Borough, Alaska, United States. It is 165 miles by air southwest of Anchorage. The population was 159 at the 2010 census, up from 104 in 2000.\nPort Alsworth was founded in 1950 by Babe Alsworth, a missionary and bush pilot, and Mary Alsworth, who was the town's first postmaster.\nPort Alsworth is located on private land within Lake Clark National Park and Preserve and is the site of the national park's field headquarters.\nSamaritan's Purse operates a lodge for wounded United States military veterans located within the town for \"Operation Heal Our Patriots\". There is also a summer camp called \"Tanalian Bible Camp\" where youth, ages 8–19, from the surrounding villages can attend.\nFrom the summer of 2013 to the spring of 2014, the local Tanalian School underwent renovation and a dearly needed expansion. The renovation involved tripling school square footage, all new furniture, and doubling the size of the gym.",
	  "section_context":"Port Alsworth is a census-designated place (CDP) in Lake and Peninsula Borough, Alaska, United States. It is 165 miles (266 km) by air southwest of Anchorage. The population was 159 at the 2010 census, up from 104 in 2000.\nPort Alsworth was founded in 1950 by Babe Alsworth, a missionary and bush pilot, and Mary Alsworth, who was the town's first postmaster.\nPort Alsworth is located on private land within Lake Clark National Park and Preserve and is the site of the national park's field headquarters.\nSamaritan's Purse operates a lodge for wounded United States military veterans located within the town for \"Operation Heal Our Patriots\" (OHOP). There is also a summer camp called \"Tanalian Bible Camp\" where youth, ages 8–19, from the surrounding villages can attend.\nFrom the summer of 2013 to the spring of 2014, the local Tanalian School underwent renovation and a dearly needed expansion. The renovation involved tripling school square footage, all new furniture, and doubling the size of the gym.",
	  "description_length":33,
	  "caption_length":33,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1019.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/0a\/Barnum%2C_WI_from_the_south.JPG",
	  "page_title":"Barnum, Wisconsin",
	  "section_title":null,
	  "caption":"Entering Barnum from the south on WIS 131",
	  "caption_attribution_description":"English: Barnum, Wisconsin from the south on Wisconsin Highway 131.",
	  "description":"Entering Barnum from the south on WIS 131",
	  "page_context":"Barnum is an unincorporated community located in the town of Haney, in Crawford County, Wisconsin, United States. Barnum is on the Kickapoo River north of Steuben and is served by Wisconsin Highway 131. The community was founded around 1892 by Edward S. Barnum from Bristol, Ontario County, New York, who purchased land along the Kickapoo River in 1857.",
	  "section_context":"Barnum is an unincorporated community located in the town of Haney, in Crawford County, Wisconsin, United States. Barnum is on the Kickapoo River north of Steuben and is served by Wisconsin Highway 131. The community was founded around 1892 by Edward S. Barnum from Bristol, Ontario County, New York, who purchased land along the Kickapoo River in 1857.",
	  "description_length":41,
	  "caption_length":41,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1057.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/6b\/West_Palm_Beach_Aerial_November_2014_photo_D_Ramey_Logan.jpg",
	  "page_title":"West Palm Beach, Florida",
	  "section_title":null,
	  "caption":"West Palm Beach",
	  "caption_attribution_description":"English: West Palm Beach Aerial November 2014 photo D Ramey Logan",
	  "description":"West Palm Beach",
	  "page_context":"West Palm Beach is a city in and the county seat of Palm Beach County, Florida, United States. It is located immediately to the west of the adjacent Palm Beach, which is situated on a barrier island across the Lake Worth Lagoon. The population was 99,919 at the 2010 census. West Palm Beach is a principal city of the Miami metropolitan area, which was home to an estimated 6,158,824 people in 2017.\nIt is the oldest incorporated municipality in the south Florida area, having been incorporated as a city two years before Miami in November 1894. West Palm Beach is located approximately 68 miles north of Downtown Miami.",
	  "section_context":"West Palm Beach is a city in and the county seat of Palm Beach County, Florida, United States. It is located immediately to the west of the adjacent Palm Beach, which is situated on a barrier island across the Lake Worth Lagoon. The population was 99,919 at the 2010 census. West Palm Beach is a principal city of the Miami metropolitan area, which was home to an estimated 6,158,824 people in 2017.\nIt is the oldest incorporated municipality in the south Florida area, having been incorporated as a city two years before Miami in November 1894. West Palm Beach is located approximately 68 miles (109 km) north of Downtown Miami.",
	  "description_length":15,
	  "caption_length":15,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1079.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/af\/Sainte-Catherine-de-Fierbois_-_%C3%89glise_Sainte-Catherine_-_1.jpg",
	  "page_title":"Sainte-Catherine-de-Fierbois",
	  "section_title":null,
	  "caption":"The church of Sainte-Catherine, in Sainte-Catherine-de-Fierbois",
	  "caption_attribution_description":"English: Sainte-Catherine's church of Sainte-Catherine-de-Fierbois (Indre-et-Loire, Centre, France). Français&#160;: L'église Sainte-Catherine de Sainte-Catherine-de-Fierbois (Indre-et-Loire, Centre, France).",
	  "description":"The church of Sainte-Catherine, in Sainte-Catherine-de-Fierbois",
	  "page_context":"Sainte-Catherine-de-Fierbois is a commune in the Indre-et-Loire department in central France.\nIt is a stop on the Way of St. James.",
	  "section_context":"Sainte-Catherine-de-Fierbois is a commune in the Indre-et-Loire department in central France.\nIt is a stop on the Way of St. James.",
	  "description_length":63,
	  "caption_length":63,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1073.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/en\/f\/f0\/Fabric_Row_signage.jpg",
	  "page_title":"Fabric Row (Philadelphia)",
	  "section_title":null,
	  "caption":"Fabric Row on South 4th Street",
	  "caption_attribution_description":null,
	  "description":"Fabric Row on South 4th Street",
	  "page_context":"Fabric Row is a historic Jewish textile and garment district located on South 4th Street in the Queen Village neighborhood of Philadelphia between Bainbridge Street and Catherine Street.",
	  "section_context":"Fabric Row (Der Ferder, \"the fourth\", in Yiddish) is a historic Jewish textile and garment district located on South 4th Street in the Queen Village neighborhood of Philadelphia between Bainbridge Street and Catherine Street.",
	  "description_length":30,
	  "caption_length":30,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1169.jpg"
	},
	{
	  "language":"en",
	  "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/7\/7a\/OKMap-doton-Leach.PNG",
	  "page_title":"Leach, Oklahoma",
	  "section_title":null,
	  "caption":"Location of Leach, Oklahoma",
	  "caption_attribution_description":"Adapted from Wikipedia's OK county maps by Seth Ilys.",
	  "description":"Location of Leach, Oklahoma",
	  "page_context":"Leach is an unincorporated community and census-designated place in southwestern Delaware County, Oklahoma, United States, along U.S. Highway 412 Scenic. The population was 237 at the 2010 census.",
	  "section_context":"Leach is an unincorporated community and census-designated place (CDP) in southwestern Delaware County, Oklahoma, United States, along U.S. Highway 412 Scenic. The population was 237 at the 2010 census.",
	  "description_length":27,
	  "caption_length":27,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1111.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/4b\/Watch_Out_For_Snakes_at_DNA_Lounge%2C_November_2019.jpg",
	  "page_title":"Watch Out For Snakes",
	  "section_title":null,
	  "caption":"Watch Out For Snakes at DNA Lounge, San Francisco in November 2019.",
	  "caption_attribution_description":"English: Watch Out For Snakes at DNA Lounge, San Francisco in November 2019.",
	  "description":"Watch Out For Snakes at DNA Lounge, San Francisco in November 2019.",
	  "page_context":"Watch Out For Snakes is the pseudonym of Atlanta-based musician and producer Matt Baum. He is often credited as a pioneer of the chipwave genre, fusing elements of chiptune and synthwave.\nHe is also known for placing emphasis on his live performances, which employ a keytar and have been characterized as high-energy and aggressive. He has participated in a number of synthwave, chiptune, and video game music festivals including Echosynthetic Fest, Neon Rose Fest, and MAGFest.\nBaum synthesizes his chiptune instrumentation from the Nintendo and Game Boy video game systems. His albums have been described as imaginary video game soundtracks and he has stated that they draw thematically from personal events in his own life.",
	  "section_context":"Watch Out For Snakes is the pseudonym of Atlanta-based musician and producer Matt Baum. He is often credited as a pioneer of the chipwave genre, fusing elements of chiptune and synthwave.\nHe is also known for placing emphasis on his live performances, which employ a keytar and have been characterized as high-energy and aggressive. He has participated in a number of synthwave, chiptune, and video game music festivals including Echosynthetic Fest, Neon Rose Fest, and MAGFest.\nBaum synthesizes his chiptune instrumentation from the Nintendo and Game Boy video game systems. His albums have been described as imaginary video game soundtracks and he has stated that they draw thematically from personal events in his own life.",
	  "description_length":67,
	  "caption_length":67,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1074.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8e\/Mugdrum_-_geograph.org.uk_-_675365.jpg",
	  "page_title":"Carpow Roman Fort",
	  "section_title":null,
	  "caption":"The Tay estuary showing the area around the Roman Fort",
	  "caption_attribution_description":"English: Mugdrum Mugdrum Island from Carpow Hill.",
	  "description":"The Tay estuary showing the area around the Roman Fort",
	  "page_context":"The Roman Fort of Carpow was situated at the confluence of the rivers Tay and Earn in what is now Scotland.\nIt was a large fortress with an area of thirty acres occupied by two legions at different times, Legio II Augusta and Legio VI Victrix, and thus of solid, permanent construction using stone, brick and tiles.\nThe fort was occupied from the late second century AD until the early third century AD. The site of the fort has not been comprehensively excavated but it is believed to have served as a naval supply depot for Roman forces in the central lowlands. Its occupation also coincided with the campaigns of Septimius Severus in the area.\nHowever, its site on the southern side of the Tay estuary is incompatible with its use as a base for Severan offensive operations to the north and, along with other evidence, it is more likely that the fortress was built under Commodus in 185 to support his campaigns.\nIt has been suggested that the Carpow fort was the place named as \"Horrea Classis\" or \"Poreo Classis\" in the Ravenna Cosmography.",
	  "section_context":"The Roman Fort of Carpow was situated at the confluence of the rivers Tay and Earn in what is now Scotland.\nIt was a large fortress with an area of thirty acres occupied by two legions at different times, Legio II Augusta and Legio VI Victrix, and thus of solid, permanent construction using stone, brick and tiles.\nThe fort was occupied from the late second century AD until the early third century AD. The site of the fort has not been comprehensively excavated but it is believed to have served as a naval supply depot for Roman forces in the central lowlands. Its occupation also coincided with the campaigns of Septimius Severus in the area.\nHowever, its site on the southern side of the Tay estuary is incompatible with its use as a base for Severan offensive operations to the north and, along with other evidence, it is more likely that the fortress was built under Commodus in 185 to support his campaigns. \nIt has been suggested that the Carpow fort was the place named as \"Horrea Classis\" or \"Poreo Classis\" in the Ravenna Cosmography.",
	  "description_length":54,
	  "caption_length":54,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1032.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/0d\/AG-40_Monomoy.jpg",
	  "page_title":"USS Monomoy (AG-40)",
	  "section_title":null,
	  "caption":"USS Monomoy (AG-40)",
	  "caption_attribution_description":"English: USS Monomoy (AG-40) in drydock, 27 August 1943, at Maryland Drydock Co., Baltimore, Maryland (USA).",
	  "description":"USS Monomoy (AG-40)",
	  "page_context":"USS Monomoy (AG-40) was a commercial cargo ship acquired by the U.S. Navy during World War II. She was outfitted with guns and depth charges and sent into the dangerous waters of the North Atlantic Ocean to furnish data used to predict storm movement and severe weather conditions to safeguard the continuous movement of merchant convoys, naval warships, and airplanes between North America and the United Kingdom, Murmansk, and other destinations. She served as an escort vessel when required. She was manned by a U.S. Coast Guard crew and was eventually transferred to that agency as USCGC Monomoy.",
	  "section_context":"USS Monomoy (AG-40) was a commercial cargo ship acquired by the U.S. Navy during World War II. She was outfitted with guns and depth charges and sent into the dangerous waters of the North Atlantic Ocean to furnish data used to predict storm movement and severe weather conditions to safeguard the continuous movement of merchant convoys, naval warships, and airplanes between North America and the United Kingdom, Murmansk, and other destinations.  She served  as an escort vessel when required. She was manned by a U.S. Coast Guard crew and was eventually transferred to that agency as USCGC Monomoy (WAG-275).",
	  "description_length":19,
	  "caption_length":19,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1063.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/40\/Indianapolis-motor-speedway.jpg",
	  "page_title":"Speedway, Indiana",
	  "section_title":null,
	  "caption":"Speedway and Indianapolis Motor Speedway in 2005.",
	  "caption_attribution_description":null,
	  "description":"Speedway and Indianapolis Motor Speedway in 2005.",
	  "page_context":"Speedway is a town in Wayne Township, Marion County, Indiana, United States. The population was 11,812 at the 2010 census. Speedway, which is an enclave of Indianapolis, is the home of the Indianapolis Motor Speedway.",
	  "section_context":"Speedway is a town in Wayne Township, Marion County, Indiana, United States. The population was 11,812 at the 2010 census. Speedway, which is an enclave of Indianapolis, is the home of the Indianapolis Motor Speedway.",
	  "description_length":49,
	  "caption_length":49,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1098.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/5a\/Serra_d%27Urbasa_20180731_145941.jpg",
	  "page_title":"Alsasua – Altsasu",
	  "section_title":null,
	  "caption":"Aerial view of Altsasu\/Alsasua",
	  "caption_attribution_description":"Català: Fotos preses en una excursió al \"mendizaleen ibilbidea\" o camí dels muntanyencs, un itinerari des del centre d'informació que hi ha al coll d'Urbasa fins a la carena sobre la Sakana. La major part transcorre per fagedes i part del primer tram coincideix amb un itinerari adaptat. Euskara: \"Mendizaleen ibilbidean\" hartutako irudiak, Urbasa mendilerroan dagoen informazio zentroak Sakanaz gain burutzen duen ibilbidea. Zati gehiena pagadien artean egiten da eta ibilbidearen lehen zatiak egokitutako ibilbidearekin bat egiten du.",
	  "description":"Aerial view of Altsasu\/Alsasua",
	  "page_context":"Alsasua is a town located in the autonomous community of Navarre, northern Spain. Its population in 2017 was 7,419. The Battle of Alsasua took place here in 1834. 30 years later the town turned into a railway hub, transforming its demography, economy, and cultural landscape. In 2016, a fight erupting in a bar escalated into an Audiencia Nacional judicial case that stirred the town.",
	  "section_context":"Alsasua (in Spanish, Altsasu in Basque; official name: Altsasu\/Alsasua) is a town located in the autonomous community of Navarre, northern Spain.  Its population in 2017 was 7,419. The Battle of Alsasua took place here in 1834. 30 years later the town turned into a railway hub, transforming its demography, economy, and cultural landscape. In 2016, a fight erupting in a bar escalated into an Audiencia Nacional judicial case that stirred the town.",
	  "description_length":30,
	  "caption_length":30,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1195.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/1\/12\/%E6%99%AF%E5%B7%9E%E5%A1%94_Jingzhou_Pagoda.JPG",
	  "page_title":"Jing County, Hebei",
	  "section_title":null,
	  "caption":"Jingzhou Pagoda",
	  "caption_attribution_description":"中文: 開福寺釋迦文舍利塔，俗稱景州塔，位於河北景縣。始建於北朝，北齊、隋代重修，現存建築為宋代風格，應是北宋時重建。1996年被列為第四批全國重點文物保護單位。 This is a photo of a (or part of a) Major National Historical and Cultural Site in China identified by the ID 4-82",
	  "description":"Jingzhou Pagoda",
	  "page_context":"Jing County or Jingxian is a county in Hengshui, Hebei province, People's Republic of China. It has an area of 1,183 km² and has 500,000 inhabitants. Its seat is the town of Jingzhou.",
	  "section_context":"Jing County or Jingxian (simplified Chinese: 景县; traditional Chinese: 景縣; pinyin: Jǐng Xiàn) is a county in Hengshui, Hebei province, People's Republic of China. It has an area of 1,183 km² (457 sq mi) and has 500,000 inhabitants. Its seat is the town of Jingzhou (景州镇).",
	  "description_length":15,
	  "caption_length":15,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1199.jpg"
	},
	{
	  "language":"en",
	  "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c5\/Schloss_Schl%C3%BC%C3%9Flberg-Torturm.jpg",
	  "page_title":"Schlüßlberg",
	  "section_title":null,
	  "caption":"Castle gate tower",
	  "caption_attribution_description":"Schloss_Schlüßlberg-Torturm",
	  "description":"Castle gate tower",
	  "page_context":"Schlüßlberg is a municipality in the district of Grieskirchen in the Austrian state of Upper Austria.",
	  "section_context":"Schlüßlberg is a municipality in the district of Grieskirchen in the Austrian state of Upper Austria.",
	  "description_length":17,
	  "caption_length":17,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1229.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/00\/Lee_Jeans_Booth_Kansas_City.jpg",
	  "page_title":"Lee (jeans)",
	  "section_title":"History",
	  "caption":"A Lee Jeans booth at a local 5k race in Kansas City.",
	  "caption_attribution_description":"English: A Lee Jeans booth at a local 5k race in Kansas City.",
	  "description":"A Lee Jeans booth at a local 5k race in Kansas City.",
	  "page_context":"Lee is an American brand of denim jeans, first produced in 1889 in Salina, Kansas. The company is owned by Kontoor Brands, a spin-off of VF Corporation's Jeans wear Division.\nIts headquarters is currently in Merriam, Kansas, just outside Kansas City, Missouri. The company states that they are an international retailer and manufacturer of casual wear and work wear and that they have more than 400 employees in the United States. In Australasia, the brand is owned by Pacific Brands since 2007, after it was acquired from Yakka.",
	  "section_context":"The company was formed in 1889 by Henry David Lee as the HD Lee Mercantile Company at Salina, Kansas producing dungarees and jackets. The growth of Lee was prompted by the introduction of the Union-All work jumpsuit in 1913 and their first overall in 1920. Later in the 1920s Lee introduced a zipper fly and continued to expand. Around this time, the first children's overall line was sold. In 1928 H.D. Lee, founder and president of The H.D. Lee Mercantile Company, died. During the 1930s and 1940s the company became the leading manufacturer of work clothes in the US. In 1944, the Lazy \"S\" became the official Lee back pocket. A flood wiped out Lee's Kansas City distribution center. It ruined the entire stock of merchandise, except the Buddy Lee dolls, which floated. In 1954, Lee expanded into casual wear. During the 1960s the company expanded to 81 countries and in 1969 was acquired by VF Corporation, becoming a brand. Lee aired its first television advertisement, which promoted Lee western wear.\nIn the 1970s Lee shifted its focus from the workwear business and began catering to fashion cycles. Lee created an all-new fit for women under the Ms. Lee label. A youth wear line for boys and girls was introduced. In 1996, the company launched Lee National Denim Day as part of National Breast Cancer Awareness Month. Working with the Entertainment Industry Foundation, Lee National Denim Day has raised over $75 million to help fund breast cancer research programs. In 2014, the brand was relaunched in Paris via the Citadium Paris store. In 2019, Lee, Wrangler, Rock & Republic, and VF Outlet were Separated from VF Corporation into Kontoor Brands.",
	  "description_length":52,
	  "caption_length":52,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1167.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/96\/La_Chapelle-sous-Orbais_-_%C3%89glise_Saint-Pierre-Saint-Paul_2.jpg",
	  "page_title":"La Chapelle-sous-Orbais",
	  "section_title":null,
	  "caption":"The church in La Chapelle-sous-Orbais",
	  "caption_attribution_description":"Français&#160;: Vue générale de l'église",
	  "description":"The church in La Chapelle-sous-Orbais",
	  "page_context":"La Chapelle-sous-Orbais is a commune in the Marne department in north-eastern France.",
	  "section_context":"La Chapelle-sous-Orbais  is a commune in the Marne department in north-eastern France.",
	  "description_length":37,
	  "caption_length":37,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1177.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/65\/Adirondacks_Mount_Marcy_From_Mount_Haystack.JPG",
	  "page_title":"Keene, New York",
	  "section_title":null,
	  "caption":"Mount Marcy from Mount Haystack",
	  "caption_attribution_description":"English: Mount Marcy in the Adirondacks mountain range, New York State, USA. Photo taken from Mount Haystack, looking across Panther Gorge.",
	  "description":"Mount Marcy from Mount Haystack",
	  "page_context":"Keene is a town in central Essex County, New York, United States. It includes the hamlets of Keene, Keene Valley, and St. Huberts, with a total population of 1,105 as of the 2010 census.\nThe town is part of the Adirondack Park, and includes 15 of the 46 High Peaks, including Mount Marcy, New York's highest mountain, and the rest of the Great Range. It also includes the Ausable Lakes, the source of the Ausable River. Trailheads for many of the High Peaks are located within the town, along with the Johns Brook Lodge of the Adirondack Mountain Club.",
	  "section_context":"Keene is a town in central Essex County, New York, United States. It includes the hamlets of Keene, Keene Valley, and St. Huberts, with a total population of 1,105 as of the 2010 census.\nThe town is part of the Adirondack Park, and includes 15 of the 46 High Peaks, including Mount Marcy, New York's highest mountain, and the rest of the Great Range. It also includes the Ausable Lakes, the source of the Ausable River. Trailheads for many of the High Peaks are located within the town, along with the Johns Brook Lodge of the Adirondack Mountain Club.",
	  "description_length":31,
	  "caption_length":31,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1014.jpg"
	},
	{
	  "language":"en",
	  "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8d\/F-22_Raptor_over_home_base_-_030929-F-0000J-003.jpg",
	  "page_title":"Tyndall Air Force Base",
	  "section_title":null,
	  "caption":"The first operational F-22A Raptor flies over Tyndall AFB on its delivery flight during 2003.",
	  "caption_attribution_description":"English: TYNDALL AIR FORCE BASE, Fla. -- The first operational F\/A-22 Raptor flies over the base on its delivery flight. Tyndall is home of the world's first F\/A-22 squadron.",
	  "description":"The first operational F-22A Raptor flies over Tyndall AFB on its delivery flight during 2003.",
	  "page_context":"Tyndall Air Force Base is a United States Air Force Base located 12 miles east of Panama City, Florida. The base was named in honor of World War I pilot 1st Lt. Frank Benjamin Tyndall. The base operating unit and host wing is the 325th Fighter Wing of the Air Combat Command. The base had a resident population of 2,994 at the 2010 census. In October 2018, Hurricane Michael caused catastrophic damage to the base.",
	  "section_context":"Tyndall Air Force Base is a United States Air Force Base located 12 miles (19 km) east of Panama City, Florida. The base was named in honor of World War I pilot 1st Lt. Frank Benjamin Tyndall. The base operating unit and host wing is the 325th Fighter Wing (325 FW) of the Air Combat Command (ACC). The base had a resident population of 2,994 at the 2010 census. In October 2018, Hurricane Michael caused catastrophic damage to the base.",
	  "description_length":93,
	  "caption_length":93,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1066.jpg"
	},
	{
	  "language":"en",
	  "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/a6\/TXMap-doton-Poteet.PNG",
	  "page_title":"Poteet, Texas",
	  "section_title":null,
	  "caption":"Location of Poteet, Texas",
	  "caption_attribution_description":"Adapted from Wikipedia's TX county maps by Seth Ilys.",
	  "description":"Location of Poteet, Texas",
	  "page_context":"Poteet is a city in Atascosa County, Texas, United States. The population was 3,260 as of the 2010 census. It is part of the San Antonio Metropolitan Statistical Area. It was named for its first postmaster, Francis Marion Poteet. It is best known as the birthplace of country music star, George Strait.\nPoteet is known for its \"Poteet Strawberry Festival\". Poteet Canyon, Steve Canyon's ward in the long-running comic strip by Milton Caniff, is named after the town. In James Michener's classic, Centennial, cattleman R. J. Poteet led the drive of a large herd of Texas Longhorns north from Texas to Colorado.",
	  "section_context":"Poteet is a city in Atascosa County, Texas, United States. The population was 3,260 as of the 2010 census. It is part of the San Antonio Metropolitan Statistical Area. It was named for its first postmaster, Francis Marion Poteet. It is best known as the birthplace of country music star, George Strait.\nPoteet is known for its \"Poteet Strawberry Festival\". Poteet Canyon, Steve Canyon's ward in the long-running comic strip by Milton Caniff, is named after the town (and a mosaic of Poteet Canyon stands in front of the town's fire station). In James Michener's classic, Centennial, cattleman R. J. Poteet led the drive of a large herd of Texas Longhorns north from Texas to Colorado.",
	  "description_length":25,
	  "caption_length":25,
	  "identical_text":true,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"ident",
	  "img_id":"1163.jpg"
	}
  ];

var main_trials_nonident = [
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/09\/Christ_Church_%28Alexandria%2C_Virginia%29.JPG",
	  "page_title":"Virginia",
	  "section_title":"Religion",
	  "caption":"Christ Church in Alexandria was frequented by George Washington.",
	  "caption_attribution_description":"English: Christ Church in Alexandria, Virginia. This is an image of a place or building that is listed on the National Register of Historic Places in the United States of America. Its reference number is 70000899",
	  "description":"An 18th-century red brick church with white steeple behind a modern road in autumn.",
	  "page_context":"Virginia, officially the Commonwealth of Virginia, is a state in the Southeastern and Mid-Atlantic regions of the United States between the Atlantic Coast and the Appalachian Mountains. The geography and climate of the Commonwealth are shaped by the Blue Ridge Mountains and the Chesapeake Bay, which provide habitat for much of its flora and fauna. The capital of the Commonwealth is Richmond; Virginia Beach is the most-populous city, and Fairfax County is the most-populous political subdivision. The Commonwealth's estimated population as of 2019 is over 8.54 million.\nThe area's history begins with several indigenous groups, including the Powhatan. In 1607 the London Company established the Colony of Virginia as the first permanent English colony in the New World. Virginia's state nickname, the Old Dominion, is a reference to this status. Slave labor and the land acquired from displaced Native American tribes each played a significant role in the colony's early politics and plantation economy. Virginia was one of the 13 Colonies in the American Revolution.",
	  "section_context":"Virginia is predominantly Christian and Protestant; Baptist denominations combined to form largest group with about 26 percent of the population as of 2014, and around 763,655 total members as of 2010. Baptist denominational groups in Virginia include the Baptist General Association of Virginia, with about 1,400 member churches, which supports both the Southern Baptist Convention and the moderate Cooperative Baptist Fellowship; and the Southern Baptist Conservatives of Virginia with more than 500 affiliated churches, which supports the Southern Baptist Convention. Roman Catholics are the second-largest religious group with 673,853 members. The Roman Catholic Diocese of Arlington includes most of Northern Virginia's Catholic churches, while the Diocese of Richmond covers the rest.\nThe Virginia Conference is the regional body of the United Methodist Church in most of the Commonwealth, while the Holston Conference represents much of extreme Southwest Virginia. The Virginia Synod is responsible for the congregations of the Lutheran Church. Presbyterian, Pentecostal, Congregationalist, and Episcopalian adherents each comprised less than two percent of the population as of 2010. The Episcopal Diocese of Virginia, Southern Virginia, and Southwestern Virginia support the various Episcopal churches.\nIn November 2006, 15 conservative Episcopal churches voted to split from the Diocese of Virginia over the ordination of openly gay bishops and clergy in other dioceses of the Episcopal Church; these churches continue to claim affiliation with the larger Anglican Communion through other bodies outside the United States. Though Virginia law allows parishioners to determine their church's affiliation, the diocese claimed the secessionist churches' buildings and properties. The resulting property law case, ultimately decided in favor of the mainline diocese, was a test for Episcopal churches nationwide.\nAmong other religions, adherents of The Church of Jesus Christ of Latter-day Saints constitute one percent of the population, with two hundred congregations in Virginia as of 2017. Fairfax Station is the site of the Ekoji Buddhist Temple, of the Jodo Shinshu school, and the Hindu Durga Temple. While the state's Jewish population is small, organized Jewish sites date to 1789 with Congregation Beth Ahabah. Muslims are a growing religious group throughout the Commonwealth through immigration. Megachurches in the Commonwealth include Thomas Road Baptist Church, Immanuel Bible Church, and McLean Bible Church. Several Christian universities are also based in the state, including Regent University, Liberty University, and the University of Lynchburg.",
	  "description_length":83,
	  "caption_length":64,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"811.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/a5\/Tragweise_-_Royal_Order_of_the_Lion_%28Godenu%29.png",
	  "page_title":"Royal Order of the Lion of Godenu",
	  "section_title":"Privileges",
	  "caption":"Order of Wear - Royal Order of the Lion (Godenu)",
	  "caption_attribution_description":"Deutsch: Tragweise - Royal Order of the Lion (Godenu)",
	  "description":"Order of Wear - Royal Order of the Lion of Godenu",
	  "page_context":"The Royal Order of the Lion of Godenu is a dynastic Order of Merit in the sub-national kingdom of Godenu, Volta Region of Ghana.\nThe current Grand Master of the Order is the traditional ruler Togbe Osei III.",
	  "section_context":"All members are entitled to use the honorary title of \"Knight\" or \"Dame\".\nRecipients of the Grand Cross may use the prefix style of \"His or Her Excellency\". Grand Officers and Commanders may use the prefix style of \"The Honourable\".\nMembers are entitled to wear the Order's Insignia at the appropriate grade and may use the Order's Insignia in their heraldry.",
	  "description_length":49,
	  "caption_length":48,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"464.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/57\/C._amblyrynchus.JPG",
	  "page_title":"Grey reef shark",
	  "section_title":"Behavior",
	  "caption":"Grey reef sharks become more active as night approaches.",
	  "caption_attribution_description":"Carcharhinus amblyrhynchos",
	  "description":"Photo of shark in twilit waters with coral head in background",
	  "page_context":"The grey reef shark is a species of requiem shark, in the family Carcharhinidae. One of the most common reef sharks in the Indo-Pacific, it is found as far east as Easter Island and as far west as South Africa. This species is most often seen in shallow water near the drop-offs of coral reefs. The grey reef shark has the typical \"reef shark\" shape, with a broad, round snout and large eyes. This species can be distinguished from similar species by the plain or white-tipped first dorsal fin, the dark tips on the other fins, the broad, black rear margin on the tail fin, and the lack of a ridge between the dorsal fins. Most individuals are less than 1.9 m long.\nGrey reef sharks are fast-swimming, agile predators that feed primarily on free-swimming bony fishes and cephalopods. Their aggressive demeanor enables them to dominate many other shark species on the reef, despite their moderate size. Many grey reef sharks have a home range on a specific area of the reef, to which they continually return. However, they are social rather than territorial.",
	  "section_context":"Grey reef sharks are active at all times of the day, with activity levels peaking at night. At Rangiroa, groups of around 30 sharks spend the day together in a small part of their collective home range, dispersing at night into shallower water to forage for food. Their home range is about 0.8 km² (0.31 sq mi). At Enewetak in the Marshall Islands, grey reef sharks from different parts of the reef exhibit different social and ranging behaviors. Sharks on the outer ocean reefs tend to be nomadic, swimming long distances along the reef, while those around lagoon reefs and underwater pinnacles stay within defined daytime and nighttime home ranges. Where  strong tidal currents occuur, grey reef sharks move against the water, towards the shore with the ebbing tide and back out to sea with the rising tide. This may allow them to better detect the scent of their prey, or afford them the cover of turbid water in which to hunt.\nLittle evidence of territoriality is seen in the grey reef shark; individuals tolerate others of their species entering and feeding within their home ranges. Off Hawaii, individuals may stay around the same part of the reef up to three years, while at Rangiroa, they regularly shift their locations  up to 15 km (9.3 mi). Individual grey reef sharks at Enewetak become highly aggressive at specific locations, suggesting they may exhibit dominant behavior over other sharks in their home areas.",
	  "description_length":61,
	  "caption_length":56,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"142.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/3a\/Antonoff_in_Tucson.jpg",
	  "page_title":"Green Light (Lorde song)",
	  "section_title":"Composition and lyrical interpretation",
	  "caption":"Jack Antonoff (pictured) co-wrote \"Green Light\".",
	  "caption_attribution_description":"Jack Antonoff",
	  "description":"A young Caucasian man holding a red electric guitar stands against a dark background lit with a blue spotlight.",
	  "page_context":"\"Green Light\" is a song by New Zealand singer Lorde, from her second studio album Melodrama. Universal Music New Zealand released the song on 2 March 2017 as the album's lead single. Lorde co-wrote and co-produced the song with Jack Antonoff, with additional writing by Joel Little and production assistance from Frank Dukes and Kuk Harrell. \"Green Light\" was described as an electropop, dance-pop, and post-disco song with an upbeat piano loop, hand-claps, bass and strings in its instrumentation. In the lyrics, Lorde uses a \"green light\" as a street signal metaphor that gives her permission to move on into the future.\nContemporary critics received \"Green Light\" with acclaim and praised its musical style, and Lorde's vocal delivery. It was called a break-up anthem. Several sites ranked it as one of the best songs of the year, with NME and The Guardian placing it in the top spot on their respective lists. The single garnered success on charts internationally, peaking at number 19 on the US Billboard Hot 100, and at number nine on the Canadian Hot 100 chart. In Oceania, it reached number four in Australia, and number one in New Zealand.",
	  "section_context":"\"Green Light\" was written by Lorde (credited under her birth name Ella Yelich-O'Connor), Antonoff, and Joel Little, with production handled by the former two and Frank Dukes. It was the first track Lorde wrote for Melodrama. Writing took place over an 18-month period. Lorde's first heartbreak inspired the lyrics, leading reviewers to characterise them as being \"downbeat\" as well as having an \"acceptance of longing\". \nSpencer Kornhaber from The Atlantic stated that Lorde was singing about the transitional phase of a breakup and obsessing over her ex \"misleading\" his new partner in the lyrics, \"She thinks you love the beach, you’re such a damn liar\". Kornhaber compared the \"loop of bliss\" in the last minute of the track to The Smiths song \"How Soon Is Now?\" (1984). Pretty Much Amazing writer Danilo Bortoli noted a change in perspective in Lorde's songwriting compared to her debut album. He also wrote that she used to portray the \"role of master observer\" and compared her new view to British singer Tracey Thorn.\nMusically, \"Green Light\" was described as an electropop, dance-pop, and post-disco song. According to sheet music published at Musicnotes.com by Sony\/ATV Music Publishing, \"Green Light\" is set in common time with a \"driving\" tempo of 129 beats per minute. The song is composed in the key of A major, with Lorde's vocals ranging between the notes of D₃ and A₄. The BBC described the chorus that follows this section as \"euphoric\", while Forbes deemed it as power pop, featuring hand-claps, bass, and strings.\nThe track begins with her singing solo with a lone piano playing \"slow, steady\" power chords consisting of a root note and the fifth above. Subsequently, in the first of the song's two pre-choruses, a \"throbbing beat\" plays amid \"tongue-twisting lyrics, eerie background vocals, and bubbling electronic effects.\" In the second pre-chorus, a \"cheery, upbeat piano loop and a kick drum\" accompany Lorde as she sings about an \"uneasy new reality.\" Here, the titular metaphor comes in the form of a hook: \"I'm waiting for it, that green light, I want it,\" leading reviewers to interpret the \"green light\" as a street signal that gives the singer permission to move on into the future.",
	  "description_length":111,
	  "caption_length":48,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"66.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/32\/Nebet_tepe_view_2.jpg",
	  "page_title":"Nebet Tepe",
	  "section_title":"Archeology",
	  "caption":"View from the top of Nebet Tepe",
	  "caption_attribution_description":"English: View from Nebet tepe",
	  "description":"Nebet Tepe",
	  "page_context":"Nebet Tepe is one of the hills of Plovdiv where the ancient town was founded. The earliest settlements on Nebet Tepe are dated back to 4000 BC. The site was first settled by Thracians, later expanded by Philip II of Macedon and the Roman empire. As the town expanded, Nebet Tepe became the citadel of the town's acropolis. There are remains of a fortress walls, towers, and a postern from the time of Justinian leading down to the Maritsa river. Today, the archeological complex on the hill is one of the most popular tourist sights in Plovdiv and a cultural monument of national significance.",
	  "section_context":"The remains of fortress walls, towers and ancient buildings were found during the excavations on Nebet Tepe. The oldest part of the fortress on the hill was built with large syenite blocks roughly fitted together with minimal clearance between adjacent stones and no use of mortar, typical for the cyclopean masonry. The remains of the Western wall with the imposing quadrangular tower and its entrance are evidence of the Hellenistic period when the ancient town expanded and the fortress on Nebet Tepe became the citadel of the town's acropolis. There are also thick stone walls from latter periods and other ancient buildings.\nOne of the most interesting excavations is the unique postern with staircase from Roman times - a secret tunnel in the rocks under the North wall built in the 6th century AD during the reign of Justinian. Some historians say that Apostle Paul walked through this tunnel. The postern is thought to have led to the banks of the Maritsa river.\nWater reservoirs used during enemy sieges were also located on the hill. A large rectangular water reservoir with a volume of 350 cum.m  is preserved in the Southern part of Nebet Tepe. It was built of alternating layers of stones and bricks while the inner walls and the floor were treated with hydrophobic coating.",
	  "description_length":10,
	  "caption_length":31,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"980.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/9e\/Tour_de_France_2015%2C_sagan-bus_%2819441625633%29.jpg",
	  "page_title":"2015 Tour de France",
	  "section_title":"Pyrenees and Massif Central",
	  "caption":"Tinkoff–Saxo's Peter Sagan (pictured in stage nineteen) held the green jersey from the end of stage eleven to the end of the Tour, claiming his fourth consecutive points classification title.",
	  "caption_attribution_description":"210 sagan-bus",
	  "description":"A group of cyclists riding up an incline being led by one wearing a green jersey.",
	  "page_context":"The 2015 Tour de France was the 102nd edition of the Tour de France, one of cycling's Grand Tours. The 3,360.3 km-long race consisted of 21 stages, starting on 4 July in Utrecht, the Netherlands, and concluding on 26 July with the Champs-Élysées stage in Paris. A total of 198 riders from 22 teams entered the race. The overall general classification was won by Chris Froome of Team Sky, with the second and third places taken by Movistar Team riders Nairo Quintana and Alejandro Valverde, respectively.\nBMC Racing Team's Rohan Dennis won the first stage to take the general classification leader's yellow jersey. Trek Factory Racing rider Fabian Cancellara claimed it on the second, only to lose it after crashing out on the following stage. This put Froome in the lead, after the Tour's first uphill finish. He lost the position to Etixx–Quick-Step's Tony Martin at the end of the fourth stage, but Martin's withdrawal from the race after a crash at the end of the sixth stage put Froome back into the lead. He extended this lead during the stages in the Pyrenees and defended it successfully against attacks from Quintana during the final stages that took place in the Alps.",
	  "section_context":"Stage ten was the race's first arrival at altitude with the finish at La Pierre Saint-Martin in the Pyrenees. The day's breakaway was caught and passed on the final climb by a select group. Froome attacked with 6.4 km (4 mi) remaining to take the win, with teammate Richie Porte and Quintana a minute in arrears. The stage saw time gaps open up across the general classification leaders. The biggest loser was Nibali, who came in twenty-first, over four minutes behind Froome, who increased his lead to second placed Tejay van Garderen to two minutes and fifty-two seconds. Froome took the polka dot jersey and Greipel the green. Stage eleven was another mountainous stage; it was won by Rafał Majka (Tinkoff–Saxo), who was part of the early breakaway and attacked on the slopes of the Col du Tourmalet. He soloed across the line in Cauterets one minute ahead of second-placed Dan Martin (Cannondale–Garmin). The green jersey returned to Sagan. Rodríguez gained his second victory of the race on stage twelve; he was part of an early twenty-two rider breakaway that reached the final climb to Plateau de Beille. Froome kept his lead intact.\nStage thirteen saw the escapees being brought inside the one kilometer to go marker (known as the flamme rouge). Greg Van Avermaet of BMC Racing Team took the uphill victory ahead of the chasing Sagan. On stage fourteen, a twenty-four rider breakaway reached the final climb, the Côte de la Croix Neuve. After the breakaway had fractured, Thibaut Pinot and Romain Bardet led over the summit, before Steve Cummings of MTN–Qhubeka overtook them to take the victory at Brenoux Airport on the plateau above Mende. Sagan was part of the breakaway, amassing maximum points at the intermediate sprint. Over four minutes after Cummings had finished, Froome outsprinted Quintana while the other general classification favourites were slightly distanced. Quintana moved into second place overall, displacing Van Garderen. Stage fifteen had for principal difficulty the Col de l'Escrinet climb, which saw most of the sprinters succeeding at passing the climb in the lead group, with the notable exception of Cavendish. Greipel won his third stage of the Tour, followed by John Degenkolb and Alexander Kristoff, respectively. On the next stage, featuring the Col de Manse as the final climb, Rubén Plaza (Lampre–Merida) escaped the leading group of breakaway riders on the ascent. Sagan chased him down the descent, but to no avail as Plaza soloed to victory in Gap. The next day was the second rest day, spent in Gap.",
	  "description_length":81,
	  "caption_length":191,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"632.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/ed\/Location_map_United_Kingdom_Huntingdon.png",
	  "page_title":"List of monastic houses in Cambridgeshire",
	  "section_title":null,
	  "caption":"Locations of monastic houses in Huntingdon",
	  "caption_attribution_description":"English: Map of Huntingdon Geographic limits: N: 52.3547° S: 52.3199° W: -0.2178° E: -0.1539°",
	  "description":"List of monastic houses in Cambridgeshire is located in Huntingdon, Cambridgeshire",
	  "page_context":"The following is a list of monastic houses in Cambridgeshire, England.\nAlien houses are included, as are smaller establishments such as cells and notable monastic granges, and also camerae of the military orders of monks. Monastic hospitals are included where they had the status or function of an abbey, priory, friary or preceptor\/commandery.\nAbbreviations and key\nLocations with names in italics indicate possible duplication or non-existent foundations or ecclesiastical establishments with a monastic name but lacking actual monastic connection.\nThe following locations in Cambridgeshire lack known monastic connections:\nBarnwell Priory Abbey, built adjacent to former Priory Church, called 'The Abbey Church'\nBuckden Abbey: Elizabethan mansion",
	  "section_context":"The following is a list of monastic houses in Cambridgeshire, England.\nAlien houses are included, as are smaller establishments such as cells and notable monastic granges (particularly those with resident monks), and also camerae of the military orders of monks (Knights Templars and Knights Hospitaller). Monastic hospitals are included where they had the status or function of an abbey, priory, friary or preceptor\/commandery.\nAbbreviations and key\nLocations with names in italics indicate possible duplication (misidentification with another location) or non-existent foundations (either erroneous reference or proposed foundation never implemented) or ecclesiastical establishments with a monastic name but lacking actual monastic connection.\nThe following locations in Cambridgeshire lack known monastic connections:\nBarnwell Priory Abbey: (The Church of Saint Andrew-the-Less, Barnwell), built adjacent to former Priory Church, called 'The Abbey Church'\nBuckden Abbey: Elizabethan mansion",
	  "description_length":82,
	  "caption_length":42,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"74.jpg"
	},
	{
	  "language":"en",
	  "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/bf\/OHMap-doton-Hudson.png",
	  "page_title":"David Hudson (pioneer)",
	  "section_title":"Hudson Township",
	  "caption":"Location of Hudson Township in northeastern Ohio",
	  "caption_attribution_description":null,
	  "description":"County map of Ohio",
	  "page_context":"David Hudson was an American businessman noted for founding Hudson Township, the present-day Hudson, Ohio. Hudson was born in Branford, Connecticut and lived there until the age four when his family moved to Goshen, Connecticut. He lived in Goshen for many years, owning a farm, marrying Anna Norton in 1783 and raising the oldest seven of their nine children there. In 1789, Hudson joined a group to purchase a parcel of land in the Connecticut Western Reserve. The following year, he left Goshen to survey the parcel and settle it as Hudson Township. Hudson traveled through the state of New York, west along Lake Erie and south along the Cuyahoga River to reach his land.\nAt the settlement, Hudson and his men built a home and the township's population increased steadily over the next few decades. Hudson's wife and children eventually moved to the township, where they had two more children. Hudson cited religion as a major influence on his life. He died on March 17, 1836 at age 75.",
	  "section_context":"After establishing the center point of their parcel, Hudson and his partners built a trail from that point to their boat on the Cuyahoga. It took more than a week for the group to build the trail and carry their goods from the boat. They then built a small shelter, and began to establish the township.\nThe group experienced hardship over the next few months, including wet weather and a shortage of food. Hudson traveled back up the Cuyahoga to Cleaveland in an attempt to buy food. \"The weather was exceeding wet and very cold, and I experienced the most uncomfortable night I ever felt\", he wrote in his journal.\nWhen Hudson returned to Cleaveland, he found few settlers and no food to spare. He continued east on Lake Erie to the mouth of Cattaraugus Creek, a stream in Western New York. There, Hudson obtained food and brought it back to the settlement.\nBy autumn, its population had grown to thirteen; the group built a 16-by-18-foot (4.9 m × 5.5 m) log house and planted a small turnip garden and a 9-acre (3.6 ha) wheat field. By this time most of the plot had been surveyed, and surveying was completed on October 11.\nThe following day Hudson, his son Ira and two other men returned to Goshen, Connecticut, to sell land on the Western Reserve. Hudson's boat was leaky and the trip was difficult due to cold, inclement weather, but in Goshen he found his family in good health. Hudson sold land on his settlement to twenty-eight people, offering 40 acres (16 ha) to the first purchaser (Miss Ruth Gaylord, who gave the land to her niece).\nOn January 1, 1800 Hudson and his family left Goshen for the township, their new permanent residence. The family stopped in Bloomfield, New York, where they met with the rest of the settlers. Hudson purchased livestock and a year's worth of supplies for $2,000, giving the livestock to four men to drive overland to the settlement. On April 30, the remaining settlers embarked on eight boats, arriving on May 20. On October 28, Anna Hudson gave birth to Anne Maria, the first person born in the settlement.\nBy the end of the year, Hudson's colony was the first established settlement in present-day Summit County. A few more settlers arrived in 1801, and in 1802 the settlement became officially known as Hudson Township.",
	  "description_length":18,
	  "caption_length":48,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"580.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/fc\/Strombus-gigas-001.jpg",
	  "page_title":"Aliger gigas",
	  "section_title":"Historic illustrations",
	  "caption":"Adult shell, apical view, Gualtieri, 1742",
	  "caption_attribution_description":"English: A drawing of a tropic snail Eustrombus gigas (Linnaeus, 1758) Русский: Рисунок тропической улитки Eustrombus gigas (Linnaeus, 1758)",
	  "description":"Antique illustration of large sea snail shell with flaring lip, as viewed more or less from the apex",
	  "page_context":"Aliger gigas, originally known as Strombus gigas or more recently as Lobatus gigas, commonly known as the queen conch, is a species of large edible sea snail, a marine gastropod mollusc in the family of true conches, the Strombidae. This species is one of the largest molluscs native to the Caribbean Sea, and tropical northwestern Atlantic, from Bermuda to Brazil, reaching up to 35.2 centimetres in shell length. A. gigas is closely related to the goliath conch, Lobatus goliath, a species endemic to Brazil, as well as the rooster conch, Lobatus gallus.\nThe queen conch is herbivorous. It feeds by browsing for plant and algal material growing in the seagrass beds, and scavenging for decaying plant matter. These large sea snails typically reside in seagrass beds, which are sandy plains covered in swaying sea grass and associated with coral reefs, although the exact habitat of this species varies according to developmental age. The adult animal has a very large, solid and heavy shell, with knob-like spines on the shoulder, a flared, thick outer lip, and a characteristic pink or orange aperture.",
	  "section_context":"Index Testarum Conchyliorum (published in 1742 by the Italian physician and malacologist Niccolò Gualtieri) contains three illustrations of adult shells from different perspectives. The knobbed spire and the flaring outer lip, with its somewhat wing-like contour expanding out from the last whorl, is a striking feature of these images. The shells are shown as if balancing on the edge of the lip and\/or the apex; this was presumably done for artistic reasons as these shells cannot balance like this.\nOne of the most prized shell publications of the 19th century, a series of books titled Illustrations conchyliologiques ou description et figures de toutes les coquilles connues, vivantes et fossiles (published by the French naturalist Jean-Charles Chenu from 1842 to 1853), contains illustrations of both adult and juvenile A. gigas shells and one uncoloured drawing depicting some of the animal's soft parts. Almost forty years later, a colored illustration from the Manual of Conchology (published in 1885 by the American malacologist George Washington Tryon) shows a dorsal view of a small juvenile shell with its typical brown and white patterning.",
	  "description_length":100,
	  "caption_length":41,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"976.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/f0\/Jimmy_Clanton_1975.JPG",
	  "page_title":"Jimmy Clanton",
	  "section_title":null,
	  "caption":"Clanton in 1975",
	  "caption_attribution_description":"Publicity photo of Jimmy Clanton.",
	  "description":"Jimmy Clanton in 1975",
	  "page_context":"Jimmy Clanton is an American singer who became known as the \"swamp pop R&B teenage idol\". His band recorded a hit song \"Just A Dream\" which Clanton had written in 1958 for the Ace Records label. It reached number four on the Billboard chart and sold a million copies. Clanton performed on Dick Clark's American Bandstand and toured with popular artists like Fats Domino, Jerry Lee Lewis and the Platters.",
	  "section_context":"Jimmy Clanton (born September 2, 1938) is an American singer who became known as the \"swamp pop R&B teenage idol\". His band recorded a hit song \"Just A Dream\" which Clanton had written in 1958 for the Ace Records label. It reached number four on the Billboard chart and sold a million copies. Clanton performed on Dick Clark's American Bandstand and toured with popular artists like Fats Domino, Jerry Lee Lewis and the Platters.",
	  "description_length":21,
	  "caption_length":15,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"314.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/2b\/Bamboo_House_in_Sambava_Madagascar.JPG",
	  "page_title":"Architecture of Madagascar",
	  "section_title":"Plant-based construction",
	  "caption":"Woven bamboo walls, plank roofing",
	  "caption_attribution_description":"English: House made of woven pounded bamboo in Sambava, Madagascar Français&#160;: Case de bambou a Sambava, Madagascar",
	  "description":"Small, rectangular one-room house with walls and roof made of flattened bamboo",
	  "page_context":"The architecture of Madagascar is unique in Africa, bearing strong resemblance to the construction norms and methods of Southern Borneo from which the earliest inhabitants of Madagascar are believed to have immigrated. Throughout Madagascar and the Kalimantan region of Borneo, most traditional houses follow a rectangular rather than round form, and feature a steeply sloped, peaked roof supported by a central pillar.\nDifferences in the predominant traditional construction materials used serve as the basis for much of the diversity in Malagasy architecture. Locally available plant materials were the earliest materials used and remain the most common among traditional communities. In intermediary zones between the central highlands and humid coastal areas, hybrid variations have developed that use cob and sticks. Wood construction, once common across the island, declined as a growing human population destroyed greater swaths of virgin rainforest for slash and burn agriculture and zebu cattle pasture.",
	  "section_context":"Dwellings made of plant material are common in the coastal regions and were once commonly used throughout the Highlands as well. The types of plants available in a given locality determine the building material and style of construction.  The vast majority of homes made of plant material are rectangular, low (one-story) houses with a peaked roof and are often built on low stilts.  These architectural features are nearly identical to those found in parts of Indonesia. Materials used for construction include reeds (near rivers), rushes (in the southwest around Toliara), endemic succulents (as fencing in the south), wood (in the south and among the Zafimaniry, and formerly common in the Highlands), bamboo (especially in the eastern rain forests), papyrus (formerly in the Highlands around Lake Alaotra), grasses (ubiquitous), palms (ubiquitous but prevalent in the west around Mahajanga) and raffia (especially in the north and northeast).\nFor much of the length of the eastern coast of Madagascar bordering the Indian Ocean, architecture is highly uniform: nearly all traditional homes in this region are built on low stilts and are roofed with thatch made of the fronds of the traveler's palm (ravinala madagascariensis). \n The stilts, floor and walls are commonly made of the trunk of this same plant, typically after pounding it flat to make wide planks (for floors and roofing) or narrow strips (for walls). These strips are affixed vertically to the frame; the raffia plant is often used in the same way, in place of the traveler's palm, in the north. When bamboo is used in place of ravinala, the long pounded sheets are often woven together to create walls with a checker-like pattern.\nThese traditional homes have no chimney. Their floor is covered in a woven mat with stones heaped in one corner where wood fires can be burnt to cook food; the smoke that accumulates blackens the ceiling and interior walls over time. The doorways of these homes were traditionally left open or could be shut by a woven screen held closed with a leather strap; today the entryway is frequently hung with a fabric curtain. Variations on this basic template can be found in all coastal regions using locally available material.  The largest of the traditional coastal houses are found in the southeast among the Antemoro, Tanala and Antefasy peoples, where homes can reach 18' long, 9' wide and 15' high.  Elsewhere along the coast homes are much smaller, averaging 10' long, 8' wide and 9' high.",
	  "description_length":78,
	  "caption_length":33,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"832.jpg"
	},
	{
	  "language":"en",
	  "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/da\/John_Joseph_Grimes%2C_1887.jpg",
	  "page_title":"John Grimes (New Zealand bishop)",
	  "section_title":null,
	  "caption":"John Grimes in 1887",
	  "caption_attribution_description":"English: A portrait of Bishop John Grimes of Christchurch.",
	  "description":"Seated portrait photo of a man",
	  "page_context":"John Joseph Grimes was the first Roman Catholic bishop of Christchurch, New Zealand. He was appointed on 13 May 1887 and died in office on 15 March 1915. He was buried in a chapel adjacent to the Cathedral of the Blessed Sacrament.",
	  "section_context":"John Joseph Grimes (11 February 1842 – 15 March 1915) was the first Roman Catholic bishop of Christchurch, New Zealand. He was appointed on 13 May 1887 and died in office on 15 March 1915. He was buried in a chapel adjacent to the Cathedral of the Blessed Sacrament.",
	  "description_length":30,
	  "caption_length":19,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"760.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/dd\/Booleanpercolation.jpg",
	  "page_title":"Stochastic geometry models of wireless networks",
	  "section_title":"Geometrical objects of interest in wireless networks",
	  "caption":"Simulation of four Poisson–Boolean (constant-radius or Gilbert disk) models as the density increases with largest clusters in red.",
	  "caption_attribution_description":"English: This shows the simulation of 4 Poisson Boolean models as the density of points increases (top left has the smallest density, bottom right the largest). Radii are constant (also known as the Gilbert disk model). The red clusters are the largest components in the sample window.",
	  "description":"Percolation in the Boolean-Poisson (constant disk) model.",
	  "page_context":"In mathematics and telecommunications, stochastic geometry models of wireless networks refer to mathematical models based on stochastic geometry that are designed to represent aspects of wireless networks. The related research consists of analyzing these models with the aim of better understanding wireless communication networks in order to predict and control various network performance metrics. The models require using techniques from stochastic geometry and related fields including point processes, spatial statistics, geometric probability, percolation theory, as well as methods from more general mathematical disciplines such as geometry, probability theory, stochastic processes, queueing theory, information theory, and Fourier analysis.\nIn the early 1960s a stochastic geometry model was developed to study wireless networks. This model is considered to be pioneering and the origin of continuum percolation. Network models based on geometric probability were later proposed and used in the late 1970s and continued throughout the 1980s for examining packet radio networks.",
	  "section_context":"There are number of examples of geometric objects that can be of interest in wireless networks. For example,  consider a collection of points in the Euclidean plane. For each point, place in the plane a disk with its center located at the point.  The disks are allowed to overlap with each other and the radius of each disk is random and (stochastically) independent of all the other radii. The mathematical object consisting of the union of all these disks is known as a Boolean (random disk) model and may represent, for example, the sensing region of a sensor network.  If all the radii are not random, but common positive constant, then the resulting model is known as the Gilbert disk (Boolean) model.\nInstead of placing disks on the plane, one may assign a disjoint (or non-overlapping) subregion to each node. Then the plane is partitioned into a collection of disjoint subregions. For example, each subregion may consist of the collection of all the locations of this plane that are closer to some point of the underlying point pattern  than any other point of the point pattern. This mathematical structure is known as a Voronoi tessellation and may represent, for example, the association cells in a cellular network where users associate with the closest base station.\nInstead of placing a disk or a Voronoi cell on a point, one could place a cell defined from the information theoretic channels described above. For instance, the point-to-point channel cell of a point was defined  as the collection of all the locations of the plane where a receiver could sustain a point-to-point channel with a certain quality from a transmitter located at this point. This, given that the other point is also an active transmitter, is a point-to-point channel in its own right .\nIn each case,  the fact that the underlying point pattern is random (for example, a point process) or deterministic (for example, a lattice of points) or some combination of both, will influence the nature of the Boolean model, the Voronoi tessellation, and other geometrical structures such as the point-to-point channel cells constructed from it.",
	  "description_length":57,
	  "caption_length":130,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"727.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/42\/Gears_large.jpg",
	  "page_title":"Idler-wheel",
	  "section_title":"Idler gear",
	  "caption":"Gears in a machine. The middle, medium-sized gear is an idler gear.",
	  "caption_attribution_description":"English: Photograph of spur gears on a piece of farm equipment.",
	  "description":"Part of a machine with three gears connected to one another.",
	  "page_context":"An idler-wheel is a wheel which serves only to transmit rotation from one shaft to another, in applications where it is undesirable to connect them directly. For example, connecting a motor to the platter of a phonograph, or the crankshaft-to-camshaft gear train of an automobile.\nBecause it does no work itself, it is called an \"idler\".",
	  "section_context":"An idler gear is a gear wheel that is inserted between two or more other gear wheels. The purpose of an idler gear can be two-fold. Firstly, the idler gear will change the direction of rotation of the output shaft. Secondly, an idler gear can assist to reduce the size of the input\/output gears whilst maintaining the spacing of the shafts.",
	  "description_length":60,
	  "caption_length":67,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"658.jpg"
	},
	{
	  "language":"en",
	  "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c5\/Mission_Santa_Clara.jpg",
	  "page_title":"Mission Santa Clara de Asís",
	  "section_title":null,
	  "caption":"Mission Santa Clara de Asís, shown in 2008",
	  "caption_attribution_description":"English: Mission Santa Clara de Asís, on the campus of Santa Clara University in California. Français&#160;: La mission Santa Clara de Asís, sur le campus de l'Université de Santa Clara, en Californie (États-Unis).",
	  "description":"Mission Santa Clara",
	  "page_context":"Mission Santa Clara de Asís is a Spanish mission founded by the Franciscan order in the present-day city of Santa Clara, California. The mission, which was the eighth in California, was founded on January 12, 1777. Named for Saint Clare of Assisi, the founder of the order of the Poor Clares and was an early companion of St. Francis of Assisi, this was the first California mission to be named in honor of a woman.\nIt is the namesake of both the city and county of Santa Clara, as well as of Santa Clara University, which was built around the mission. This is the only mission now located on the grounds of a university campus. Although ruined and rebuilt six times, the settlement was never abandoned, and today it functions as the university chapel for Santa Clara University.",
	  "section_context":"Mission Santa Clara de Asís is a Spanish mission founded by the Franciscan order in the present-day city of Santa Clara, California. The mission, which was the eighth in California, was founded on January 12, 1777. Named for Saint Clare of Assisi, the founder of the order of the Poor Clares and was an early companion of St. Francis of Assisi, this was the first California mission to be named in honor of a woman.\nIt is the namesake of both the city and county of Santa Clara, as well as of Santa Clara University, which was built around the mission. This is the only mission now located on the grounds of a university campus. Although ruined and rebuilt six times, the settlement was never abandoned, and today it functions as the university chapel for Santa Clara University.",
	  "description_length":19,
	  "caption_length":42,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"753.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/0f\/Sigmund_Steinnes.jpg",
	  "page_title":"Sigmund Steinnes",
	  "section_title":null,
	  "caption":"Steinnes, 2009.",
	  "caption_attribution_description":"Sigmund Steinnes(1959), ordfører for AP i Storfjord fra 2011",
	  "description":"Sigmund Steinnes",
	  "page_context":"Sigmund Steinnes was a Norwegian politician for the Labour Party.\nIn the 2013 elections he was elected as a deputy representative to the Parliament of Norway from Troms. He met during 90 days of parliamentary session. In the 2011 elections he was elected as the mayor of Storfjord. He died of cancer on 15 November 2018, aged 59.",
	  "section_context":"Sigmund Steinnes (19 January 1959 – 15 November 2018) was a Norwegian politician for the Labour Party.\nIn the 2013 elections he was elected as a deputy representative to the Parliament of Norway from Troms. He met during 90 days of parliamentary session. In the 2011 elections he was elected as the mayor of Storfjord.  He died of cancer on 15 November 2018, aged 59.",
	  "description_length":16,
	  "caption_length":15,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"391.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/a6\/Sir_George_Robey%2C_Finsbury_Park%2C_N4_%282775104871%29.jpg",
	  "page_title":"The Sir George Robey",
	  "section_title":null,
	  "caption":"The pub standing derelict and roofless, in July 2008",
	  "caption_attribution_description":"A pub and former live venue by Finsbury Park station (opposite the Rainbow Theatre), now quite obviously closed. Address: 240 Seven Sisters Road. Former Name(s): The Clarence Tavern. Owner: Mean Fiddler (former). Links: Pubs History (history)",
	  "description":"a pub with no roof or windows",
	  "page_context":"The Sir George Robey was a mid-19th century public house and later a music venue on Seven Sisters Road, Finsbury Park, North London, England. Formerly called The Clarence Tavern, it was renamed in honour of the music hall performer Sir George Robey in 1968.\nThe pub was a Meux's house, and was noted for a plaque advertising their Original London Stout, which remained on the building until its demise, long after the brewery's closure in 1921.\nDuring its time as a music venue, artists who performed at the Sir George Robey include Bad Manners, Billy Bragg, Carter USM, Desmond Dekker, Fairport Convention, Gong, Hawkwind, Bert Jansch, Roy Harper, Ralph McTell, and They Might Be Giants. Blur's Damon Albarn recalled:\nThat was right at the start of Blur. Graham [Coxon] and Alex [James] were still at Goldsmiths so we were just doing our first gigs. First on the bill at an indie all-dayer at the George Robey pub in Finsbury Park which meant we were on at eleven in the morning and just got pissed for the rest of the day, taking advantage of the beer coupons.\nLive albums recorded at the venue include Steve Marriott's Packet of Three's \"Live at the Sir George Robey 23-10-85\".",
	  "section_context":"The Sir George Robey was a mid-19th century public house and later a music venue on Seven Sisters Road, Finsbury Park, North London, England. Formerly called The Clarence Tavern, it was renamed in honour of the music hall performer Sir George Robey (1869–1954) in 1968.\nThe pub was a Meux's house, and was noted for a plaque advertising their Original London Stout, which remained on the building until its demise, long after the brewery's closure in 1921.\nDuring its time as a music venue, artists who performed at the Sir George Robey include Bad Manners, Billy Bragg, Carter USM, Desmond Dekker, Fairport Convention, Gong, Hawkwind, Bert Jansch, Roy Harper, Ralph McTell, and They Might Be Giants. Blur's Damon Albarn recalled:\nThat was right at the start of Blur. Graham [Coxon] and Alex [James] were still at Goldsmiths so we were just doing our first gigs. First on the bill at an indie all-dayer at the George Robey pub in Finsbury Park which meant we were on at eleven in the morning and just got pissed for the rest of the day, taking advantage of the beer coupons.\nLive albums recorded at the venue include Steve Marriott's Packet of Three's \"Live at the Sir George Robey 23-10-85\".  The pub also hosted punk and ska all-nighters, and 'Club Dog' acid-house nights.\nAfter being renamed The Powerhaus in March 1996, when it was taken over by the Mean Fiddler Music Group, and later named Robey, it closed in 2004.\nDespite being locally listed, the building was demolished in 2015, after a period standing derelict, during which it was occupied by squatters and had its interior fittings and floors removed. As of April 2018, the site is still vacant.\nThe pub was directly opposite another, larger, music venue, the Rainbow Theatre.\nThe fictitious venue The Harry Lauder in Nick Hornby's book Fever Pitch was based on The Sir George Robey. Near the end of Irvine Welsh's novel Trainspotting the characters Sick Boy and Begbie visit The Sir George Robey.",
	  "description_length":29,
	  "caption_length":52,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"924.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/82\/Sulhamstead_Tyle_Mill_Lock.JPG",
	  "page_title":"List of locks on the Kennet and Avon Canal",
	  "section_title":"Locks",
	  "caption":"Tyle Mill Lock, Sulhamstead.",
	  "caption_attribution_description":"English: Photographer: User:Ballista",
	  "description":"Narrow boat (named Toad) emerging from lock with black gates and white ends of the gate arms. Around the lock is a grassy area.",
	  "page_context":"The Kennet and Avon Canal is a canal in southern England. The name may refer to either the route of the original Kennet and Avon Canal Company, which linked the River Kennet at Newbury to the River Avon at Bath, or to the entire navigation between the River Thames at Reading and the Floating Harbour at Bristol, including the earlier improved river navigations of the River Kennet between Reading and Newbury and the River Avon between Bath and Bristol.\nThe River Kennet was made navigable to Newbury in 1723, and the River Avon to Bath in 1727. The Kennet and Avon Canal between Newbury and Bath was built between 1794 and 1810 by John Rennie, to convey commercial barges carrying a variety of cargoes. and is 57 miles long. The two river navigations and the canal total 87 miles in length. The section from Bristol to Bath is the course of the River Avon, which flows through a wide valley and has been made navigable by a series of locks and weirs. In the later 19th century and early 20th century the canal fell into disuse following competition from the Great Western Railway, who owned the canal.",
	  "section_context":"The following list numbers the locks from the River Avon in Bristol to the River Thames. It includes one lock that has been removed (98, Ufton Lock) and two that have been combined to form a single deep lock (8 and 9, now Bath Deep Lock). Travelling from Bristol to Reading, locks 1 to 54 are uphill, and locks 55 to 107 are downhill.",
	  "description_length":127,
	  "caption_length":28,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"104.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/d4\/Dismal_River_from_NE97_DS_3.JPG",
	  "page_title":"Dismal River",
	  "section_title":null,
	  "caption":"Looking downstream (east) from Nebraska Highway 97 crossing",
	  "caption_attribution_description":"English: Dismal River, looking downstream (east) from Nebraska Highway 97 crossing in Hooker County.",
	  "description":"Small river running between steep banks",
	  "page_context":"The Dismal River is a winding 71.9-mile-long river in the state of Nebraska. It is formed by the confluence of two forks, one of which has its origins in Grant County and the other in Hooker County. The forks meet near Nebraska Highway 97 between Mullen and Tryon. From here the Dismal River flows east-southeast into Thomas County, crossing U.S. Highway 83 south of Thedford. Passing just south of the Nebraska National Forest, it turns slightly to the northeast before its confluence with the Middle Loup River just west of Dunning in Blaine County.\nMost of the land along the river is privately owned and used for ranching. The water comes from the Ogallala Aquifer and boils up beneath the river in places, sometimes creating areas of quicksand. Deer, coyotes, beavers, turkey and rattlesnakes inhabit the area along the river.\nThough much of the river's length is unpopulated, the Dismal River Golf Course, designed by Jack Nicklaus, borders it south of Mullen.",
	  "section_context":"The Dismal River is a winding 71.9-mile-long (115.7 km) river in the state of Nebraska.  It is formed by the confluence of two forks, one of which has its origins in Grant County and the other in Hooker County. The forks meet near Nebraska Highway 97 between Mullen and Tryon.  From here the Dismal River flows east-southeast into Thomas County, crossing U.S. Highway 83 south of Thedford.  Passing just south of the Nebraska National Forest (once the Dismal River National Forest), it turns slightly to the northeast before its confluence with the Middle Loup River just west of Dunning in Blaine County.\nMost of the land along the river is privately owned and used for ranching.  The water comes from the Ogallala Aquifer and boils up beneath the river in places, sometimes creating areas of quicksand.   Deer, coyotes, beavers, turkey and rattlesnakes inhabit the area along the river.\nThough much of the river's length is unpopulated, the Dismal River Golf Course, designed by Jack Nicklaus, borders it south of Mullen.",
	  "description_length":39,
	  "caption_length":59,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"399.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/cb\/AS_ski.jpg",
	  "page_title":"ActionShot",
	  "section_title":null,
	  "caption":"ActionShot photograph of a snowboarder.",
	  "caption_attribution_description":"English: ActionShot of Ski",
	  "description":"Synthetic photograph with several appearances of snowboarder gliding over a snow-covered valley",
	  "page_context":"ActionShot is a method of capturing an object in action and displaying it in a single image with multiple sequential appearances of the object.\nAdditional names: action synopsis, motion synopsis, panoramic video synopsis, dynamic still, synopsis mosaic, stromotion.",
	  "section_context":"ActionShot is a method of capturing an object in action and displaying it in a single image with multiple sequential appearances of the object.\nAdditional names: action synopsis, motion synopsis, panoramic video synopsis, dynamic still, synopsis mosaic, stromotion.",
	  "description_length":95,
	  "caption_length":39,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"329.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/09\/John_Colborne.jpg",
	  "page_title":"List of Old Wykehamists",
	  "section_title":"Eighteenth century",
	  "caption":"Field Marshal John Colborne",
	  "caption_attribution_description":"English: Field Marshal Sir John Colborne, GCB, GCMG (Baron Seaton), Lieutenant Governor of Guernsey, Lieutenant Governor of Upper Canada, founder of Upper Canada College, Commander-in-Chief of the British armed forces during the Rebellions of 1837 in the Canadas, Acting Governor of British North America, Commander-in-Chief of Ireland",
	  "description":"Painting of Field Marshal John Colborne in red u;niform with sash and medals",
	  "page_context":"Former pupils of Winchester College are known as Old Wykehamists, in memory of the school's founder, William of Wykeham. He was Bishop of Winchester and Lord Chancellor of England. He used the wealth these positions gave him to establish both the school and a university college, New College, Oxford, in 1382; both of them were set up to provide an education for 70 scholars. Winchester College opened in 1394.\nWilliam of Wykeham provided that up to two pupils a year who could prove they were his descendants could attend the school at its expense; they were known as Consanguineus Fundatoris, \"Founder's Kin\". Ranulph Twisleton-Wykeham-Fiennes records that the tradition ended in 1868, by which time fourteen members of his family had received a free education. At first only a small number of pupils other than scholars were admitted; by the 15th century the school had around 100 pupils in total, nominally the 70 scholars, 16 choirboys and the rest \"commoners\". Demand for places for commoners was high, and though at first restricted, numbers gradually rose. From the 1860s, ten boarding houses, each for up to sixty pupils, were added, greatly increasing the school's capacity.",
	  "section_context":"Robert Lowth, Bishop of London, Hebraist and English grammarian\nWilliam Whitehead, Poet Laureate\nWilliam Collins, poet\nJoseph Warton, literary critic and Headmaster of Winchester\nWilliam Douglas, 4th Duke of Queensberry, nobleman, and a noted gambler\nThomas Warton, Poet Laureate\nJames Eyre, judge\nCharles Wolfran Cornwall, Speaker of the House of Commons\nJames Woodforde, clergyman and diarist\nGeorge Isaac Huntingford, Bishop of Hereford and Gloucester\nThomas Burgess, author\nHenry Addington, 1st Viscount Sidmouth, Prime Minister\nJohn Hawkins, geologist, traveller, and Fellow of the Royal Society\nWilliam Lisle Bowles, poet who revived the sonnet\nWilliam Howley, Archbishop of Canterbury\nSydney Smith, essayist and satirist\nRichard Mant, Church of Ireland bishop and writer\nJohn Colborne, 1st Baron Seaton, Field Marshal and colonial governor\nWilliam Buckland, theologian and geologist\nWilliam Ward, record-scoring cricketer\nThomas Arnold, headmaster of Rugby\nWalter Farquhar Hook, Tractarian vicar of Leeds\nThomas Oliphant, musician and lyricist",
	  "description_length":76,
	  "caption_length":27,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"130.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/5f\/%D0%A1%D0%BF%D0%BE%D0%BC%D0%B5%D0%BD%D0%B8%D0%BA_%D0%88%D0%BE%D0%B2%D0%B0%D0%BD%D1%83_%D0%A6%D0%B2%D0%B8%D1%98%D0%B8%D1%9B%D1%83_%D0%A1%D0%9F001_DSC_2944.JPG",
	  "page_title":"Jovan Cvijić",
	  "section_title":"Works",
	  "caption":"Monument to Jovan Cvijić in Academy Park, Belgrade",
	  "caption_attribution_description":"Српски (ћирилица)‎: Ово је фотографија заштићеног природног добра у Србији под шифром: СП001 This is a a photo of a natural area in Serbia with ID: СП001 Споменик Јовану Цвијићу у Академском парку у Београду",
	  "description":"Statue of man in cape on a pedestal in front of a building",
	  "page_context":"Jovan Cvijić was a Serbian geographer and ethnologist, president of the Serbian Royal Academy of Sciences and rector of the University of Belgrade. Cvijić is considered the founder of geography in Serbia. He began his scientific career as a geographer and geologist, and continued his activity as a human geographer and sociologist.",
	  "section_context":"In more than 30 years of scientific study, Cvijić published many works. One of the best-known is The Balkan Peninsula. \nOther publications include:\nKa poznavanju krša istočne Srbije, 1889.\nPrekonoška pećina, 1891.\nGeografska ispitivanja u oblasti Kučaja,  1893.\nDas Karstphänomen, Geographiche Abhandlungen, Wien, 1893.\nKarst, geografska monografija, Belgrade 1895.\nPećine i podzemna hidrografija u istočnoj Srbiji, 1895.\nIzvori, tresave i vodopadi u istočnoj Srbiji, 1896.\nTragovi starih glečera na Rili, 1897.\nGlacijalne i morfološke studije o planinama Bosne, Hercegovine i Crne Gore, 1899.\nKarsna polja zapadne Bosne i Hercegovine, 1900.\nStruktura i podela planina Balkanskog poluostrva, 1902.\nAntropogeografski problemi Balkanskog poluostrva, 1902.\nNovi rezultati o glacijalnoj eposi Balkanskog poluostrva, 1903.\nBalkanska, alpijska i karpatska glacijacija, 1903.\n\"Die Tektonik der Balkanhalbinsel mit besonderer Berückichtigung der neueren Fortschritte in der Kenntnis der Geologie von *Bulgarien, Serbien und Mazedonien\". C.R. IX. Cong. géol. intern. de Vienne. Wien: Hollinek Fréres. 1904. pp. 348–370. Retrieved 21 May 2018 – via Internet Archive.\nNekolika posmatranja o etnografiji makedonskih Slovena, 1906.\nOsnove za geografiju i geologiju Makedonije i Stare Srbije, 1, 1906; 2, 1906; 3, 1911.\nGrundlinien der Geographie und Geologie von Mazedonien und Alt-Serbien. Nebst Beobachtungen in Thrazien, Thessalien, Epirus und *Nordalbanien, 1908.\nJezerska plastika Šumadije, 1909.\nL'anexion de la Bosnie et la question Serbe, Paris, 1909.\nDinarski Srbi, 1912.\nIzlazak Srbije na Jadransko More, 1912.\nRaspored Balkanskih naroda, 1913.\nLedeno doba u Prokletijama i okolnim planinama, 1913.\nJedinstvo i psihički tipovi dinarskih južnih Slavena, 1914.\nMouvements metanastasiques dans la Peninsule Balkanique, La Monde Slave, 1917.\nHydrographie souterraine et évolution morphologique du Karst, 1918.\nLa Peninsule Balkanique, Geographie Humaine, 1918.\nEtnogeografske karte jugoslovenskih zemalja, 1918.\nSeverna granica južnih Slavena (La frontiere septentrionale des Jugoslaves), 1919.\nĐerdapske terase, 1922.\nBalkansko poluostrvo i južnoslovenske zemlje, 1922.\nMetanastazička kretanja, njihov uzrok i posledice, 1922.\nGeomorfologija I-II, 1924. and 1926.\nKarst i čovek, 1925.\nKarst i srpske narodne pripovetke, 1925.\nSeobe i etnički procesi u našem narodu, 1927.\nBalkansko poluostrvo i južnoslavenske zemlje, 1931.",
	  "description_length":58,
	  "caption_length":50,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"404.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/98\/Man%C3%A1_2007.06.26_004.jpg",
	  "page_title":"List of number-one Billboard Latin Pop Airplay songs of 2003",
	  "section_title":null,
	  "caption":"The group Maná earned the #1 spot with the hit \"Mariposa Traicionera\" (Eng: Treacherous Butterfly) which belong to their album Revolución de Amor, this song spent just one week at the peak position.",
	  "caption_attribution_description":"Maná",
	  "description":"A man singing in a concert.",
	  "page_context":"The most popular Latin pop songs in 2003, ranked by radio airplay audience impressions and measured by Nielsen BDS.",
	  "section_context":"The most popular Latin pop songs in 2003, ranked by radio airplay audience impressions and measured by Nielsen BDS.",
	  "description_length":27,
	  "caption_length":198,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"317.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/d0\/Along_far_coasts%2C_songs_album_by_Akiva_Nof.jpg",
	  "page_title":"Akiva Nof",
	  "section_title":null,
	  "caption":"Nof's \"Along far coasts\" album",
	  "caption_attribution_description":"English: Vinyl album \"Along far coasts\" by Akiva Nof",
	  "description":"Songs by Akiva Nof",
	  "page_context":"Akiva Nof is an Israeli poet and songwriter, composer, politician, lawyer and a journalist, who served three terms as a member of the Knesset between 1974 and 1984.",
	  "section_context":"Akiva Nof (Hebrew: עקיבא נוף, born 2 December 1936) is an Israeli poet and songwriter, composer,  politician, lawyer and a journalist, who served three terms as a member of the Knesset between 1974 and 1984.",
	  "description_length":18,
	  "caption_length":30,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"646.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8f\/Bowl_Chaco_Culture_NM_USA.jpg",
	  "page_title":"Ceramics of indigenous peoples of the Americas",
	  "section_title":"Pueblo cultures",
	  "caption":"Ceramic bowl from Chaco Canyon in New Mexico, Pueblo III phase",
	  "caption_attribution_description":"Chaco Anasazi bowl.",
	  "description":"Ceramic bowl with geometric design inside from Chaco Canyon in New Mexico, Pueblo III Era",
	  "page_context":"Native American pottery is an art form with at least a 7500-year history in the Americas. Pottery is fired ceramics with clay as a component. Ceramics are used for utilitarian cooking vessels, serving and storage vessels, pipes, funerary urns, censers, musical instruments, ceremonial items, masks, toys, sculptures, and a myriad of other art forms.\nDue to their resilience, ceramics have been key to learning more about pre-Columbian indigenous cultures.",
	  "section_context":"Ancestral Pueblo\nMogollon culture, including Mimbres culture, which produced Mimbres pottery\nSanta Clara Pueblo, Taos Pueblo, Hopi, San Ildefonso Pueblo, Acoma Pueblo and the Zuni. Noted individuals involved in Pueblo pottery include Nampeyo of the Hopi, and Maria and Julian Martinez of San Ildefonso Pueblo.  In the early 1900s, Maria Martinez and her husband Julian rediscovered how to make the traditional Black-on Black pottery, for which San Ildefonso Pueblo would soon become widely known.",
	  "description_length":89,
	  "caption_length":62,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"403.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/44\/55th_Division_soldiers_marching_through_Bethune_after_defence_of_Givenchy%2C_April_1918_%28Q_342%29.jpg",
	  "page_title":"55th (West Lancashire) Division",
	  "section_title":"Defence of Givenchy",
	  "caption":"Soldiers of the division marching through Bethune after being pulled out of the line",
	  "caption_attribution_description":"English: Battle of the Lys: Men from a battalion of the 55th Division marching through Bethune on their way back from the trenches for rest, 10 April 1918. (provided date likely incorrect as on that day the division would have still been in battle, more likely photographed between 16-18 April)",
	  "description":"see text",
	  "page_context":"The West Lancashire Division was an infantry division of the British Army, active during both the First and Second World Wars. The division was raised in 1908 following the creation of the Territorial Force. Following the outbreak of the First World War, the majority of the division's men volunteered for overseas service. Through 1915, the division was slowly wound down as entire units were dispatched overseas. Those who did not volunteer, were used to form new reserve units and eventually the 2nd West Lancashire Division.\nIn 1916, the division was reformed in France as the 55th (West Lancashire) Division, and was reassigned the units that had been transferred. During the Battle of the Somme, the division fought several actions at Guillemont, Ginchy, and Morval. In 1917, the division fought at Pilckem and Menin Road Ridges during the Battle of Passchendaele, gaining an excellent reputation. Late in 1917, the division fought in the Battle of Cambrai. Towards the end of the battle, the division was forced back around 1 mile by a large German attack.",
	  "section_context":"When the opening attack of the Spring Offensive did not achieve the desired result, the Germans shifted their effort north (to the Ypres sector) to immediately strike again. At 04:15 on 9 April, the German bombardment marking the beginning of Operation Georgette, began in the divisional sector. The engagement in the southern part of the Allied line became known as the Battle of Estaires. The German bombardment, using the greatest concentration of German guns during the war, shelled the frontline and transportation routes in the divisional rear as far back as Locon. It was believed that the Germans had launched a large-scale raid upon the Portuguese, and the 166th Brigade was ordered to move and reinforce them. Rather than a raid, the Portuguese division had collapsed under the weight of a full-scale attack and resulted in the 55th's flank being exposed.\nAt 09:00, the German 4th Ersatz, 43rd Reserve, and 18th Reserve divisions launched an attack upon the 55th Division's 4,000-yard (3,700 m) frontline. The German divisions had circulated orders that stated the \"English 55th Division\", after battles on the Somme, Flanders, and Cambrai, \"was described by prisoners ... as a Division ... that is below the average quality.\" Due to mist, visibility was limited to 30 yards (27 metres), hindering the British ability to repulse the attack. German infantry pushed through the frontline between strongpoints held by the 164th Brigade and within half an hour were assaulting the 1\/4LR battalion headquarters. The bypassed British frontline positions, now surrounded, held out, impeding the German efforts. Local counter-attacks resulted in the reoccupation of the majority of territory lost by early afternoon, with forward posts retaken at dusk. By the end of the day, the brigade had reclaimed its entire sector. Second Lieutenant John Schofield earned the VC for his actions during the brigade's fighting.\nAt 09:50, the Germans attacked the 165th Brigade, having moved around their flank after the defeat of the Portuguese. The Germans pushed through the brigade's forward positions, but due to the resistance of bypassed garrisons, their attack was disrupted. The German attack only partially broke through the brigade's main line of resistance in one place, and a local counter-attack quickly restored the position. Repeated German attacks were launched upon the brigade, reinforced with several infantry companies from the 166th Brigade, throughout the afternoon, but were unable to make any gains. For his actions fighting with the brigade, Second Lieutenant Joseph Henry Collin was posthumously awarded the VC.\nUnder artillery fire all morning, and having to dispatch troops to the division's other brigades, the 166th Brigade had moved into defensive positions on the flank of the 165th Brigade by early afternoon. It was then reinforced by elements of the divisional pioneer battalion and RE companies. The 51st (Highland) Division's 154th Brigade was attached to the division and took defensive positions around Locon, with its 1\/4th Battalion, Seaforth Highlanders moved forward to reinforce the 166th Brigade. During the day, the Germans made several unsuccessful efforts to breach the 166th Brigade's positions. Historian Don Farr wrote that the division's efforts, in conjunction with other divisions in the area, had forced major delays on the German assault plan, \"their plan had called for them to be across the River Lys along the whole length of their assault\" by the end of the day, instead they had only made minor gains.\nBefore dawn on 10 April, the 3rd Division's 9th Brigade and 42nd Brigade Royal Field Artillery were attached to the division. The artillery were moved to support the 166th Brigade (minus two batteries attached to the 51st Division for the day). One battalion of the 9th Brigade was placed in divisional reserve, and the remaining two attached to the 164th and 165th Brigades. The German attacks resumed at 07:40, with a strong infantry attack under the cover of an intense artillery barrage. Despite fierce fighting throughout the day, the Germ",
	  "description_length":8,
	  "caption_length":84,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"482.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8a\/Centrale_thermique_de_Tracy_%283%29.jpg",
	  "page_title":"Tracy Thermal Generating Station",
	  "section_title":"Technical overview",
	  "caption":"The generating station's four smokestacks.",
	  "caption_attribution_description":"Français&#160;: Cheminées de la Centrale thermique de Tracy, au Québec. English: Chimneys of the Tracy thermal generating station in Quebec.",
	  "description":"Close-up view of four red and white chimneys.",
	  "page_context":"The Tracy Thermal Generating Station is a retired 660-megawatt heavy fuel oil-fueled thermal power station built from 1962 by the Shawinigan Water & Power Company and completed by Hydro-Québec after the buyout of all private electric utilities by the government of Quebec in 1963. Commissioned between 1964 and 1968, the plant is located on the banks of the Saint Lawrence River in the city of Sorel-Tracy, in the Montérégie Region.\nMainly used as a peaker plant, the Tracy facility was usually running during cold spells in the winter. It was sometimes operated year-round to supplement hydroelectric generation during low-water years.\nAlthough it was operated only sporadically, the generating station has been criticized for its contribution to air pollution as it was one of Quebec's major sources of carbon dioxide, sulfur dioxide, nitrogen oxides and particulates. Some commentators have accused Hydro-Québec of unnecessarily operating the Tracy thermal plant to export electricity by taking advantage of low fuel prices at certain times.\nThe Tracy Thermal Generating Station was kept as a reserve during the 2010–2011 winter and permanently shut down on March 1, 2011.",
	  "section_context":"Thermal power plants play a marginal role in Hydro-Québec's system, which is dominated by hydropower. In 2009, non-nuclear thermal generation accounted for 4.4% of nameplate capacity but only generated 446 GWh, 0.3% of total energy production. More expensive to run and more polluting than hydroelectric power plants, thermal plants are used to generate power during peak conditions, but most of the company's thermal plants serve remote communities not connected to the main power grid in Nunavik, on the Lower North Shore, in Haute-Mauricie and in the Magdalen Islands.\nA thermal power station such as Tracy converts the energy contained in heavy fuel oil into heat, motion, and then into electrical energy. Burning fuel vaporize water and the steam expands to drive a turbine that spins the rotor of an alternator to generate electricity. Condensing water is then reused for another cycle. In the process, water is preheated six times, raising its temperature from 27 °C (80 °F) to 238 °C (460 °F), and goes through a deaerator and an economizer before entering the boiler at a temperature of 340.5 °C (645 °F), close to the boiling point under pressure.\nEach boiler is 12 m (40 ft) long and 9 m (30 ft) wide at its base and rises to 55 m (180 ft), the equivalent of a 13-floor building. At the top, a 16 m (50 ft) long steam drum separates water and saturated steam. The boiler is heated by 16 burners, four in each corner, which can be retracted and tilted to control the steam temperature. The steam becomes an ideal gas at 539.4 °C (1,003 °F) and a pressure of 12.75 MPa (1,850 PSI) after being forced into the superheater. The plant boilers have been designed to be converted to coal in the event that it became a cheaper solution. Spaces for storing and handling coal were set aside in the planning phase.\nAt its rated power, the plant burned 159,000 litres (1,000 barrels) of heavy fuel oil per hour. Ten 200,000-barrel fuel storage tanks are located behind the plant and were supplied with fuel from the Montreal and Lévis refineries by tanker or by rail.\nEach unit was designed to \"hot\" start within 20 or 30 minutes. A cold start can take between three and four hours. It is a delicate operation, since moving parts must be relatively uniformly warmed to prevent damage. The success of this operation involves more than 70 steps and is controlled by a sequence monitoring system to avoid missteps. Cooling off a unit after use required precautions to prevent buckling of the main shaft.\nThe plant was easily recognizable by its four 137-metre (449 ft) high red-and-white smokestacks. Framed with safety valves, the chimneys were only 82 m (270 ft) tall when the plant opened in the 1960s, but were raised in 1980 in response to environmental considerations. The plant's maximum annual output was limited to 2.6 TWh due to air pollution regulations.\nThe transmission towers near the plant is part of a 735 kV transmission line crossing the Saint Lawrence River. They are 174.6 m (573 ft) high, making them the tallest in Canada. The power station's terminal substation is linked to the power grid by four 230 kV lines to Boucherville, Varennes, Contrecoeur, Carignan (lines 2320 and 2322) and Sorel-Tracy (lines 2332 and 2336).",
	  "description_length":45,
	  "caption_length":42,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"152.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/69\/Cardiff_Cycleway_1_-_Next_to_the_Student_Union.jpg",
	  "page_title":"Cycling in Cardiff",
	  "section_title":"Strategy",
	  "caption":"Looking down a completed section of Cycleway 1 on Senghenydd Road. This shows how parked cars are kept on the outside, providing a buffer between the cycle track and the main road. Plans for new cycleways are similar to this.",
	  "caption_attribution_description":"English: Looking down Cycleway 1, Senghenydd Road, Cardiff. There is a courtesy pedestrian crossing in the foreground, with a ramp for cyclists to reduce speed. This section of cycleway is next to shops on the ground level of Cardiff Student Union.",
	  "description":"Looking down a completed section of Cycleway 1 on Senghenydd Road.",
	  "page_context":"Cycling in Cardiff, capital of Wales, is facilitated by its easy gradients and large parks. In the mid-2000s between 2.7% and 4.3% of people commuted to work by cycling in the city. In 2017 12.4% of workers cycled to work at least 5 days a week. However, cyclists in the city are deterred from cycling by poor facilities and aggressive traffic, according to research by Cardiff University.\nAs the busiest city, Cardiff is statistically the most dangerous place to cycle in Wales. Between 1999 and 2008, 1,000 cyclists were injured on the road, 20% of all cycling accidents in Wales, although the number of injuries to cyclists continues to fall.\nThe Cardiff cycle network is over 58 miles long with an additional 3–6 miles completed each year.",
	  "section_context":"The council's Cycling Strategy was adopted in 1998. The 2007 update showed that 2.7% of people living in Cardiff cycled to work in 2001, an increase from 2.6% in 1991. However, an Omnibus survey showed that in 2003 and 2005, 3.6% and 4.3% of people cycled to work respectively. Although, the number of children cycling to school fell from 5% to 2% since 1989–91. In the strategy, the council intends to:\nencourage and promote cycling\nprovide safe facilities such as wider cycle lanes and advanced stop lines at traffic signals\nconduct a trial scheme to assess the viability of allowing cycling through pedestrian areas in the city centre\nimprove cycle links between residential and commercial areas\nfacilitate integration with other modes of transport\nimprove and maintain the cycle network\ndevelop and clearly sign routes",
	  "description_length":66,
	  "caption_length":225,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"713.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/a1\/Kolkatatemple.jpg",
	  "page_title":"Kalpataru Day",
	  "section_title":null,
	  "caption":"Dakshineswar Kali Temple",
	  "caption_attribution_description":"English: The DAKHSHINESWAR TEMPLE was founded by RANI (Queen) of Janbaazar RASHMONI in 1855 on the east bank of the Ganges river. The main temple is of NABARATNA (with 9 spires) style. It houses a KALI idol standing on the chest of a lying SHIVA. The two idols are placed on a thousand-petaled lotus made of silver. Besides the main temple, there are 12 smaller SHIVA temples &amp; a Temple dedicated to LAXMI-NARAYANA. This is a major place of pilgrimage in West Bengal, especially for the followers of SRI RAMAKRISHNA DEVA. Author: asis k. chatt https:\/\/www.Flickr.com\/photos\/indiantraveller\/507469376\/in\/set-72157600329269569 Uploaded to Wiki by en:user:nikkul",
	  "description":"photo of the Dakshineswar Kali Temple",
	  "page_context":"Kalpataru Day also called Kalpataru Diwas or Kalpataru Utsav is an annual religious festival observed by monks of the Ramakrishna Math monastic order of Hinduism and lay followers of the associated Ramakrishna Mission, as well as the worldwide Vedanta Societies. These organizations follow the teachings of Ramakrishna, the 19th century Indian mystic and figure in the Hindu Renaissance.\nThe event commemorates the day on 1 January 1886, when his followers believe that Ramakrishna revealed himself to be an Avatar, or God incarnate on earth. It is held each 1 January. Although the observances are held in many locations, the most significant celebration takes place at Cossipore Garden House or Udyanbati near Kolkata, present Ramakrishna Math, a branch of Ramakrishna Order, the place where Ramakrishna spent last days of his life. It is classified as one of the \"Lord's special festivals\" by followers of Ramakrishna.\nIn India on 1 January 2010, as in other years, \"Devotees from all over the country thronged the famed Kali Temple at Dakshineshwar for Kalpataru Utsav, which is celebrated on this day every year.\"",
	  "section_context":"Kalpataru Day also called Kalpataru Diwas or Kalpataru Utsav is an annual religious festival observed by monks of the Ramakrishna Math monastic order of Hinduism and lay followers of the associated Ramakrishna Mission, as well as the worldwide  Vedanta Societies.  These organizations follow the teachings of Ramakrishna, the 19th century Indian mystic and figure in the Hindu Renaissance.\nThe event commemorates the day on 1 January 1886, when his followers believe that Ramakrishna revealed himself to be an Avatar, or God incarnate on earth.  It is held each 1 January.  Although the observances are held in many locations, the most significant celebration takes place at Cossipore Garden House or  Udyanbati near Kolkata (then called Calcutta), present Ramakrishna Math, a branch of Ramakrishna Order, the place where Ramakrishna spent last days of his life.  It is classified as one of the \"Lord's special festivals\" by followers of Ramakrishna.\nIn India on 1 January 2010, as in other years, \"Devotees from all over the country thronged the famed Kali Temple at Dakshineshwar for Kalpataru Utsav, which is celebrated on this day every year.\" \nIndia's Eastern Railway scheduled two special trains on 1 January 2010, to carry the crowds to Kali Temple. The event includes providing medical care, blankets and clothing to the poor.",
	  "description_length":37,
	  "caption_length":24,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"959.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/25\/Boston_Red_Sox_George_W._Bush.jpg",
	  "page_title":"List of American League pennant winners",
	  "section_title":"Pennants Won by Franchise",
	  "caption":"The Boston Red Sox won an American League pennant and the World Series in 2007, three years after accomplishing the same feat in 2004.",
	  "caption_attribution_description":"The Boston Red Sox of Major League Baseball (United States) are honored by President George W. Bush following the side's winning the 2007 World Series.",
	  "description":"Several men in suits stand behind a man holding a white baseball jersey which reads \"BUSH 07\" on it.",
	  "page_context":"Each Major League Baseball season, one American League team wins the pennant, signifying that they are the league's champion and have the right to play in the World Series against the champion of the National League. The pennant was presented to the team with the best win–loss record each year through the 1968 season, after which the AL Championship Series was introduced to decide the pennant winner. The first modern World Series was played in 1903 and, after a hiatus in 1904, has taken place every season except 1994, when a players' strike forced the cancellation of the postseason. The current AL pennant holders are the Houston Astros who won in October 2019.\nIn 1969, the AL split into two divisions, and the teams with the best records in each division played one another in the five-game ALCS to determine the pennant winner, who received the William Harridge Trophy. The trophy featured a golden eagle, the league's emblem, sitting atop a silver baseball and clutching the AL banner. Since 2017, the trophy is all silver with a pennant on top. The trophy is named for Will Harridge, who was league president from 1931 to 1958.",
	  "section_context":"*Astros have won 2 AL Pennants; the other was in the NL\nNotes\nAlso known as Baltimore Orioles and New York Highlanders.  In addition to their 40 official pennants, the Yankees had the best won-loss record in the American League when the 1994 season was cut short by a labor dispute.\nAlso known as Kansas City Athletics and Philadelphia Athletics\nAlso known as Boston Americans\nAlso known as St. Louis Browns and Milwaukee Brewers. This does not refer to the New York Yankees, who were known as the Baltimore Orioles in 1901 and 1902.\nAlso known as Washington Senators from 1901 to 1960 as called the Nationals from 1905 to 1955.\nAlso known as Cleveland Naps, Cleveland Bronchos, and Cleveland Blues\nAlso known as Washington Senators from 1961 to 1971\nAlso known as Houston Colt .45's from 1962 to 1964. The Astros were members of the National League through the 2012 season after which they switched to the American League. They won the National League pennant in 2005, but this table records only the Astros' American League accomplishments.\nAlso known as Anaheim Angels, California Angels, and Los Angeles Angels\nAlso known as Tampa Bay Devil Rays\nAlso known as Seattle Pilots in 1969. The Brewers were members of the American League through the 1997 season after which they switched to the National League. This table records only the Brewers' American League accomplishments.",
	  "description_length":100,
	  "caption_length":134,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"875.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/9c\/Grimwith_by_the_ruin.jpg",
	  "page_title":"Grimwith Reservoir",
	  "section_title":null,
	  "caption":"A view of Grimwith Reservoir from the ruin on the north shore.",
	  "caption_attribution_description":"Ruin at Grimwith Reservoir.",
	  "description":"Image of a ruined building on the shoreline of a reservoir",
	  "page_context":"Grimwith Reservoir is located in the Yorkshire Dales in North Yorkshire, England. It was originally built by the Bradford Corporation as one of eleven reservoirs in the Yorkshire Dales to supply fresh water to Bradford. It is the largest reservoir owned by Yorkshire Water in terms of water storage.",
	  "section_context":"Grimwith Reservoir is located in the Yorkshire Dales in North Yorkshire, England. It was originally built by the Bradford Corporation as one of eleven reservoirs in the Yorkshire Dales to supply fresh water to Bradford. It is the largest reservoir owned by Yorkshire Water in terms of water storage.",
	  "description_length":58,
	  "caption_length":62,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"37.jpg"
	},
	{
	  "language":"en",
	  "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/3e\/7asidesoccerpitch.jpg",
	  "page_title":"Seven-a-side football",
	  "section_title":null,
	  "caption":"Seven-a-side pitch markings. Dimensions and shape of penalty area may differ for other variants.",
	  "caption_attribution_description":"diagram of 7-aside soccer pitch",
	  "description":"Diagram of seven-a-side football pitch showing pitch markings and dimensions.",
	  "page_context":"Seven-a-side football is one of the variation of association football. and a version of Minifootball which is play among seven players in each team. In the game consists of one goalkeeper and six outfield players. The pitch of seven-a-side football is bigger than the five-a-side football, ranging from 50-65 yards in length and 25-50 yards in width respectively.",
	  "section_context":"Seven-a-side football is one of the variation of  association football. and a version of Minifootball which is play among seven players in each team. In the game consists of one goalkeeper and six outfield players. The pitch of seven-a-side football is bigger than the five-a-side football, ranging from 50-65 yards in length and 25-50 yards in width respectively.",
	  "description_length":77,
	  "caption_length":96,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"484.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/d0\/Anita_Anand_and_sister_nomination_night.jpg",
	  "page_title":"Anita Anand",
	  "section_title":"Political career (2019-present)",
	  "caption":"Anita Anand pictured with her sisters on June 12, 2019 when she won the Liberal Party of Canada nomination for the riding of Oakville.",
	  "caption_attribution_description":"English: Anita Anand with her sisters on the night of her nomination victory for the Liberal Party of Canada nomination in Oakville.",
	  "description":"Anita Anand is pictured with her two sisters, all holding a sign reading \"Anita for Oakville\".",
	  "page_context":"Anita Indira Anand PC MP is the Minister of Public Services and Procurement and Member of Parliament representing the riding of Oakville in the House of Commons of Canada. She is the first Indian Canadian of a Hindu background to become a federal minister in Canada and is the first female Hindu Member of Parliament.\nAnand became the Minister of Public Services and Procurement, having been sworn in as a member of the Queen's Privy Council of Canada on November 20, 2019. On October 21, 2019, the 2019 Canadian election, Anand was elected to the House of Commons of Canada, representing the riding of Oakville as the candidate from the Liberal Party of Canada.\nPrior to her political career, Anand was a Canadian law professor at the University of Toronto, Faculty of Law specializing in corporate governance and the regulation of the capital markets. She was previously the J.R. Kimber Chair in Investor Protection and Corporate Governance at the University of Toronto, Faculty of Law. She was also Scholar-in-Residence at the law firm Torys LLP. As of October 2019, Anand is on leave from University of Toronto, Faculty of Law, for the duration of her time as an elected official.",
	  "section_context":null,
	  "description_length":94,
	  "caption_length":134,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"101.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/d9\/Nantes_SPOT_1247.jpg",
	  "page_title":"Nantes",
	  "section_title":"Location",
	  "caption":"Nantes as seen by SPOT in 2004",
	  "caption_attribution_description":"Nantes by SPOT Satellite",
	  "description":"Satellite image of Nantes",
	  "page_context":"Nantes is a city in Loire-Atlantique on the Loire, 50 km from the Atlantic coast. The city is the sixth-largest in France, with a population of 303,382 in Nantes and a metropolitan area of nearly 950,000 inhabitants. With Saint-Nazaire, a seaport on the Loire estuary, Nantes forms one of the main north-western French metropolitan agglomerations.\nIt is the administrative seat of the Loire-Atlantique department and the Pays de la Loire région, one of 18 regions of France. Nantes belongs historically and culturally to Brittany, a former duchy and province, and its omission from the modern administrative region of Brittany is controversial.\nNantes was identified during classical antiquity as a port on the Loire. It was the seat of a bishopric at the end of the Roman era before it was conquered by the Bretons in 851. Although Nantes was the primary residence of the 15th-century dukes of Brittany, Rennes became the provincial capital after the 1532 union of Brittany and France.",
	  "section_context":"Nantes is in north-western France, near the Atlantic Ocean and 342 kilometres (213 miles) south-west of Paris. Bordeaux, the other major metropolis of western France, is  274 kilometres (170 miles) south. Nantes and Bordeaux share positions at the mouth of an estuary, and Nantes is on the Loire estuary.\nThe city is at a natural crossroads between the ocean in the west, the centre of France (towards Orléans) in the east, Brittany in the north and Vendée (on the way to Bordeaux) in the south. It is an architectural junction; northern French houses with slate roofs are north of the Loire, and Mediterranean dwellings with low terracotta roofs dominate the south bank. The Loire is also the northern limit of grape culture. Land north of Nantes is dominated by bocage and dedicated to polyculture and animal husbandry, and the south is renowned for its Muscadet vineyards and market gardens. The city is near the geographical centre of the land hemisphere, identified in 1945 by Samuel Boggs as near the main railway station (around 47°13′N 1°32′W).",
	  "description_length":25,
	  "caption_length":30,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"254.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/2b\/Bridgeprep_Academy_of_Arts_and_Minds.jpg",
	  "page_title":"Bridgeprep Academy of Arts and Minds",
	  "section_title":null,
	  "caption":"BAAM Campus",
	  "caption_attribution_description":"English: BAAM Campus",
	  "description":"School Campus",
	  "page_context":"Bridgeprep Academy of Arts and Minds Charter High School is a performing and visual arts public secondary charter school in Coconut Grove, in Miami-Dade, Florida. The principal is Antonietta Michelle Digirolamo.",
	  "section_context":"Bridgeprep Academy of Arts and Minds Charter High School (BAAM) (formerly the Academy of Arts and Minds) is a performing and visual arts public secondary charter school in Coconut Grove, in Miami-Dade, Florida. The principal is Antonietta Michelle Digirolamo.",
	  "description_length":13,
	  "caption_length":11,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"562.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/eb\/STS-118_approaching_ISS.jpg",
	  "page_title":"International Space Station programme",
	  "section_title":"Visiting spacecraft",
	  "caption":"The Space Shuttle Endeavour approaching the ISS during STS-118",
	  "caption_attribution_description":"ISS015-E-21732 (10 Aug. 2007) --- This view of the Space Shuttle Endeavour, clearly shows its payload bay and upper surfaces. The image was photographed by one of the Expedition 15 crewmembers aboard the International Space Station shortly before the two vehicles docked in Earth orbit. Endeavour is contributing toward space station construction by delivering a third starboard truss segment, S5, and supplies inside the SPACEHAB module (in the center of the bay) and the external stowage platform 3.",
	  "description":"A space shuttle, with its payload bay full of equipment, seen orbiting over a cloudy sky above a mountainous region of the Earth.",
	  "page_context":"The International Space Station programme is tied together by a complex set of legal, political and financial agreements between the sixteen nations involved in the project, governing ownership of the various components, rights to crewing and utilization, and responsibilities for crew rotation and resupply of the International Space Station. It was conceived in 1984 by President Ronald Reagan, during the Space Station Freedom project as it was originally called. These agreements tie together the five space agencies and their respective International Space Station programmes and govern how they interact with each other on a daily basis to maintain station operations, from traffic control of spacecraft to and from the station, to utilization of space and crew time. In March 2010, the International Space Station Program Managers from each of the five partner agencies were presented with Aviation Week's Laureate Award in the Space category, and the ISS programme was awarded the 2009 Collier Trophy.",
	  "section_context":"Spacecraft from four different space agencies visit the ISS, serving a variety of purposes. The Automated Transfer Vehicle from the European Space Agency, the Russian Roskosmos Progress spacecraft and the H-II Transfer Vehicle from the Japan Aerospace Exploration Agency have provided resupply services to the station. In addition, Russia supplies a Soyuz spacecraft used for crew rotation and emergency evacuation, which is replaced every six months. Finally, the US serviced the ISS through its Space Shuttle program, providing resupply missions, assembly and logistics flights, and crew rotation until the program was retired in 2011.\nSpaceX was the first private company to resupply the ISS, and on May 31, 2020 it became the first company to fly humans to the ISS.\nThe availability of docking ports on the station and traffic from four different agencies and launch sites must be coordinated. Spacecraft launches can see delays while waiting for traffic to clear. A particular tight traffic jam occurred during the latch of ESA's Jules Verne Automated Transfer Vehicle in spring 2008. The cargo ship launched 2 days prior to STS-123, and had to wait in a holding orbit performing system tests while waiting for the Shuttle orbiter to clear the station.\nAs of 13 April 2016, there had been 46 Soyuz, 63 Progress, 5 ATV, 5 HTV, 5 Orbital Cygnus, 7 SpaceX Dragon and 37 Space Shuttle flights to the station. Expeditions require, on average, 2,722 kg of supplies; Soyuz crew rotation flights and Progress resupply flights visit the station on average two and three times respectively each year.",
	  "description_length":129,
	  "caption_length":62,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"757.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/4a\/Emily_McGuire_2018.3.jpg",
	  "page_title":"2018 AFL Women's Rising Star",
	  "section_title":"Nominations",
	  "caption":"Emily McGuire was Fremantle's sole nominee.",
	  "caption_attribution_description":"English: Emily McGuire in the AFL Women's preseason match between the Adelaide Football Club and Fremantle Football Club on 20 January 2018 at TIO Stadium.",
	  "description":"A female athlete with dark hair in a bun holding a football",
	  "page_context":"The AFL Women's Rising Star is an Australian rules football award given annually to the best young player in the AFL Women's for the year. Two eligible players are nominated each round of the home-and-away season; the players must have been under 21 at the beginning of the year and cannot have been previously nominated. Players suspended during the year cannot win. After the season's completion, an expert panel votes on the recipient.\nNational Australia Bank continued its sponsorship of the award in 2018, offering $20,000 in prize money. The winner was announced at the AFLW's awards ceremony on 27 March, held at Peninsula, an event space in Docklands, Melbourne, and live-streamed on AFL.com.au. The ten members of the voting panel were Australian Football League officials Nicole Livingstone, who served as the chair, Steve Hocking, Josh Vanderloo and Grant Williams; AFL Victoria's Darren Flanigan; Tim Harrington of the AFL Players Association; St Kilda's Peta Searle; and media commentators Sharelle McMahon, Kelli Underwood and Shelley Ware.\nThe winner was Chloe Molloy, a defender playing for Collingwood, who was the first recipient to poll the maximum 50 votes.",
	  "section_context":null,
	  "description_length":59,
	  "caption_length":43,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"311.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/f7\/Little_Dot_MK_III_Tube_Headphone_Amplifier_Pre-amplifier.jpg",
	  "page_title":"Bass amplifier",
	  "section_title":"Alternatives",
	  "caption":"A Little Dot Mk III tube headphone amplifier.",
	  "caption_attribution_description":"English: Little Dot MK III headphone amplifier using tubes and ALPS-16 potentiometer.",
	  "description":"A small tube headphone amplifier.",
	  "page_context":"A bass amplifier or \"bass amp\" is a musical instrument electronic device that uses electrical power to make lower-pitched instruments such as the bass guitar or double bass loud enough to be heard by the performers and audience. Bass amps typically consist of a preamplifier, tone controls, a power amplifier and one or more loudspeakers in a cabinet.\nWhile bass amps share many features with the guitar amplifiers used for electric guitar, they are distinct from other types of amplification systems, due to the particular challenges associated with low-frequency sound reproduction. This distinction affects the design of the loudspeakers, the size and design of the speaker cabinet and the design of the preamplifier and amplifier. Speaker cabinets for bass amps usually incorporate larger loudspeakers or more speakers and larger cabinet sizes than those used for the amplification of other instruments. The loudspeakers themselves must also be sturdier to handle the higher power levels and they must be capable of reproducing very low pitches at high sound pressure levels.",
	  "section_context":"Some bass players cannot use a bass combo amp, either due to strict noise and disturbance rules in their apartment, lack of space to store a combo amp (if they live in a small room) or due to the need for a set-up which can amplify multiple types of instruments and\/or voice. Alternatives to buying a bass amp for people who have noise or space constraints include a headphone amplifier or a micro-practice amp which includes a headphone jack (on bass amps, connecting headphones to a headphone jack automatically turns off the main loudspeaker). Multi-instrumentalists and bassist-singers can consider a keyboard amplifier, a small PA system, or some models of acoustic instrument amplifiers which include bass as one of the instruments which can be used; all of these options have full-range speakers that can handle the bass range.\nWhile electric bass players have used regular guitar amplifiers in large concerts since the 1960s, this is usually just for the higher register; a bass amp is still typically used for the low register, because regular guitar amps are only designed to go down to about 80 Hz. One of the reasons bassists split their signal into a bass amp and an electric guitar amp is because this arrangement enables them to overdrive the higher-register sound from the electric guitar amp, while retaining the deep bass tone from the bass amp. Naturally-produced overdrive on bass obtained by cranking a tube amplifier or solid-state preamplifier typically results in a loss of bass tone, because when pushed into overdrive, a note goes to the upper octave second harmonic.\nBass players who do not have a combo amp who are playing live shows can connect their bass to a DI unit and from there to the PA system. In a well-equipped nightclub or music bar, the audio engineer can then route the bass signal to a stage monitor suitable for bass, so the bass player and band can hear the bass tone. Some standalone bass preamplifier pedals have a DI output, so this output can similarly be connected to a PA system. Bass players who are playing in small venues (coffeehouses, small pubs, etc.) will typically need to bring their own bass combo amp (or an alternative amp, such as a keyboard amp combo), because very small venues often have a very small, low-powered PA system which is used mainly for vocals. Some small venues do not have monitor speakers, or they have only one, in front of the lead vocalist. Bass players who do not have a combo amp who are laying down tracks in the recording studio can plug into a DI unit (any professional recording studio will have one), which is connected to the audio console; the audio engineer can provide the bassist with the sound of their instrument through headphones.",
	  "description_length":33,
	  "caption_length":45,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"266.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/0d\/Desperate_Journalist_Indietracks_2015_July_25.jpg",
	  "page_title":"Desperate Journalist",
	  "section_title":null,
	  "caption":"Desperate Journalist performing at Indietracks 2015.  Rob Hardy (left), Jo Bevan (right)",
	  "caption_attribution_description":"English: Desperate Journalist at IndieTracks 2015. Rob Hardy (left) and Jo Bevan (right).",
	  "description":"Desperate Journalist performing at Indietracks 2015. Rob Hardy (left), Jo Bevan (right)",
	  "page_context":"Desperate Journalist are an English, London-based post-punk band, formed in 2012. They released their debut album, the self-titled Desperate Journalist, in 2014, on Fierce Panda Records. A second album, Grow Up, was released in March 2017. The band's third album, In Search of the Miraculous, was released in February 2019.",
	  "section_context":"Desperate Journalist are an English, London-based post-punk band, formed in 2012.  They released their debut album, the self-titled Desperate Journalist, in 2014, on Fierce Panda Records. A second album, Grow Up, was released in March 2017.  The band's third album, In Search of the Miraculous, was released in February 2019.",
	  "description_length":87,
	  "caption_length":88,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"95.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c3\/Clebsch_Cubic.png",
	  "page_title":"Mirror symmetry (string theory)",
	  "section_title":"Enumerative geometry",
	  "caption":"The Clebsch cubic",
	  "caption_attribution_description":"English: An image of the Clebsch cubic. Created using \"Surfer\"",
	  "description":"A complex mathematical surface in three dimensions.",
	  "page_context":"In algebraic geometry and theoretical physics, mirror symmetry is a relationship between geometric objects called Calabi–Yau manifolds. The term refers to a situation where two Calabi–Yau manifolds look very different geometrically but are nevertheless equivalent when employed as extra dimensions of string theory.\nMirror symmetry was originally discovered by physicists. Mathematicians became interested in this relationship around 1990 when Philip Candelas, Xenia de la Ossa, Paul Green, and Linda Parkes showed that it could be used as a tool in enumerative geometry, a branch of mathematics concerned with counting the number of solutions to geometric questions. Candelas and his collaborators showed that mirror symmetry could be used to count rational curves on a Calabi–Yau manifold, thus solving a longstanding problem. Although the original approach to mirror symmetry was based on physical ideas that were not understood in a mathematically precise way, some of its mathematical predictions have since been proven rigorously.",
	  "section_context":"Many of the important mathematical applications of mirror symmetry belong to the branch of mathematics called enumerative geometry. In enumerative geometry, one is interested in counting the number of solutions to geometric questions, typically using the techniques of algebraic geometry. One of the earliest problems of enumerative geometry was posed around the year 200 BCE by the ancient Greek mathematician Apollonius, who asked how many circles in the plane are tangent to three given circles. In general, the solution to the problem of Apollonius is that there are eight such circles.\nEnumerative problems in mathematics often concern a class of geometric objects called algebraic varieties which are defined by the vanishing of polynomials. For example, the Clebsch cubic (see the illustration) is defined using a certain polynomial of degree three in four variables. A celebrated result of nineteenth-century mathematicians Arthur Cayley and George Salmon states that there are exactly 27 straight lines that lie entirely on such a surface.\nGeneralizing this problem, one can ask how many lines can be drawn on a quintic Calabi–Yau manifold, such as the one illustrated above, which is defined by a polynomial of degree five. This problem was solved by the nineteenth-century German mathematician Hermann Schubert, who found that there are exactly 2,875 such lines. In 1986, geometer Sheldon Katz proved that the number of curves, such as circles, that are defined by polynomials of degree two and lie entirely in the quintic is 609,250.\nBy the year 1991, most of the classical problems of enumerative geometry had been solved and interest in enumerative geometry had begun to diminish. According to mathematician Mark Gross, \"As the old problems had been solved, people went back to check Schubert's numbers with modern techniques, but that was getting pretty stale.\" The field was reinvigorated in May 1991 when physicists Philip Candelas, Xenia de la Ossa, Paul Green, and Linda Parkes showed that mirror symmetry could be used to count the number of degree three curves on a quintic Calabi–Yau. Candelas and his collaborators found that these six-dimensional Calabi–Yau manifolds can contain exactly 317,206,375 curves of degree three.\nIn addition to counting degree-three curves on a quintic three-fold, Candelas and his collaborators obtained a number of more general results for counting rational curves which went far beyond the results obtained by mathematicians. Although the methods used in this work were based on physical intuition, mathematicians have gone on to prove rigorously some of the predictions of mirror symmetry. In particular, the enumerative predictions of mirror symmetry have now been rigorously proven.",
	  "description_length":51,
	  "caption_length":17,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"541.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/da\/Angelou_Obama.jpg",
	  "page_title":"List of honors received by Maya Angelou",
	  "section_title":"Honorary degrees",
	  "caption":"President Barack Obama presenting Angelou with the Presidential Medal of Freedom, 2011",
	  "caption_attribution_description":"President Barack Obama presenting Maya Angelou with the Presidential Medal of Freedom",
	  "description":"An elderly African-American woman, seated, smiling broadly, and dressed in black, being given an award by an African-American man in his fifties, wearing a blue tie and leaning over from behind her.",
	  "page_context":"African-American writer and poet Maya Angelou was honored by universities, literary organizations, government agencies, and special interest groups. Her honors include a Pulitzer Prize nomination for her book of poetry Just Give Me a Cool Drink of Water 'fore I Diiie, a Tony Award nomination for her role in the 1973 play Look Away, and five Grammys for her spoken albums. Beginning in 1982, Angelou held the first lifetime Reynolds Professorship of American Studies at Wake Forest University in Winston-Salem, North Carolina.\nShe served on two presidential committees – for Gerald Ford in 1975 and for Jimmy Carter in 1977. In 2000, she was awarded the National Medal of Arts by President Bill Clinton. In 2010, she was awarded the Presidential Medal of Freedom, the highest civilian honor in the U.S., by President Barack Obama. More than thirty health care and medical facilities have been named after Angelou. She was awarded more than 50 honorary degrees.",
	  "section_context":"Smith College, 1975\nMills College, 1975\nLawrence University, 1976\nWake Forest University, 1977\nColumbia College Chicago, 1979\nWheaton College, 1981\nBoston College, 1983\nRollins College, 1985\nHoward University, 1985\nTufts University, 1985\nMount Holyoke College, 1987\nUniversity of Southern California, 1989\nNortheastern University, 1992\nUniversity of North Carolina at Greensboro, 1993\nLafayette College, 1999\nHope College, 2001\nUniversity of Illinois at Urbana-Champaign, 2003\nEastern Connecticut State University, 2003\nChapman University, 2007\nShenandoah University, 2008\nUniversity of Redlands, 2011",
	  "description_length":198,
	  "caption_length":86,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"433.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/83\/Augustins_-_Buste_du_G%C3%A9n%C3%A9ral_d%27Hautpoul_%281838%29_par_Jean-Louis_Jaley.jpg",
	  "page_title":"Hohenlinden order of battle",
	  "section_title":"Reserve",
	  "caption":"Jean d'Hautpoul",
	  "caption_attribution_description":"Depicted person&#58; &#32;Jean-Joseph Ange d'Hautpoul&#32;– Napoleonic general",
	  "description":"Jean Joseph Ange d'Hautpoul",
	  "page_context":"In the Battle of Hohenlinden on 3 December 1800, a French army commanded by Jean Victor Marie Moreau decisively defeated the army of Habsburg Monarchy led by Archduke John. The first action of the campaign was the Battle of Ampfing, two days earlier. After Hohenlinden there was a series of rearguard clashes beginning on 9 December at Rosenheim and continuing from the 14th through the 20th at Salzburg, Neumarkt am Wallersee, Frankenmarkt, Schwanenstadt, Vöcklabruck, Lambach, and Kremsmünster. During the retreat, the Habsburg army began a process of disintegration and an armistice was concluded a few days later.",
	  "section_context":"General of Division Jean Victor Moreau\nArtillery: General of Brigade Jean Baptiste Eblé (6 guns)\nCavalry: General of Division Jean-Joseph Ange d'Hautpoul (1,738 cavalry, 6 guns)\nBrigades: Generals of Brigade Jean-Louis-Brigitte Espagne, Jean Laurent Justin La Coste Duvivier\n1st Carabinier Regiment (391)\n2nd Carabinier Regiment (397)\n8th Cavalry Regiment (325)\n9th Cavalry Regiment (328)\nVolunteer Hussars (137)\n1st company\/3rd Horse Artillery Regiment\n1st Division: General of Division Emmanuel Grouchy (8,615, 12 guns)\nBrigades: Generals of Brigade Charles Louis Grandjean, Charles Boyé\n46th Line Infantry Demi-Brigade (2,298)\n57th Line Infantry Demi-Brigade (2,353)\n108th Line Infantry Demi-Brigade (2,234)\n6th Cavalry Regiment (272)\n11th Chasseurs à Cheval Regiment (500)\n4th Hussar Regiment (627)\n1st company\/3rd Artillery Regiment\n5th company\/3rd Sapper Battalion\n2nd Division: General of Division Antoine Richepanse (10,735, 14 guns)\nBrigades: Generals of Brigade Frédéric Henri Walther, Jean-Baptiste Drouet, Jean-Baptiste Lorcet, Louis Michel Antoine Sahuc\n8th Line Infantry Demi-Brigade (2,680)\n27th Line Infantry Demi-Brigade (2,438)\n48th Line Infantry Demi-Brigade (2,192)\n1st battalion\/14th Light Infantry Demi-Brigade (849)\n10th Cavalry Regiment (300)\n1st Chasseurs à Cheval Regiment (610)\n20th Chasseurs à Cheval Regiment (698)\n5th Hussar Regiment (596)\n4th company\/3rd Horse Artillery Regiment\n6th company\/3rd Horse Artillery Regiment\n20th company\/2nd Artillery Regiment\n7th company\/4th Sapper Battalion\n3rd Division: General of Division Charles Decaen (10,161, 12 guns)\nBrigades: Generals of Brigade Jean Louis Debilly, Pierre François Joseph Durutte, Karol Kniaziewicz\n4th Line Infantry Demi-Brigade (2,000)\n100th Line Infantry Demi-Brigade (1,992)\n2nd and 3rd battalions\/14th Light Infantry Demi-Brigade (1,451)\nPolish Danube Legion (2,312)\n17th Dragoon Regiment (442)\n6th Chasseurs à Cheval (665)\n10th Chasseurs à Cheval (562)\nPolish Lancers (400)\n2nd company\/3rd Horse Artillery Regiment\n3rd company\/5th Artillery Regiment\nPolish Artillery\n1st company\/4th Sapper Battalion",
	  "description_length":27,
	  "caption_length":15,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"136.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c2\/Athens_Tetradrachm_with_multiple_test_cuts.jpg",
	  "page_title":"Coin counterfeiting",
	  "section_title":"Collectible counterfeit coins",
	  "caption":"A tetradrachm from Ancient Athens, dated circa 449-413 BC. Contains multiple 'test cuts' which were commonly made by suspicious minds in antiquity to detect forgeries by assessing whether the base metal underneath was the same (silver) or a cheaper metal (e.g. bronze). This coin has silver beneath and is not an ancient forgery.",
	  "caption_attribution_description":"English: Athens Tetradrachms with multiple test cuts",
	  "description":"Athens tetradrachm with multiple test cuts",
	  "page_context":"Coin counterfeiting of valuable antique coins is common; modern high-value coins are also counterfeited and circulated.\nCounterfeit antique coins are generally made to a very high standard so that they can deceive experts; this is not easy and many coins still stand out.",
	  "section_context":"A well known and popular numismatic item is the 1944 nickel counterfeited by Francis LeRoy Henning. Unlike official specimens, this spurious item is missing a large mintmark for the Philadelphia Mint.  Because of a different wartime composition, all nickels of this period had large mintmarks.  Normally the Philadelphia mint would not have included one, but in 1944 all of its nickels had a \"P\" above the dome of Monticello.  It is estimated that 100,000 of these coins were placed into circulation.  Today they remain readily available to collectors.\nBoth scarce 1923-D and 1930-D dimes were found in circulation, and they are of interest to collectors since no such date-mint combinations were issued for this particular denomination. It has been suggested that they may have been part of an attempt by the Soviet Union to sell its silver on the world market by counterfeiting (with full precious metal weight) U.S. coins.  If so, the engravers blundered by producing \"impossible\" coins.\nAmong the examples of counterfeits of high-value collectible coins are the \"Omega\" coins produced in the early 1970s by an unknown counterfeiter who signed his creations with a miniature Greek letter omega. He is believed to have made over 20,000 fake 1907 high-relief nominally US$20 gold Double Eagle coins with the signature omega in the claw of the eagle, worth hundreds of millions of dollars at today's prices. His counterfeits are of such high quality that collectors will pay upwards of $1,000 for one; although a genuine coin sells for about $50,000 to $100,000. The same counterfeiter also counterfeited other US gold coins, including a large quantity of $3 gold pieces, dated 1874, 1878 and 1882, with the 1882 being the most prevalent. Three of the counterfeit $10 gold pieces, the 1910-P, the 1913-P and the 1926-P, have the omega placed upside down within the upper loop of the \"R\" of \"LIBERTY\" in the Native American's headdress.",
	  "description_length":42,
	  "caption_length":329,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"834.jpg"
	},
	{
	  "language":"en",
	  "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/3e\/D70-0584-pan-voidomatis-rafting.jpg",
	  "page_title":"Vikos–Aoös National Park",
	  "section_title":"Recreation",
	  "caption":"Rafters on the bank of the Voidomatis",
	  "caption_attribution_description":"English: Rafters on the bank of the Voidomatis, Vikos-Aoos National Park, Greece, receiving instructions before embarking. Photo is a panorama of several individual photos. Some ghosting is visible.",
	  "description":"A team of rafters is standing on the bank of a river.",
	  "page_context":"The Vikos–Aoös National Park is a national park in the region of Epirus in northwestern Greece. The park, founded in 1973, is one of ten national parks in mainland Greece and is located 30 kilometres north of the city of Ioannina in the northern part of the Pindus mountain range. It is named after the two major gorges of the area and encompasses 12,600 hectares of mountainous terrain, with numerous rivers, lakes, caves, deep canyons, dense coniferous and deciduous forest. The park is part of the Natura 2000 ecological network and one of UNESCO Geoparks and spans an elevation range from 550 to 2,497 meters. Over 100,000 people visit the park each year and take part in activities including rafting, canoe-kayaking, hiking and mountain biking.\nThe core of the park, an area of 3,400 hectares, comprises the spectacular Vikos Gorge, carved by the Voidomatis river. The gorge's main part is 12 km long and attains a depth of 1,000 meters. The Aoös gorge, Mt Tymphe, and a number of traditionally preserved settlements form the park's peripheral zone.",
	  "section_context":"The Vikos–Aoös National Park is a natural tourist attraction, with high ecotourism and agrotourism potential. The local tourism industry has been favored by national and European funds and provides modest accommodation and tourism services, respectful towards the local tradition and culture. Characteristically, the Federation of Nature and National Parks of Europe (FNNPE) stated that \"the need for a sustainable form of tourism has never been greater in the area\".\nThe rivers in the Vikos–Aoös area are a destination for rafting and canoe-kayaking enthusiasts. Additional forms of adventure sports include climbing, hiking and mountain biking along local paths in order to observe the area's natural features and architecture. Popular trails in the region include the crossing of the Vikos Gorge, which lasts approximately six to seven hours and is considered of medium difficulty, as well as hiking around the peaks of Mt Tymphe. Several lookouts that offer panoramic views of the Vikos Gorge, such as the Oxya and Beloe lookouts and the 15th century Monastery of Saint Paraskevi, are accessible only by foot.",
	  "description_length":53,
	  "caption_length":37,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"573.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/34\/Tsaft.png",
	  "page_title":"Tsaft",
	  "section_title":null,
	  "caption":"Location of Tsaft in Driouch Province",
	  "caption_attribution_description":"English: Tsaft",
	  "description":"Tsaft",
	  "page_context":"Tsaft is a commune in Driouch Province of the Oriental administrative region of Morocco. At the time of the 2004 census, the commune had a total population of 10,284 people living in 1786 households.",
	  "section_context":"Tsaft (Amazigh:ⵜⵙⴰⴼⵜ, Arabic: تسافت) is a commune in Driouch Province of the Oriental administrative region of Morocco. At the time of the 2004 census, the commune had a total population of 10,284 people living in 1786 households.",
	  "description_length":5,
	  "caption_length":37,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"852.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/f2\/Cruijff_met_de_beker_van_de_derde_prijs%2C_Bestanddeelnr_928-0928.jpg",
	  "page_title":"Amsterdam Tournament",
	  "section_title":"Tournaments",
	  "caption":"Johan Cruyff scored once in the 1975 tournament for Barcelona.[14]",
	  "caption_attribution_description":"Nederlands: Collectie \/ Archief&#160;: Fotocollectie Anefo Reportage \/ Serie&#160;: Voetbaltoernooi Amsterdam-700 Beschrijving&#160;: Cruijff met de beker van de derde prijs Datum&#160;: 10 augustus 1975 Locatie&#160;: Amsterdam, Noord-Holland Trefwoorden&#160;: prijsuitreikingen, toernooien, voetbal Persoonsnaam&#160;: Cruijff, Johan Instellingsnaam&#160;: AJAX Fotograaf&#160;: Fotograaf Onbekend \/ Anefo Auteursrechthebbende&#160;: Nationaal Archief Materiaalsoort&#160;: Negatief (zwart\/wit) Nummer archiefinventaris&#160;: bekijk toegang 2.24.01.05 Bestanddeelnummer&#160;: 928-0928",
	  "description":"A man wearing a white shirt.",
	  "page_context":"The Amsterdam Tournament was a pre-season association football competition, held in Amsterdam, Netherlands. The competition was hosted by Eredivisie club Ajax at the Amsterdam Arena. It was inaugurated in 1975 as the Amsterdam 700 Tournament to celebrate 700 years of history in the city. It was held annually each summer until 1992, when the last edition of the original tournament was played. It returned in 1999 with the backing of the International Event Partnership. Four teams participate in the competition, played in a league format since 1986.\nSince its return, the tournament has used an unusual point scoring system. As with most league competitions, three points are awarded for a win, one for a draw and zero for a loss. An additional point, however, is awarded for each goal scored. The system is designed to reward teams that adopt a more attacking style of play. Each entrant plays two matches, with the winner being the club that finishes at the top of the table. The original competition was held at De Meer, Ajax's home between 1934 and 1996. The Amsterdam Arena, now named the Johan Cruyff Arena, has played host to the event since the return until 2009.",
	  "section_context":null,
	  "description_length":28,
	  "caption_length":66,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"833.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/92\/Infrared_Thermography_of_Modified_Bitumen_Roof.jpg",
	  "page_title":"Roof coating",
	  "section_title":"Benefits",
	  "caption":"A 35 °C (95 °F) heat reduction was observed on this modified bitumen roof with a white, reflective roof coating.",
	  "caption_attribution_description":"English: Infrared image clearly shows the heat reflective properties of elastomeric roof coatings. Almost 100 degrees F heat reduction at the roof surface. Picture was taken March in Atlanta.",
	  "description":"Infrared image shows excellent heat reflective properties of elastomeric roof coatings.",
	  "page_context":"A roof coating is a monolithic, fully adhered, fluid applied roofing membrane. Many roof coatings are elastomeric, that is, they have elastic properties that allow them to stretch and return to their original shape without damage.\nTypical roof coating dry film thickness vary from paint film thickness",
	  "section_context":"Roof coatings are seamless and when installed correctly, can solve roof leaks on almost any type of roofing material.\nThere are exceptions: \"professionals do not recommend using cool coatings over existing shingles. This technique can cause moisture problems and water damage because the coating can inhibit normal shingle drying after rain or dew accumulation, allowing water to condense and collect under the shingles.\"\nField-applied reflective roof coatings can extend the useful life of nearly every roof substrate keeping a roof surface cool and providing a level of protection from the sun and weather. \nHowever, coating asphalt shingles and built-up composition roofs requires more caution. The National Roofing Contractors Association’s (NRCA) director of technical services has stated \"The roofing industry is aware of a number of issues that could have negative consequences for field application of coatings over asphalt shingle roof systems. Anyone considering this type of application should be aware of the concerns so they can weigh them against the benefits claimed in coating product promotional materials.\"\nRoof coatings can add 25 years to the service life of a roof and reduce the amount of discarded roofing materials that end up in landfills.  The infrared image on the right shows 79 °C (174 °F) on the uncoated (black) section of the modified bitumen roof. The coated (white) section is 26 °C (79 °F). Field studies have shown that cool roof coatings can lower rooftop temperatures and reduce air conditioning bills.",
	  "description_length":87,
	  "caption_length":112,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"85.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/9b\/Chris_Stapleton_May_23%2C_2017.jpg",
	  "page_title":"List of Top Country Albums number ones of 2016",
	  "section_title":"Chart history",
	  "caption":"Chris Stapleton spent the most weeks at number one in 2016.",
	  "caption_attribution_description":"English: American singer-songwriter and guitarist Chris Stapleton at Red Rocks Amphitheatre on May 23, 2017, in Morrison, Colorado, United States",
	  "description":"Singer Chris Stapleton",
	  "page_context":"Top Country Albums is a chart that ranks the top-performing country music albums in the United States, published by Billboard. In 2016, 22 different albums topped the chart; placings were based on electronic point of sale data from retail outlets.\nIn the issue of Billboard dated January 2, Chris Stapleton was at number one with the box set Traveller, its fifth week in the top spot. The album held the top spot for the first nine weeks of 2016 and made intermittent returns to the top spot for the remainder of the year, spending a total of 20 weeks atop the chart during the twelve months. No other act spent more than four weeks at number one in 2016. Traveller's first run of the year in the top spot was ended by Joey + Rory's first chart-topping album Hymns That Are Important to Us, which reached number one in the issue of Billboard dated March 5; Joey Feek, the female half of the husband-and-wife duo, died on March 4 at the age of 40.\nSeveral other acts topped the chart for the first time in 2016, beginning with Sturgill Simpson, who spent a single week at number one in May with A Sailor's Guide to Earth, which would go on to win the award for Best Country Album.",
	  "section_context":null,
	  "description_length":22,
	  "caption_length":59,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"502.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/20\/Rabbi_Harry_Ettelson.jpg",
	  "page_title":"Temple Israel (Memphis, Tennessee)",
	  "section_title":"Ettelson era (1925–1954)",
	  "caption":"Rabbi Harry Ettelson",
	  "caption_attribution_description":"English: Rabbi Harry Ettelson of Temple Israel (Memphis, Tennessee)",
	  "description":"The head of a clean-shaven man wearing round wire-rimmed glasses and a white shirt and dark tie, covered by a dark robe",
	  "page_context":"Temple Israel is a Reform Jewish congregation in Memphis, Tennessee, in the United States. It is the only Reform synagogue in Memphis, the oldest and largest Jewish congregation in Tennessee, and one of the largest Reform congregations in the U.S. It was founded in 1853 by mostly German Jews as Congregation B'nai Israel. Led initially by cantors, in 1858 it hired its first rabbi, Jacob Peres, and leased its first building, which it renovated and eventually purchased.\nPeres was fired in 1860 because he opened a store that conducted business on Saturdays, the Jewish Sabbath. He was replaced by Simon Tuska, who moved the congregation from Orthodox to Reform practices. Tuska died in 1871, and was succeeded by Max Samfield; under his leadership, the synagogue was one of the founding members of the Union for Reform Judaism. In 1884, Children of Israel completed a new building, and membership grew rapidly. Samfield died in 1915, and was succeeded by Bill Fineshriber, an outspoken supporter of women's suffrage and equal rights for African Americans. The following year the congregation moved to a new building, where membership continued to grow.",
	  "section_context":"Harry William Ettelson succeeded Fineshriber in 1925, the first Southerner to lead the congregation. Born in 1883, he was raised in Mobile, Alabama. He had a B.A. from the University of Cincinnati (graduating in 1900 when he was seventeen), an M.A. from the University of Chicago, and a Ph.D. from Yale University. Ordained at HUC in 1904, he first served Congregation Achduth Vesholom in Fort Wayne, Indiana, from 1904 to 1910, then Congregation Beth Israel of Hartford, Connecticut, from 1911 to 1919. From 1919 to 1925 he was associate rabbi, then head rabbi at Congregation Rodeph Shalom in Philadelphia.\nEttelson was a strong supporter of the Pittsburgh Platform and its principles, which became the basis for what was later known as \"classical\" Reform Judaism. The services he led reflected that: member participation in the services (which were mostly in English) was limited. While at Achduth Vesholom he moved services from Saturday to Sunday for a period, in an attempt to improve attendance. Even before his joining Children of Israel, the congregation had already substantially reformed its services; it no longer held bar mitzvahs, observed the laws of kashrut, or allowed congregants to participate in the Torah reading. Aside from the Shema Yisrael and Kaddish, Hebrew or Aramaic prayers had been almost totally eliminated. Though he made few ritual changes himself, Ettelson continued this tradition, and emphasized community service over ritual practice, promoting Judaism as a universalist religion with a mission of justice and peace. The year he arrived he organized the Cross Cut Club, an inter-faith group intended to counter religious prejudice. He served as its first president, and was its president again in 1950. One of his initiatives there was the Union Civic Thanksgiving Service, an interdenominational eve-of-Thanksgiving service that was held for a number of years. In the 1930s it held an integrated meeting, and, as a result, was not invited back to the venue the following year.\nWhen Ettelson joined the congregation, it had 650 member families. To accommodate growth, in 1926 the synagogue built an annex for the children's religious school. That year the congregation also established the \"Temple Men's Club\", which had over 200 members, and joined the National Federation of Temple Brotherhoods. In 1928, the congregation purchased an adjoining house south of the synagogue, for Junior Congregation meetings, and began broadcasting its Friday evening services on the radio. The costs for both endeavors were donated anonymously by synagogue member Abe Plough, founder and chairman of Schering-Plough. The synagogue was hard-hit by the Great Depression. Income from dues dropped from $47,000 in 1928 (today $700,000) to $23,000 in 1932, and membership fell from 750 families in 1929 to as low as 629 families. The Talmud Torah was closed due to lack of funds, and board meetings focused on finding ways to keep the congregation going financially. Ettelson requested a pay reduction of $1,000 (today $17,000) in 1931, and a further 10 percent cut in 1933, and the salaries of other synagogue employees were also cut. The Junior Congregation did well, though; it had 189 paid members by 1933, held Saturday morning and High Holy Days services, and conducted a number of other programs. The congregation eventually recovered as a whole, assisted by members who were leaders in the civic and business worlds. By 1936, membership had increased to 650, and the synagogue paid off the remaining mortgage on the Poplar and Montgomery synagogue building.\nIn 1932, Ettelson became locally famous for a debate he had at Nashville's Ellis Auditorium with Scopes Trial lawyer Clarence Darrow on whether or not religion was necessary. Ettelson argued in favor, Darrow against. Friction between Ettelson and some board members came to a head in 1937, when the board discussed the issue of whether to retain him as rabbi; when invited to the meeting, he spoke briefly, then resigned. The board recommended that his tenure be put to a congregational vote at the next annual m",
	  "description_length":119,
	  "caption_length":20,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"810.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/bc\/Chinook_june1.jpg",
	  "page_title":"Washington State Route 410",
	  "section_title":"Route description",
	  "caption":"SR 410 traveling near Chinook Pass, the Pierce–Yakima county line, seen in June.",
	  "caption_attribution_description":"English: Washington State Route 410 approaching Chinook Pass on a typical June day. Photo taken just south of Lake Tipsoo about 1\/2 mile from summit.",
	  "description":"SR 410, east of Tipsoo Lake, approaches Chinook Pass, which serves as the border between Pierce and Yakima counties and between the Mount Rainier National Park and Wenatchee National Forest, in June when snow levels are still high and snow plows still are in use.",
	  "page_context":"State Route 410 is a 107.44-mile long state highway that traverses Pierce, King, and Yakima counties in the US state of Washington. It begins at an interchange with SR 167 in Sumner and travels southeast across the Cascade Range to a junction with U.S. Route 12 in Naches. While the western part of SR 410 is a freeway that serves built-up, urban areas, the remainder of the route is a surface road that traverses mostly rural areas as it passes through the mountains.\nThe route starts as a limited-access southerly bypass of Downtown Sumner, but becomes a surface road east of the city. Traveling eastward, the roadway serves Bonney Lake and Buckley, and crosses and eventually parallels the White River into Enumclaw and Greenwater. SR 410 enters the Mount Baker-Snoqualmie National Forest and later heads into Mount Rainier National Park, crossing the Cayuse and Chinook passes, and leaves the park southeast along the American River into Wenatchee National Forest. SR 410 leaves the national forest and travels parallel to the Naches River to end in Naches, a city located west of Yakima.",
	  "section_context":"SR 410 begins as a freeway at an interchange with SR 167 near Downtown Sumner. The highway travels southeast across suburban areas, crossing the Stuck River and passing a partial cloverleaf interchange with Linden Drive, also named Traffic Avenue. After a second partial cloverleaf interchange with Thompson Avenue, SR 410 goes under a railroad trestle owned by BNSF Railway and used by Amtrak's Cascades rail service, near the northern bank of the Puyallup River. After turning northeast, SR 410 encounters the western terminus of SR 162 by way of a diamond interchange. SR 162 travels north into Downtown Sumner as Valley Avenue and south over the Puyallup River towards Orting. The freeway section near the interchange was the busiest recorded part of SR 410 in 2008 with a daily average of 59,000 motorists using the freeway. Continuing northeast, SR 410 connects to 166th Avenue and turns southeast as an undivided highway into the community of Bonney Lake. East of Bonney Lake, the roadway heads east, passing two shopping centers before entering Buckley and intersecting SR 165. In Buckley, the street travels northeast through Downtown and turns north to cross the White River and enter King County.\nAfter leaving Pierce County, the highway travels northeast through rural areas into Enumclaw and passes Enumclaw High School before turning east and being renamed Roosevelt Avenue. As Roosevelt Avenue, the street intersects Griffin Avenue, also designated SR 164, which travels northwest to SR 169 and Auburn. The roadway, now named the Chinook Scenic Byway, passes by the King County Fairgrounds and Enumclaw King County Park. Leaving Enumclaw in a southeastern direction, SR 410 begins to parallel the White River upriver into Federation Forest State Park, a 619-acre (2.51 km²; 0.967 sq mi) state park consisting of old growth evergreen forests. The highway crosses the Greenwater River, northeast of its confluence with the White River, and re-enters Pierce County.\nThe bridge ends in the community of Greenwater, named for the river, where the roadway encounters Forest Road 70, which has been proposed to become SR 168 over Naches Pass as an alternative to the Chinook Scenic Byway. From Greenwater, the road travels south alongside the White River into Mount Baker-Snoqualmie National Forest, passing Ranger Creek State Airport, a state-owned airport that is open in the summer and early fall. The byway travels south into Mount Rainier National Park. SR 410 is closed at the gate to Morse Creek, about 5 miles east of the Chinook Pass Summit during the winter and early spring due to high wind, limited cell service and avalanche danger. It intersects SR 123 at Cayuse Pass. SR 410 turns east at the intersection and heads through a series of hairpin turns, passing Tipsoo Lake, to Chinook Pass.\nChinook Pass is the border between Pierce and Yakima counties and Mount Rainier National Park and the Wenatchee National Forest. The pass is also where the highway crosses the Pacific Crest Trail, a National Scenic Trail that was completed in 1993. East of Chinook Pass, the roadway begins to parallel the American River northeast to follow the Little Naches River, which becomes the Naches River. After a junction with the other end of the proposed SR 168, named Little Naches Road, the highway exits the Wenatchee National Forest and enters Naches. The byway ends at US 12 in Naches near the Naches Selah Canal.",
	  "description_length":263,
	  "caption_length":80,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"61.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/4e\/Relief_Map_of_Krasnodarski_Krai.png",
	  "page_title":"Ubykh people",
	  "section_title":"History",
	  "caption":"Approximate location of Circassian tribes, Tsutsiev's Atlas",
	  "caption_attribution_description":"Русский: Физическая карта Краснодарского края, Россия. Координаты для GMT: -R36\/42\/43\/47 Инструменты: GMT, Inkscape This map was created from OpenStreetMap project data, collected by the community. This map may be incomplete, and may contain errors. Don't rely solely on it for navigation.",
	  "description":"Ubykh people is located in Krasnodar Krai",
	  "page_context":"The Ubykh are one of the twelve Circassian tribes, representing one of the twelve stars on the green-and-gold Circassian flag. Along with the Natukhai and Shapsug tribes, the Ubykh were one of three coastal Circassian tribes to form the Circassian Assembly in 1860. Historically, they spoke a distinct Ubykh language, which never existed in written form and went extinct in 1992 when Tevfik Esenç, the last speaker, died.",
	  "section_context":"The Ubykh used to inhabit the capital of Circassia, Sache (Circassian: Шъачэ, lit. seaside) — present-day Sochi, Krasnodar Krai, Russia. The province of the Ubykh tribe was situated between the Shapsug tribe near Tuapse and the Sadz (Dzhigets) in the north of Gagra. The Ubykh tribe were mentioned in book IV of Procopius' De Bello Gothico (The Gothic War), under the name βροῦχοι (Bruchi), a corruption of the native term tʷaχ. In the 1667 book of Evliya Çelebi, the Ubykh were mentioned as Ubúr without any other information.\nThe Ubykh were semi-nomadic horsemen, and had a finely-differentiated vocabulary related to horses and tack. Some Ubykh also practised favomancy and scapulimancy. However, the Ubykh gained more prominence in modern times. By 1864, during the reign of Tsar Alexander II, the Russian conquest of the Northwestern Caucasus had  been completed. The other Circassian tribes and the Abkhaz were decimated, and the Abaza were partially driven out of the Caucasus.\nFaced with the threat of subjugation by the Russian army, the Ubykh, as well as other Muslim peoples of Caucasus, left their homeland en masse beginning on 6 March 1864. By May 21, the entire Ubykh nation had departed from the Caucasus. They eventually settled in a number of villages in western Turkey around the municipality of Manyas.\nIn order to avoid discrimination, the Ubykh elders encouraged their people to assimilate into Turkish culture. Having abandoned their traditional nomadic culture, they became a nation of farmers. The Ubykh language was rapidly displaced by Turkish and other Circassian dialects; the last native speaker of Ubykh, Tevfik Esenç, died in 1992.\nToday, the Ubykh diaspora has been scattered about Turkey and—to a much lesser extent—Jordan. The Ubykh nation per se no longer exists, although those who are of Ubykh ancestry are proud to call themselves Ubykh, and a couple of villages are still found in Turkey where the vast majority of the population is Ubykh by descent.\nUbykh society was patrilineal; many Ubykh descendants today know five, six, or even seven generations of their agnatic ancestry. Nevertheless, as in other Northwest Caucasian tribes, women were especially venerated, and the Ubykh retained a special second person pronoun prefix used exclusively with women (χa-).",
	  "description_length":41,
	  "caption_length":59,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"359.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/66\/Kendall-Jackson_May_Farm-To-Table_Dinner_-_Stierch_08.jpg",
	  "page_title":"Farm-to-table",
	  "section_title":null,
	  "caption":"A \"farm-to-table\" dinner at Kendall-Jackson used produce from the winery's on-site garden.",
	  "caption_attribution_description":"English: Al fresco dining at the Farm-to-Table Dinner at Kendall-Jackson Wine Estate &amp; Garden",
	  "description":"Planted rows with canopied tables behind",
	  "page_context":"Farm-to-table is a social movement which promotes serving local food at restaurants and school cafeterias, preferably through direct acquisition from the producer. This might be accomplished by a direct sales relationship, a community-supported agriculture arrangement, a farmer's market, a local distributor or by the restaurant or school raising its own food. Farm-to-table often incorporates a form of food traceability where the origin of the food is identified to consumers. Often restaurants cannot source all the food they need for dishes locally, so only some dishes or only some ingredients are labelled as local.\nThe farm-to-table movement has arisen more or less concurrently with changes in attitudes about food safety, food freshness, food seasonality, and small-farm economics.",
	  "section_context":"Farm-to-table (or farm-to-fork, and in some cases farm-to-school) is a social movement which promotes serving local food at restaurants and school cafeterias, preferably through direct acquisition from the producer (which might be a winery, brewery, ranch, fishery, or other type of food producer which is not strictly a \"farm\").  This might be accomplished by a direct sales relationship, a community-supported agriculture arrangement, a farmer's market, a local distributor or by the restaurant or school raising its own food.  Farm-to-table often incorporates a form of food traceability (celebrated as \"knowing where your food comes from\") where the origin of the food is identified to consumers.  Often restaurants cannot source all the food they need for dishes locally, so only some dishes or only some ingredients are labelled as local.\nThe farm-to-table movement has arisen more or less concurrently with changes in attitudes about food safety, food freshness, food seasonality, and small-farm economics. Advocates and practitioners of the farm-to-table model frequently cite the scarcity of fresh, local ingredients; the poor flavor of ingredients shipped from afar; the poor nutritional integrity of shipped ingredients; the disappearance of small family farms; the disappearance of heirloom and open-pollinated fruits and vegetables; and the dangers of a highly centralized food growing and distribution system as motivators for their decision to adopted a more locavore approach to the food system.",
	  "description_length":40,
	  "caption_length":90,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"372.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/9a\/Diamond_Peak_from_Willamette_Pass.jpg",
	  "page_title":"Diamond Peak (Oregon)",
	  "section_title":"Geography",
	  "caption":"Diamond Peak as seen from Willamette Pass ski area",
	  "caption_attribution_description":"English: Diamond Peak as seen from Willamette Pass Resort in Oregon",
	  "description":"A mountain with steep slopes covered in snow rises above dense forest.",
	  "page_context":"Diamond Peak is a volcano in Klamath and Lane counties of central Oregon in the United States. It is a shield volcano, though it might also be considered a modest stratocone. Diamond Peak forms part of the Cascade Volcanic Arc, a segment of the Cascade Range in western North America extending from southern British Columbia through Oregon to Northern California. Reaching an elevation of 8,748 feet, the mountain is located near Willamette Pass in the Diamond Peak Wilderness within the Deschutes and Willamette national forests. Surrounded by coniferous forest and visible in the skyline from foothills near Eugene, Diamond Peak offers a few climbing routes and can be scrambled.\nThe volcano, consisting mostly of basaltic andesite, has relatively steep slopes and an andesitic volcanic cone that contains pyroclastic materials at its core. The mountain has a number of subfeatures including Mount Yoran, Lakeview Mountain, and a number of cinder cones. Diamond Peak was thoroughly eroded by glaciers and has several cirques as a result.",
	  "section_context":"Located 20 miles (32 km) north of Mount Bailey and Diamond Lake in the U.S. state of Oregon, the Diamond Peak volcano represents the predominant feature of the Willamette Pass locality on the border of Klamath and Lane counties, reaching an elevation of 8,748 feet (2,666 m), and can be seen from many summits in western Oregon.",
	  "description_length":70,
	  "caption_length":50,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"560.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/1\/1b\/Kelly%27s_pic_of_RS_jacket_t_shirt_2.jpg",
	  "page_title":"Richard Strange",
	  "section_title":null,
	  "caption":"Richard Strange photographed by Kelly Dearsley",
	  "caption_attribution_description":"English: Photograph of Richard Strange",
	  "description":"Portrait photograph of Richard Strange",
	  "page_context":"Richard \"Kid\" Strange is an English writer, actor, musician, curator, teacher, adventurer and the founder and front man of seminal mid-1970s protopunk art rock band Doctors of Madness.",
	  "section_context":"Richard \"Kid\" Strange (born January 1951) is an English writer, actor, musician, curator, teacher, adventurer and the founder and front man of seminal mid-1970s protopunk art rock band Doctors of Madness.",
	  "description_length":38,
	  "caption_length":46,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"518.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/23\/Vimy_Memorial_-_half_finished_statue_and_plaster_models.jpg",
	  "page_title":"Canadian National Vimy Memorial",
	  "section_title":"Memorial construction",
	  "caption":"Statue carving in progress",
	  "caption_attribution_description":"English: The half finished statue of the Female Mourner beside a scaled plaster model that had been created by Allward in his studio.",
	  "description":"The partially completed statue of a reclined woman sits to the right of a half sized model of the same statue. It appears the work is being conducted inside a temporary structure.",
	  "page_context":"The Canadian National Vimy Memorial is a war memorial site in France dedicated to the memory of Canadian Expeditionary Force members killed during the First World War. It also serves as the place of commemoration for Canadian soldiers of the First World War killed or presumed dead in France who have no known grave. The monument is the centrepiece of a 100-hectare preserved battlefield park that encompasses a portion of the ground over which the Canadian Corps made their assault during the initial Battle of Vimy Ridge offensive of the Battle of Arras.\nThe Battle of Vimy Ridge was the first time all four divisions of the Canadian Expeditionary Force participated in a battle as a cohesive formation, and it became a Canadian national symbol of achievement and sacrifice. France ceded to Canada perpetual use of a portion of land on Vimy Ridge on the understanding that Canada use the land to establish a battlefield park and memorial. Wartime tunnels, trenches, craters, and unexploded munitions still honeycomb the grounds of the site, which remains largely closed off for reasons of public safety.",
	  "section_context":"Following the competition, Allward spent the remainder of 1921 and the spring of 1922 preparing for his move to Europe. After selling his home and studio, Allward finally departed for Belgium on 6 June 1922 and spent several months seeking a suitable studio in Belgium and then Paris, though he eventually set up a studio in London.\nAllward had initially hoped to use white marble for the memorial's facing stone, but Percy Nobbs suggested this would be a mistake because marble was unlikely to weather well in northern France and the memorial would have a \"ghost like\" appearance. Allward undertook a tour of almost two years to find stone of the right colour, texture, and luminosity. He found it in the ruins of Diocletian's Palace at Split, Croatia; he observed that the palace had not weathered over the years, which Allward took as evidence of the stone's durability. His choice—Seget limestone—came from an ancient Roman quarry located near Seget, Croatia. The difficulties with the quarrying process, coupled with complicated transportation logistics, delayed delivery of the limestone and thus construction of the memorial. The first shipment did not arrive at the site until 1927, and the larger blocks, intended for the human figures, did not begin to arrive until 1931.\nOn Allward's urging the Canadian Battlefields Memorials Commission hired Oscar Faber, a Danish structural engineer, in 1924 to prepare foundation plans and provide general supervision of the foundation work. Faber had recently designed the substructure for the Menin Gate at Ypres, and he selected a design that employed cast-in-place reinforced concrete to which the facing stone would be bonded. Major Unwin Simson served as the principal Canadian engineer during the construction of the memorial and oversaw much of the daily operations at the site. Allward moved to Paris in 1925 to supervise construction and the carving of the sculptures. Construction commenced in 1925 and took eleven years to complete. The Imperial War Graves Commission concurrently employed French and British veterans to carry out the necessary roadwork and site landscaping.\nWhile awaiting the first delivery of stone, Simson noticed that the battlefield landscape features were beginning to deteriorate. Seeing an opportunity to not only preserve a portion of the battlefield but also keep his staff occupied, Simson decided to preserve a short section of trench line and make the Grange Subway more accessible. Labourers rebuilt and preserved sections of sandbagged trench wall, on both the Canadian and German sides of the Grange crater group, in concrete. The workforce also built a new concrete entrance for the Grange Subway and, after excavating a portion of the tunnel system, installed electric lighting.\nAllward chose a relatively new construction method for the monument: limestone bonded to a cast concrete frame. A foundation bed of 11,000 tonnes of concrete, reinforced with hundreds of tonnes of steel, served as the support bed for the memorial. The memorial base and twin pylons contained almost 6,000 tonnes of Seget limestone. Sculptors carved the 20 approximately double life-sized human figures on site from large blocks of stone. The carvers used half-size plaster models produced by Allward in his studio, now on display at the Canadian War Museum, and an instrument called a pantograph to reproduce the figures at the proper scale. The carvers conducted their work year-round inside temporary studios built around each figure. The inclusion of the names of those killed in France with no known grave was not part of the original design, and Allward was unhappy when the government asked him to include them. Allward argued that the inclusion of names was not part of the original commissioning. Through a letter to Canadian Battlefields Memorials Commission in October 1927, Allward indicated his intention to relegate the names of the missing to pavement stones around the monument. The collective dismay and uproar of the commission forced Allward to relent and incorporate the names of the missing on the mem",
	  "description_length":179,
	  "caption_length":26,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"76.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/d4\/Katie_Boyle.jpg",
	  "page_title":"Katie Boyle",
	  "section_title":null,
	  "caption":"Boyle appearing on After Dark, July 1988",
	  "caption_attribution_description":"English: The Channel 4 television programme After Dark on 2 July 1988. Discussing \"Animal Rights\" with that week's host Beverly Anderson (centre) were Katie Boyle, Rex Hudson, Ralph Cook, Miriam Rothschild, Mark Gold, Judy MacArthur and Frank Evans. Katie Boyle brought her dogs.",
	  "description":"Katie Boyle",
	  "page_context":"Caterina Irene Elena Maria Boyle, Lady Saunders, usually known as Katie Boyle, was a British actress, writer, radio announcer, television personality, game-show panellist and animal rights activist. She became best known for presenting the Eurovision Song Contest on four occasions, in 1960, 1963, 1968 and 1974; the first three in London and the last in Brighton, England. She was once an agony aunt, answering problems that had been posted by readers of the TVTimes.",
	  "section_context":"Caterina Irene Elena Maria Boyle, Lady Saunders (née Imperiali dei Principi di Francavilla; 29 May 1926 – 20 March 2018), usually known as Katie Boyle, was a British actress, writer, radio announcer, television personality, game-show panellist and animal rights activist. She became best known for presenting the Eurovision Song Contest on four occasions, in 1960, 1963, 1968 and 1974; the first three in London and the last in Brighton, England. She was once an agony aunt, answering problems that had been posted by readers of the TVTimes.",
	  "description_length":11,
	  "caption_length":40,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"512.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8c\/Orlai-salamon.jpg",
	  "page_title":"Solomon, King of Hungary",
	  "section_title":"Abdication",
	  "caption":"King Solomon is cursed by his mother, a picture by Soma Orlai Petrich",
	  "caption_attribution_description":null,
	  "description":"Solomon and his mother",
	  "page_context":"Solomon, also Salomon was King of Hungary from 1063. Being the elder son of Andrew I, he was crowned king in his father's lifetime in 1057 or 1058. However, he was forced to flee from Hungary after his uncle, Béla I, dethroned Andrew in 1060. Assisted by German troops, Solomon returned and was again crowned king in 1063. On this occasion he married Judith, sister of Henry IV, Holy Roman Emperor. In the following year he reached an agreement with his cousins, the three sons of Béla I. Géza, Ladislaus and Lampert acknowledged Solomon's rule, but in exchange received one-third of the kingdom as a separate duchy.\nIn the following years, Solomon and his cousins jointly fought against the Czechs, the Cumans and other enemies of the kingdom. Their relationship deteriorated in the early 1070s and Géza rebelled against him. Solomon could only maintain his rule in a small zone along the western frontiers of Hungary after his defeat in the Battle of Mogyoród on 14 March 1074. He officially abdicated in 1081, but was arrested for conspiring against Géza's brother and successor, Ladislaus.\nSolomon was set free during the canonization process of the first king of Hungary, Stephen I, in 1083.",
	  "section_context":"After the battle of Mogyoród, Duke Géza's soldiers pursued Solomon and his men \"from dawn to dusk\", but they managed to take refugee in Moson, where his mother and wife had been staying. According to the Illuminated Chronicle, the queen mother blamed her son for the defeat, which filled Solomon with so much anger that he wanted to \"strike his mother in the face\". His wife held him back by catching his hand.\nThereafter, Solomon preserved only Moson and the nearby Pressburg (Bratislava, Slovakia). Other parts of the kingdom accepted the rule of Géza, who had been proclaimed king after his victory.\nSolomon sent his envoys to Henry IV and promised \"six of the strongest fortified cities in Hungary\" if his brother-in-law would help him to depose Géza. He was even ready to accept the German monarch's suzerainty.\nHenry IV invaded Hungary in August. He marched as far as Vác, but soon withdrew from Hungary without defeating Géza. Nevertheless, the German invasion strengthened Solomon's rule in the region of his two fortresses, where he continued to exercise all royal prerogatives, including coinage. His mother and wife left him and followed Henry IV to Germany. According to Berthold of Reichenau's Chronicle:\nThat summer [Henry IV] undertook an expedition into Hungary to help King Salomon, who also because of his insolent and shameful crimes had been deposed from his office by his father's brother (sic) and the other magnates of the kingdom, for whose counsels he cared little. [Henry IV], however, was able to achieve nothing of what he wished there, namely to restore Salomon. Finally, bringing back his sister, Queen Judith, the wife of Salomon, he returned home to Worms\nSolomon attempted to convince Pope Gregory VII to support him against Géza. However, the pope condemned him for having accepted his kingdom \"as a fief from the king of the Germans\" and claimed suzerainty over Hungary. Thereafter it was Henry IV's support which enabled Solomon to resist Géza's all attempts at taking Moson and Pressburg. The German monarch even sent one of his main opponents, Bishop Burchard II of Halberstadt, into exile to Solomon in June 1076. Solomon's wife, Queen Judith, who was about to return to her husband, undertook to take the imprisoned bishop to Hungary, but the prelate managed to escape.\nGéza decided to start new negotiations with Solomon. However, he died on 25 April 1077 and his partisans proclaimed his brother, Ladislaus, king. The new king occupied Moson in 1079, thus Solomon could preserve only Pressburg. In 1080 or 1081, the two cousins concluded a treaty, according to which Solomon acknowledged Ladislaus as king in exchange for \"revenues sufficient to bear the expenses of a king\".",
	  "description_length":22,
	  "caption_length":69,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"738.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/92\/Stapleton_International_Airport_1.jpg",
	  "page_title":"Interstate 270 (Colorado)",
	  "section_title":"Route description",
	  "caption":"Former site of Stapleton International Airport, located east of I-270. I-270's interchange with I-70 can be seen in the far left",
	  "caption_attribution_description":"The former Stapleton International Airport.",
	  "description":"An aerial photograph",
	  "page_context":"Interstate 270 is a 7-mile-long highway in the northeastern part of the Denver–Aurora Metropolitan Area in the U.S. state of Colorado. It overlaps U.S. Highway 36 for its entire length. The western terminus of I-270 is at the interchange with I-25 and US 36. It heads eastward to an interchange with I-76, where the mileposts reset because of a previous freeway extension. The freeway heads southeast and comes to meet Vasquez Boulevard, where it enters Commerce City. The road crosses Quebec Street before ending at I-70.\nGround was broken on the first segment of I-270 in 1965, and the freeway was completed three years later, stretching from I-70 to Vasquez Boulevard. The road was then extended to I-76 two years later. The section between I-25 and I-76 was completed in 1999. Since completion, this section has undergone much construction to renew bridges over Clear Creek and Washington Street. Because the western end of I-270 is close to the junction of I-25 and I-76, some traffic movements to I-25 can only be made by using I-76.",
	  "section_context":"I-270 begins at an interchange with I-25 in Welby, and is concurrent with US 36. The speed limit through the first section is 45 mph (72 km\/h). The freeway heads southeastward for about one mile (1.6 km), crossing over Washington Street and State Highway 224 (SH 224), but access is not provided to either road. Mileposts along I-270 reset to zero at the I-76 interchange because it was the original western end of the Interstate. Since the I-76 interchange is close to both I-270's western end and to the I-25 \/ I-76 interchanges, some movements in the interchange are missing. Eastbound I-270 traffic cannot access westbound I-76, nor can eastbound I-76 traffic access westbound I-270. However, traffic on I-25 can access both westbound I-76 and eastbound I-270, thus completing the missing movements. The three interchanges work together by eliminating bottlenecks caused by redundant interchanges.\nBeyond the I-76 interchange, the speed limit increases to 55 mph (89 km\/h). The freeway heads southeast and comes to a westbound exit and eastbound entrance with York Street, and crosses the South Platte River  into a commercial area in Adams County. I-270 enters the city of Commerce City, running roughly parallel with the nearby Sand Creek and crossing over SH 265 without an exit. Continuing through the city, the route comes to a cloverleaf interchange with Vasquez Boulevard, which carries US 85, SH 2, and US 6. The freeway heads eastward into Denver, where it has an exit at SH 35, a short highway which continues northward along Quebec Street for one mile (1.6 km). Quebec Street provides access for traffic heading to westbound I-70. The route ends shortly thereafter when it merges into I-70.\nThe freeway is maintained by the Colorado Department of Transportation (CDOT), who is responsible for maintaining and constructing transportation infrastructure in Colorado, including highways. As part of this role, CDOT periodically conducts surveys on their highways to measure traffic volume. This is expressed in terms of average annual daily traffic (AADT), which is a measure of traffic volume for any average day of the year. In 2009, CDOT calculated that as few as 56,500 vehicles used I-270 daily east of its western terminus at I-25, and as many as 89,600 vehicles used I-270 daily southeast of York Street in Commerce City. As part of the Interstate Highway System, the entire route is listed on the National Highway System, a system of roads that are important to the nation's economy, defense, and mobility.",
	  "description_length":20,
	  "caption_length":128,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"913.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/09\/Locust_Grove%2C_Poughkeepsie%2C_NY%2C_2014.jpg",
	  "page_title":"Locust Grove (Samuel F. B. Morse House)",
	  "section_title":null,
	  "caption":"West (front) elevation in 2014",
	  "caption_attribution_description":"English: Locust Grove, the home of Samuel F. B. Morse, a U.S. National Historic Landmark in Poughkeepsie, NY",
	  "description":"A pale yellow two-story house with reddish tiled roof in the Italian villa style. A pointed section projects from the front with the recessed, arched main entrance, and a tower pierces the roof in the rear.",
	  "page_context":"Locust Grove is a National Historic Landmark estate located on US 9 in the Town of Poughkeepsie, New York. The 200-acre park-like estate includes homes, a carriage house, ice house, trails, a flower garden, and vegetable garden, and it overlooks the Hudson River from a bluff. The property includes a home designed by architect Alexander Jackson Davis for Samuel F. B. Morse, the inventor of the telegraph. An Italianate style mansion, it was completed in 1851.\nThe estate is open to the public, tours are offered, and the site is used for weddings and parties. It includes a museum, nature preserve, antique exhibits, and a gallery showing artworks.",
	  "section_context":"Locust Grove is a National Historic Landmark estate located on US 9 in the Town of Poughkeepsie, New York. The 200-acre park-like estate includes homes, a carriage house, ice house, trails, a flower garden, and vegetable garden, and it overlooks the Hudson River from a bluff. The property includes a home designed by architect Alexander Jackson Davis for Samuel F. B. Morse, the inventor of the telegraph. An  Italianate style mansion, it was completed in 1851.\nThe estate is open to the public, tours are offered, and the site is used for weddings and parties. It includes a museum, nature preserve, antique exhibits, and a gallery showing artworks.",
	  "description_length":206,
	  "caption_length":30,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"624.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c1\/Apollo_15_Hadley_Rille.jpg",
	  "page_title":"Apollo 15",
	  "section_title":"Command module activities",
	  "caption":"The landing area is shown in an image taken by the mapping camera",
	  "caption_attribution_description":null,
	  "description":"Part of the lunar surface",
	  "page_context":"Apollo 15 was the ninth crewed mission in the United States' Apollo program, and the fourth to land on the Moon. It was the first J mission, with a longer stay on the Moon and a greater focus on science than earlier landings. Apollo 15 saw the first use of the Lunar Roving Vehicle.\nThe mission began on July 26, 1971, and ended on August 7, the lunar surface exploration taking place between July 30 and August 2. Commander David Scott and Lunar Module Pilot James Irwin landed near Hadley Rille and explored the local area using the rover, allowing them to travel further from the lunar module than had been possible on previous missions. They spent 18​¹⁄₂ hours on the Moon's surface on extravehicular activity, and collected 170 pounds of surface material.\nAt the same time, Command Module Pilot Alfred Worden orbited the Moon, operating the sensors in the SIM bay of the service module. This suite of instruments collected data on the Moon and its environment using a panoramic camera, a gamma-ray spectrometer, a mapping camera, a laser altimeter, a mass spectrometer, and a lunar subsatellite deployed at the end of the moonwalks.",
	  "section_context":"After the departure of Falcon, Worden in Endeavour executed a burn to take the CSM to a higher orbit. While Falcon was on the Moon, the mission effectively split, Worden and the CSM being assigned their own CAPCOM and flight support team.\nWorden got busy with the tasks that were to occupy him for much of the time he spent in space alone: photography and operating the instruments in the SIM bay. The door to the SIM bay had been explosively jettisoned during the translunar coast. Filling previously-unused space in the service module, the SIM bay contained a gamma-ray spectrometer, mounted on the end of a boom, an X-ray spectrometer and a laser altimeter, which failed part way through the mission. Two cameras, a stellar camera and a metric camera, together comprised the mapping camera, which was complemented by a panoramic camera, derived from spy technology. The altimeter and cameras permitted the exact time and location from which pictures were taken to be determined. Also present were an alpha particle spectrometer, which could be used to detect evidence of lunar volcanism, and a mass spectrometer, also on a boom in the hope it would be unaffected by contamination from the ship. The boom would prove troublesome, as Worden would not always be able to get it to retract.\nEndeavour was slated to pass over the landing site at the moment of planned landing, but Worden could not see Falcon and did not spot it until a subsequent orbit. He also exercised to avoid muscle atrophy, and Houston kept him up to date on Scott and Irwin's activities on the lunar surface. The panoramic camera did not operate perfectly, but provided enough images that no special adjustment was made. Worden took many photographs through the command module's windows, often with shots taken at regular intervals. His task was complicated by the lack of a working mission timer in the Lower Equipment Bay of the command module, as its circuit breaker had popped en route to the Moon. Worden's observations and photographs would inform the decision to send Apollo 17 to Taurus-Littrow to search for evidence of volcanic activity. There was a communications blackout when the CSM passed over the far side of the Moon from Earth; Worden greeted each resumption of contact with the words, \"Hello, Earth. Greetings from Endeavour\", expressed in different languages. Worden and El-Baz had come up with the idea, and the geology instructor had aided the astronaut in accumulating translations.\nResults from the SIM bay experiments would include the conclusion, from data gathered by the X-ray spectrometer, that there was greater fluorescent X-ray flux than anticipated, and that the lunar highlands were richer in aluminum than were the mares. Endeavour was in a more inclined orbit than previous crewed missions, and Worden saw features that were not known previously, supplementing photographs with thorough descriptions.\nBy the time Scott and Irwin were ready to take off from the lunar surface and return to Endeavour, the CSM's orbit had drifted due to the rotation of the Moon, and a plane change burn was required to ensure that the CSM's orbit would be in the same plane as that of the LM once it took off from the Moon. Worden accomplished the 18-second burn with the SPS.",
	  "description_length":25,
	  "caption_length":65,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"826.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/96\/DdRNAi_constructs_jpg.jpg",
	  "page_title":"DNA-directed RNA interference",
	  "section_title":"Organization of ddRNAi constructs",
	  "caption":"Figure 2: ddRNAi DNA constructs",
	  "caption_attribution_description":"English: Aligned ddRNAi construct designs for the production of therapeutic shRNAs",
	  "description":"text",
	  "page_context":"DNA-directed RNA interference is a gene-silencing technique that utilizes DNA constructs to activate an animal cell's endogenous RNA interference pathways. DNA constructs are designed to express self-complementary double-stranded RNAs, typically short-hairpin RNAs, that once processed bring about silencing of a target gene or genes. Any RNA, including endogenous mRNAs or viral RNAs, can be silenced by designing constructs to express double-stranded RNA complementary to the desired mRNA target.\nThis mechanism has great potential as a novel therapeutic to silence disease-causing genes. Proof-of-concept has been demonstrated across a range of disease models, including viral diseases such as HIV, hepatitis B or hepatitis C, or diseases associated with altered expression of endogenous genes such as drug-resistant lung cancer, neuropathic pain, advanced cancer and retinitis pigmentosa.",
	  "section_context":"Figure 2 illustrates the most common type of ddRNAi DNA construct, which is designed to express a shRNA. This consists of a promoter sequence, driving expression of sense and antisense sequences separated by a loop sequence, followed by a transcriptional terminator. The antisense species processed from the shRNA can bind to the target RNA and specify its degradation. shRNA constructs typically encode sense and antisense sequences of 20 – 30 nucleotides. Flexibility in construct design is possible: for example, the positions of sense and antisense sequences can be reversed, and other modifications and additions can alter intracellular shRNA processing. Moreover, a variety of promoter loop and terminator sequences can be used.\nA particularly useful variant is a multi-cassette (Figure 2b). Designed to express two or more shRNAs, they can target multiple sequences for degradation simultaneously. This is a particularly useful strategy for targeting viruses. Natural sequence variations can render a single shRNA-target site unrecognizable preventing RNA degradation. Multi-cassette constructs that target multiple sites within the same viral RNA circumvent this issue.",
	  "description_length":4,
	  "caption_length":31,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"283.jpg"
	},
	{
	  "language":"en",
	  "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/54\/Strepera_fuliginosa_2.jpg",
	  "page_title":"Black currawong",
	  "section_title":"Feeding",
	  "caption":"Black currawong, Fortescue Bay, Tasman Peninsula",
	  "caption_attribution_description":"Black Currawong (Strepera fuliginosa)",
	  "description":"A black crow-like bird with a heavy bill and yellow eyes sits on a rock with some bushland in the background.",
	  "page_context":"The black currawong, also known locally as the black jay, is a large passerine bird endemic to Tasmania and the nearby islands within the Bass Strait. One of three currawong species in the genus Strepera, it is closely related to the butcherbirds and Australian magpie within the family Artamidae. It is a large crow-like bird, around 50 cm long on average, with yellow irises, a heavy bill, and black plumage with white wing patches. The male and female are similar in appearance. Three subspecies are recognised, one of which, Strepera fuliginosa colei of King Island, is vulnerable to extinction.\nWithin its range, the black currawong is generally sedentary, although populations at higher altitudes relocate to lower areas during the cooler months. The habitat includes densely forested areas as well as alpine heathland. It is rare below altitudes of 200 m. Omnivorous, its diet includes a variety of berries, invertebrates, and small vertebrates. Less arboreal than the pied currawong, the black currawong spends more time foraging on the ground. It roosts and breeds in trees.",
	  "section_context":"No systematic studies have been done on the diet of the black currawong, but it is known to be omnivorous, feeding on a wide variety of foodstuffs including insects and small vertebrates, carrion, and berries. Birds forage on the ground most often, but also in tree canopies. They use their bills to probe the ground or turn over clods of earth or small rocks looking for food. Birds have been seen using walking tracks to forage along. A group of ten birds were observed trying to break open ice on a frozen lake. They have been recorded foraging along the beach for fly larvae in beached kelp. Most commonly, black currawongs forage in pairs, but they may congregate in larger groups—flocks of 100 birds have descended on orchards to eat apples or rotten fruit. The species has been observed in a mixed-species flocks with forest ravens (Corvus tasmanicus), and silver gulls (Chroicocephalus novaehollandiae), white-faced herons (Egretta novaehollandiae), white-fronted chats (Epthianura albifrons), and European starlings (Sturnus vulgaris) on the beach at Sundown Point. They have been observed securing dead larger prey to ease subsequent dismemberment; a parent currawong had wedged a dead chicken's wings under a log to facilitate pulling off portions such as legs and entrails to feed to its young, and another time hooked a dead rabbit on a spur of a log to rip it into pieces.\nThe black currawong consumes the berries of the heath species Leptecophylla juniperina, and Astroloma humifusum, and the native sedge Gahnia grandis, as well as domestic pea, and apples. Invertebrates consumed include earthworms (Lumbricidae) and many types of insects, such as ants, moths, flies, crickets, grasshoppers and beetles like weevils, scarabs and leaf beetles. It is adaptable, and has learnt to eat the introduced European wasp (Vespula germanica). A bird that was being harassed by three scarlet robins (Petroica boodang) was seen to suddenly turn on them and catch and eat one. Other vertebrates recorded as prey include the house mouse (Mus musculus), small lizards, tadpoles, chickens, ducklings, the young of domestic turkey, Tasmanian nativehen (Gallinula mortierii), flame robin (Petroica phoenicea) and rabbit.\nIt can become quite bold and tame, much like its close relative, the pied currawong on the Australian mainland, especially in public parks and gardens where people make a habit of feeding it. Black currawongs have been recorded taking young peas from pods, raiding orchards, seizing chickens from poultry yards, and entering barns in search of mice.\nBlack currawongs are very common around picnic areas in Tasmania's two most popular National Parks, Freycinet and Cradle Mountain-Lake St Clair, and are often fed by tourists there. The National Parks Authority tolerated this practice until 1995, when they found the birds were becoming a nuisance and began discouraging people from feeding wildlife. However, the agile currawongs are adept at snatching fragments of food left by picnickers so the birds may only ultimately be discouraged by an (impractical) ban on food in National Parks. Birds also take other items such as soap or cutlery from campsites to examine.",
	  "description_length":109,
	  "caption_length":48,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"607.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/37\/2020-07-31_16_34_19_will_rename_and_categorize_soon_36.jpg",
	  "page_title":"U.S. Route 206",
	  "section_title":"Somerset County",
	  "caption":"I-287 and 78 exit off northbound US 202\/206",
	  "caption_attribution_description":"English: will rename and categorize soon",
	  "description":"A multilane highway in a suburban area at a split, with two green signs over the road. The sign on the left reads north Interstate 287 to Interstate 78 Netcong Morristown with an arrow pointing to the upper right and the sign on the right reading north U.S. Route 202\/U.S. Route 206 Pluckemin.",
	  "page_context":"U.S. Route 206 is a 130.23-mile-long north–south United States highway in New Jersey and Pennsylvania, United States. Only about a half a mile of its length is in Pennsylvania; the Milford–Montague Toll Bridge carries it over the Delaware River into New Jersey, where the remainder of the route is. The highway's northern terminus is near Milford, Pennsylvania at an intersection with US 209; some sources and signs show an overlap with US 209 to end at its parent route US 6. Its southern terminus is in Hammonton, New Jersey at an intersection with Route 54 and US 30. For much of its length, US 206 is a rural two-lane undivided road that passes through the Pine Barrens, agricultural areas, and the Appalachian Mountains of northwestern New Jersey, with some urban and suburban areas. The route connects several cities and towns, including Bordentown, Trenton, Princeton, Somerville, Netcong, and Newton. The road is known as the Disabled American Veterans Highway for much of its length.",
	  "section_context":"US 206 enters Montgomery Township in Somerset County, where the name of the road becomes Van Horne Memorial Highway. In Montgomery Township, the route runs to the east of Princeton Airport and crosses CR 518. Following this intersection, CR 533 splits from US 206 by heading northeast, and US 206 continues north-northwest through a mix of suburban and rural areas. The road passes through the community of Harlingen before widening to four lanes and reaching Belle Mead.  In this area, US 206 passes over CSX’s Trenton Subdivision before making a turn to the northeast and then to the north, narrowing back to two lanes. The road enters Hillsborough Township, where the Van Horne Memorial Highway designation ends.  It crosses an abandoned railroad line leading to the Belle Mead General Depot before continuing into residential and commercial areas of Hillsborough. The road comes to a junction with CR 514 in this area.\nPast the CR 514 intersection, US 206 makes a curve northeast before heading north again. Leaving the center of Hillsborough, the road runs northeast past more wooded areas as it crosses under Norfolk Southern's Lehigh Line. The route passes more development as it widens into a four lane divided highway with jughandles, turning to the north and passing Duke Gardens.  US 206 briefly becomes six lanes wide at the CR 608 intersection before narrowing back to four lanes as it crosses the Raritan River into Somerville.  In Somerville, the road runs northwest parallel to the Raritan River prior to turning north into commercial areas and entering Raritan. US 206 runs under NJ Transit's Raritan Valley Line before making a turn to the north-northwest.\nUS 206 comes to the modified Somerville Circle, where it meets  US 202 and Route 28. At this modified traffic circle, US 206 and Route 28 run through it while US 202 passes over it with ramp access. US 206 forms a concurrency with US 202 at this point and the two routes continue north into Bridgewater Township, briefly entering Somerville.  The road features an interchange with US 22 and heads north with the Bridgewater Commons shopping mall on the east side of the road and the Somerset Corporate Center on the west side of the road. An interchange with Commons Way provides access to both these places. Past Commons Way, the road passes under Garrettson Road and comes to an interchange with I-287 that also provides access to I-78.  Past the I-287 interchange, US 202\/206 continue north as a two-lane undivided road past suburban areas.  The road crosses Chambers Brook into Bedminster Township, where it soon passes under I-78. Shortly after I-78, it widens into a four-lane divided highway with a Jersey barrier. US 202\/206 come to another interchange with I-287, pass over the North Branch Raritan River, and come to an intersection where the two routes split.\nAfter the US 202 split, US 206 continues north as a four-lane divided highway through commercial areas, with the grass median becoming replaced by a painted median as it comes to a junction with CR 523 in downtown Bedminster. Following this intersection, the route narrows into a two-lane undivided road that runs through less development.  US 206 enters Peapack-Gladstone, where it runs a short distance to the west of NJ Transit's Gladstone Branch. In Peapack-Gladstone, the road briefly becomes a four-lane divided highway as it has an interchange with Pfizer Way, a road that provides access to a Pfizer facility. Past this point, US 206 becomes a two-lane undivided road that runs northwest through rural areas, with CR 512 crossing the road. Just after this intersection, the route enters Bedminster Township again, turning to the north.",
	  "description_length":293,
	  "caption_length":43,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"464.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/23\/Stedman-hanging_by_Cristoforo_dall%27Acqua.jpg",
	  "page_title":"Coromantee",
	  "section_title":"History",
	  "caption":"An engraving by William Blake illustrating \"A negro hung by his ribs from a gallows,\" from Captain John Stedman's Narrative of a Five Years Expedition Against the Revolted Negroes of Surinam, 1792.",
	  "caption_attribution_description":"English: Captain John Stedman: A negro hung by his ribs from a gallows, 1792",
	  "description":"Drawing of a hanged negro",
	  "page_context":"Coromantee, Coromantins, Coromanti or Kormantine was the English name for enslaved people from the Akan ethnicity from the Gold Coast in modern Ghana. The term was primarily used in the Caribbean and is now considered archaic.",
	  "section_context":null,
	  "description_length":25,
	  "caption_length":197,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"244.jpg"
	},
	{
	  "language":"en",
	  "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8f\/AlYankovicByKristineSlipson.jpg",
	  "page_title":"\"Weird Al\" Yankovic discography",
	  "section_title":null,
	  "caption":"Yankovic performing live in concert during his 2010 tour",
	  "caption_attribution_description":"English: \"Weird Al\" Yankovic performing live in concert during his 2010 Tour.",
	  "description":"A long-haired man plays an accordion and sings into a microphone.",
	  "page_context":"The discography of American singer, songwriter, musician and parodist \"Weird Al\" Yankovic consists of fourteen studio albums, ten compilation albums, eleven video albums, two extended plays, forty-six singles and fifty-four music videos. Since the debut of his first comedy song in 1976, he has sold more than 12 million albums—more than any other comedy act in history—recorded more than 150 parody and original songs, and performed more than 1,000 live shows. His works have earned him five Grammy Awards among sixteen nominations, along with several gold and platinum record certifications in the United States. Yankovic's first single, \"My Bologna\", was released in 1979, and he made his chart debut two years later with his second single, \"Another One Rides the Bus\", which peaked at number four on the Billboard Bubbling Under Hot 100 Singles chart. His self-titled debut studio album was released on Scotti Brothers Records in April 1983, peaking at number 16 on the US Billboard 200 and being certified gold by the Recording Industry Association of America. \"Ricky\", the album's third single, became his first single to chart on the US Billboard Hot 100, peaking at number 64.",
	  "section_context":"The discography of American singer, songwriter, musician and parodist \"Weird Al\" Yankovic consists of fourteen studio albums, ten compilation albums, eleven video albums, two extended plays, forty-six singles and fifty-four music videos. Since the debut of his first comedy song in 1976, he has sold more than 12 million albums—more than any other comedy act in history—recorded more than 150 parody and original songs, and performed more than 1,000 live shows. His works have earned him five Grammy Awards among sixteen nominations, along with several gold and platinum record certifications in the United States. Yankovic's first single, \"My Bologna\", was released in 1979, and he made his chart debut two years later with his second single, \"Another One Rides the Bus\", which peaked at number four on the Billboard Bubbling Under Hot 100 Singles chart. His self-titled debut studio album was released on Scotti Brothers Records in April 1983, peaking at number 16 on the US Billboard 200 and being certified gold by the Recording Industry Association of America (RIAA). \"Ricky\", the album's third single, became his first single to chart on the US Billboard Hot 100, peaking at number 64.\n\"Weird Al\" Yankovic in 3-D followed in February 1984. It peaked at number 17 on the Billboard 200 and was certified platinum by the RIAA, while also charting in Australia and Canada. The album's lead single \"Eat It\" was a commercial success, topping the Australian singles chart and also reaching the top 15 in Canada and the United States. Follow-up singles \"King of Suede\" and \"I Lost on Jeopardy\" peaked at numbers 62 and 81 respectively on the Hot 100. Yankovic's third studio album Dare to Be Stupid, released in June 1985, peaked at number 17 on the Billboard 200 and produced six singles, the most successful being the Hot 100 hit \"Like a Surgeon\". Issued in October 1986, his fourth studio album Polka Party! charted at a disappointing number 177 on the Billboard 200, with the album and its accompanying singles failing to match the commercial success of Yankovic's previous work. His fifth studio album, released in April 1988, Even Worse fared better commercially, peaking at number 27 on the Billboard 200 and earning him a minor chart hit with the single \"Fat\". Released later in October 1988 was Peter and the Wolf, a collaboration with American composer Wendy Carlos.\nIn 1989, Yankovic starred in and recorded the soundtrack for the 1989 film UHF. The soundtrack album was released in July 1989, charting at number 146 on the Billboard 200. Released in April 1992, Yankovic's seventh studio album Off the Deep End helped revitalize his career after a decline in commercial success in the late 1980s, peaking at number 17 on the Billboard 200, earning a platinum certification from the RIAA, and producing the Billboard top 40 hit \"Smells Like Nirvana\". Alapalooza, his eighth studio album, was released in October 1993; it peaked at number 46 on the Billboard 200. Bad Hair Day, Yankovic's ninth studio album was released in April 1996, peaked at numbers 9 and 14 respectively on the Canadian Albums Chart and Billboard 200. \"Amish Paradise\", the album's lead single, peaked at number 53 on the Billboard Hot 100.\nAfter signing to new label Volcano Records, Yankovic released his tenth studio album Running with Scissors in June 1999. The album peaked at number 16 on the Billboard 200 and produced a minor Australian chart hit, \"Pretty Fly for a Rabbi\". Poodle Hat, his eleventh studio album, was released in May 2003 and peaked at number 17 on the Billboard 200. Straight Outta Lynwood was released in September 2006 and peaked at number 10 on the Billboard 200, becoming Yankovic's first top ten album on the chart. He also scored his first top ten hit on the Billboard Hot 100 with the album's lead single \"White & Nerdy\". Alpocalypse was released in June 2011 and peaked at number nine on the Billboard 200, and Mandatory Fun followed in July 2014. The latter became Yankovic's first number-one album on the chart, with first-week sales of 104,000 copies.\nSince 1991, when Nielsen sta",
	  "description_length":65,
	  "caption_length":56,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"576.jpg"
	},
	{
	  "language":"en",
	  "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/a1\/Richard_II_King_of_England.jpg",
	  "page_title":"Peasants' Revolt",
	  "section_title":"Aftermath",
	  "caption":"Late 14th-century portrait of Richard II in Westminster Abbey.",
	  "caption_attribution_description":null,
	  "description":"Medieval painting",
	  "page_context":"The Peasants' Revolt, also named Wat Tyler's Rebellion or the Great Rising, was a major uprising across large parts of England in 1381. The revolt had various causes, including the socio-economic and political tensions generated by the Black Death pandemic in the 1340s, the high taxes resulting from the conflict with France during the Hundred Years' War, and instability within the local leadership of London. The final trigger for the revolt was the intervention of a royal official, John Bampton, in Essex on 30 May 1381. His attempts to collect unpaid poll taxes in Brentwood ended in a violent confrontation, which rapidly spread across the south-east of the country. A wide spectrum of rural society, including many local artisans and village officials, rose up in protest, burning court records and opening the local gaols. The rebels sought a reduction in taxation, an end to the system of unfree labour known as serfdom, and the removal of the King's senior officials and law courts.\nInspired by the sermons of the radical cleric John Ball and led by Wat Tyler, a contingent of Kentish rebels advanced on London.",
	  "section_context":"The royal government and Parliament began to re-establish the normal processes of government after the revolt; as the historian Michael Postan describes, the uprising was in many ways a \"passing episode\". On 30 June, the King ordered England's serfs to return to their previous conditions of service, and on 2 July the royal charters signed under duress during the rising were formally revoked. Parliament met in November to discuss the events of the year and how best to respond to their challenges. The revolt was blamed on the misconduct of royal officials, who, it was argued, had been excessively greedy and overbearing. The Commons stood behind the existing labour laws, but requested changes in the royal council, which Richard granted. Richard also granted general pardons to those who had executed rebels without due process, to all men who had remained loyal, and to all those who had rebelled – with the exception of the men of Bury St Edmunds, any men who had been involved in the killing of the King's advisers, and those who were still on the run from prison.\nDespite the violence of the suppression, the government and local lords were relatively circumspect in restoring order after the revolt, and continued to be worried about fresh revolts for several decades. Few lords took revenge on their peasants except through the legal processes of the courts. Low-level unrest continued for several more years. In September 1382 there was trouble in Norfolk, involving an apparent plot against the Bishop of Norwich, and in March the following year there was an investigation into a plot to kill the sheriff of Devon. When negotiating rents with their landlords, peasants alluded to the memory of the revolt and the threat of violence.\nThere were no further attempts by Parliament to impose a poll tax or to reform England's fiscal system. The Commons instead concluded at the end of 1381 that the military effort on the Continent should be \"carefully but substantially reduced\". Unable to raise fresh taxes, the government had to curtail its foreign policy and military expeditions and began to examine the options for peace. The institution of serfdom declined after 1381, but primarily for economic rather than political reasons. Rural wages continued to increase, and lords increasingly sold their serfs' freedom in exchange for cash, or converted traditional forms of tenure to new leasehold arrangements. During the 15th century the institution vanished in England.",
	  "description_length":17,
	  "caption_length":62,
	  "identical_text":false,
	  "avg_caption_len_bylang":56.9643428997,
	  "heuristic_category":"nonident",
	  "img_id":"203.jpg"
	}
  ];