[
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/d2\/Kaleytsa%2C_Bulgaria.jpg",
    "page_title":"Kaleytsa",
    "section_title":null,
    "caption":"Fields surround by sheeps in Kaleytsa",
    "caption_attribution_description":"English: village of Kaleytsa, Bulgaria Български: типична снимка за едно село",
    "description":"Fields surround by sheeps in Kaleytsa",
    "page_context":"Kaleitsa is a village in Troyan Municipality, Lovech Province, northern Bulgaria.",
    "section_context":"Kaleitsa is a village in Troyan Municipality, Lovech Province, northern Bulgaria.",
    "description_length":37,
    "caption_length":37,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1205.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/1\/17\/St._Wenceslaus_complex_%28Tabor%2C_South_Dakota%29_from_SE_1.jpg",
    "page_title":"Tabor, South Dakota",
    "section_title":null,
    "caption":"St. Wenceslaus Church, October 2015",
    "caption_attribution_description":"English: St. Wenceslaus rectory (left, largely obscured by trees) and church, located at northwest corner of Lidice and Yankton Streets in Tabor, South Dakota; seen from the southeast, looking obliquely across Yankton. The cemetery is out of frame to the right (east).",
    "description":"St. Wenceslaus Church, October 2015",
    "page_context":"Tabor is a town in Bon Homme County, South Dakota, United States. The population was 423 at the 2010 census.",
    "section_context":"Tabor (pronounced \"TAY'-bur\") is a town in Bon Homme County, South Dakota, United States. The population was 423 at the 2010 census.",
    "description_length":35,
    "caption_length":35,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1099.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/ca\/JIRCAS_Seberi_market_crop.jpg",
    "page_title":"Kollo, Niger",
    "section_title":null,
    "caption":"Market in Seberi village, Kollo, Niger.",
    "caption_attribution_description":"English: Market in Seberi village, Kollo, Niger.",
    "description":"Market in Seberi village, Kollo, Niger.",
    "page_context":"Kollo is a large town and urban commune in southwestern Niger, where NGOs work, as well as, missionaries and Peace Corps volunteers.",
    "section_context":"Kollo is a large town and urban commune in southwestern Niger, where NGOs work, as well as, missionaries and Peace Corps volunteers.",
    "description_length":39,
    "caption_length":39,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1160.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/b0\/Khandeshwar_Temple.jpg",
    "page_title":"Nandgaon Khandeshwar",
    "section_title":null,
    "caption":"Khandeshwar Temple",
    "caption_attribution_description":"English: Khandeshwar Temple",
    "description":"Khandeshwar Temple",
    "page_context":"Nandgaon Khandeshwar is a city and a municipal council in Amravati district in the state of Maharashtra, India. Nandgaon Khandeshwar is one of the three talukas in Chandur subdivision in Amravati district. Nandgaon Khandeshwar is Taluka place in Amravati District. Khandeshwar temple is most famous and old place in Nandgaon Khandeshwar. This temple was built by Hemadpantis. In Mahashivratri there will be fair at khandeshwar temple which is big event for the whole Nandgaon Khandeshwar people. This event is celebrated for 7 days by whole Nandgaon.\nThis is one of the Nagar panchayats of Amravati district.It has good connectivity of roads.It is near to Samrudhi Highway and Navnagar.",
    "section_context":"Nandgaon Khandeshwar is a city and a municipal council in Amravati district in the state of Maharashtra, India. Nandgaon Khandeshwar is one of the three talukas (Other two are Dhamangaon Railway and Chandur Railway) in Chandur (Railway) subdivision in Amravati district. Nandgaon Khandeshwar is Taluka place in Amravati District. Khandeshwar temple is most famous and old place in Nandgaon Khandeshwar. This temple was built by Hemadpantis. In Mahashivratri there will be fair at khandeshwar temple which is big event for the whole Nandgaon Khandeshwar people. This event is celebrated for 7 days by whole Nandgaon.\nThis is one of the Nagar panchayats of Amravati district.It has good connectivity of roads.It is near to Samrudhi Highway and Navnagar.",
    "description_length":18,
    "caption_length":18,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1166.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/4e\/Montagne_de_crat%C3%A8re_%C3%A0_Koutaba2.jpg",
    "page_title":"Koutaba",
    "section_title":null,
    "caption":"Mountainous landscape around Koutaba.",
    "caption_attribution_description":"Français&#160;: Dans les alentours du montagne du lac de cratère à Koutaba dans le noun, à l'Ouest du Cameroun",
    "description":"Mountainous landscape around Koutaba.",
    "page_context":"Koutaba is a town and commune in Cameroon.",
    "section_context":"Koutaba is a town and commune in Cameroon.",
    "description_length":37,
    "caption_length":37,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1102.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8e\/Rise_To_Remain_Live_at_Warped_Tour_Pomona.JPG",
    "page_title":"Rise to Remain",
    "section_title":null,
    "caption":"Rise to Remain in 2012 - Ben Tovey and Austin Dickinson",
    "caption_attribution_description":"English: Rise To Remain Live at Warped Tour Pomona CA",
    "description":"Rise to Remain in 2012 - Ben Tovey and Austin Dickinson",
    "page_context":"Rise to Remain was an English, London-based heavy metal band, formed in 2006 and disbanded in 2015. The band made appearances at Download Festival, Sonisphere Festival and extensively toured the UK and Europe. The band released three EPs, the majority of which were \"viral\" releases, via their MySpace. On 16 March 2011 they signed their first major recording contract with EMI records, which was accompanied by the launch of their website and a free single download entitled \"The Serpent\".\nTheir debut album, City of Vultures, was released on 5 September 2011, nearly a year after they had started work on recording the album. It was produced by revered metal producer Colin Richardson and Carl Bown. In 2014, the band released a new single entitled \"Over and Over\".\nThe band were praised by magazines, such as Metal Hammer and Kerrang!, with the former releasing a scaled-down version of their first nationwide-release EP, Bridges Will Burn. They received radioplay through the likes of BBC Radio One and Total Rock, as well as having their music videos regularly rotated on Scuzz and Kerrang! TV.",
    "section_context":"Rise to Remain was an English, London-based heavy metal band, formed in 2006 and disbanded in 2015. The band made appearances at Download Festival, Sonisphere Festival and extensively toured the UK and Europe. The band released three EPs, the majority of which were \"viral\" releases, via their MySpace. On 16 March 2011 they signed their first major recording contract with EMI records, which was accompanied by the launch of their website and a free single download entitled \"The Serpent\".\nTheir debut album, City of Vultures, was released on 5 September 2011, nearly a year after they had started work on recording the album. It was produced by revered metal producer Colin Richardson and Carl Bown.  In 2014, the band released a new single entitled \"Over and Over\".\nThe band were praised by magazines, such as Metal Hammer and Kerrang!, with the former releasing a scaled-down version of their first nationwide-release EP, Bridges Will Burn. They received radioplay through the likes of BBC Radio One and Total Rock, as well as having their music videos regularly rotated on Scuzz and Kerrang! TV. They were voted \"Best New Band\" at the 2010 Metal Hammer \"Golden God Awards\", an award decided by 400,000 votes around the globe, and the 2010 Kerrang! Award for \"Best British Newcomer\".\nIn January 2015 the band announced that they would be splitting up. A few of the bandmates have subsequently formed a new band, As Lions.",
    "description_length":55,
    "caption_length":55,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1137.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/87\/Conflans-Ste-Honorine_map.png",
    "page_title":"Conflans-Sainte-Honorine",
    "section_title":null,
    "caption":"Location (in red) within Paris inner and outer suburbs",
    "caption_attribution_description":"English: Created map myself.",
    "description":"Location (in red) within Paris inner and outer suburbs",
    "page_context":"Conflans-Sainte-Honorine is a commune in the Yvelines department in the Île-de-France region in north-central France. It is located in the north-western suburbs of Paris, 24.2 km from the center of Paris.\nThe commune was originally named for its geographic position at the confluence of the Seine and Oise rivers. The village was given the addition \"Sainte Honorine\" in the 13th century after the female Saint Honorina, whose relics had been stored there since 876.\nPartly on account of its strategic position, Conflans-Sainte-Honorine is considered the capital of the French inland waterways, and the right bank of the River Seine is still lined with barges. Every year in June, the town celebrates the \"Pardon national de la batellerie\" in remembrance of its former importance to inland shipping.",
    "section_context":"Conflans-Sainte-Honorine is a commune in the Yvelines department in the Île-de-France region in north-central France. It is located in the north-western suburbs of Paris, 24.2 km (15.0 mi) from the center of Paris.\nThe commune was originally named for its geographic position at the confluence of the Seine and Oise rivers. The village was given the addition \"Sainte Honorine\" in the 13th century after the female Saint Honorina, whose relics had been stored there since 876.\nPartly on account of its strategic position, Conflans-Sainte-Honorine is considered the capital of the French inland waterways, and the right bank of the River Seine is still lined with barges (although these are now used mainly as houseboats). Every year in June, the town celebrates the \"Pardon national de la batellerie\" in remembrance of its former importance to inland shipping.",
    "description_length":54,
    "caption_length":54,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1033.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/da\/Parish_of_Saint_Andrew%2C_Saint_Vincent_and_the_Grenadines.png",
    "page_title":"Saint Andrew Parish, Saint Vincent and the Grenadines",
    "section_title":null,
    "caption":"Map of the Parish of Saint Andrew",
    "caption_attribution_description":"English: Parish of Saint Andrew, Saint Vincent and the Grenadines",
    "description":"Map of the Parish of Saint Andrew",
    "page_context":"Saint Andrew is an administrative parish of Saint Vincent and the Grenadines, on the island of Saint Vincent. Its capital is Layou.\nArea: 29 km²\nPopulation: 6,700",
    "section_context":"Saint Andrew is an administrative parish of Saint Vincent and the Grenadines, on the island of Saint Vincent. Its capital is Layou.\nArea: 29 km² (11 mi²)\nPopulation: 6,700 (2000 estimates)",
    "description_length":33,
    "caption_length":33,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1121.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/f1\/Miyawaka_city_hall.JPG",
    "page_title":"Miyawaka",
    "section_title":null,
    "caption":"Miyawaka city hall",
    "caption_attribution_description":"English: Miyawaka city hall,Fukuoka prefecture,Japan 日本語: 宮若市役所、福岡県、日本",
    "description":"Miyawaka city hall",
    "page_context":"Miyawaka is a city located in Fukuoka, Japan.\nAs of April 1, 2017, the city has a population of 27,544 and a population density of 200 persons per km². The total area is 139.99 km².\nThe modern city of Miyawaka was established on February 11, 2006, from the merger of the towns of Miyata and Wakamiya.\nSince February 1991, the manufacturing facility of Toyota Motor Kyushu, Inc. has been based in Miyawaka, building both Toyota and Lexus models.\nA firefly festival is held at Nishikura no Oka Sports Park. At the beginning of June, many fireflies dance around the whole park.",
    "section_context":"Miyawaka (宮若市, Miyawaka-shi) is a city located in Fukuoka, Japan.\nAs of April 1, 2017, the city has a population of 27,544 and a population density of 200 persons per km². The total area is 139.99 km².\nThe modern city of Miyawaka was established on February 11, 2006, from the merger of the towns of Miyata and Wakamiya (both from Kurate District).\nSince February 1991, the manufacturing facility of Toyota Motor Kyushu, Inc. has been based in Miyawaka, building both Toyota and Lexus models.\nA firefly festival is held at Nishikura no Oka Sports Park. At the beginning of June, many fireflies dance around the whole park.",
    "description_length":18,
    "caption_length":18,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1001.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c1\/Passail_in_WZ.png",
    "page_title":"Passail",
    "section_title":null,
    "caption":"Location within Weiz district",
    "caption_attribution_description":"English: This map shows the area of the Gemeinde (municipality) Passail in the Bezirk (district) Weiz, Styria, Austria. Deutsch: Diese Karte zeigt das Gebiet der Gemeinde Passail im Bezirk Weiz, Steiermark, Österreich.",
    "description":"Location within Weiz district",
    "page_context":"Passail is a municipality in the district of Weiz in the Austrian state of Styria.\nIt is situated approximately 30 kilometers north-east of the state capital Graz.",
    "section_context":"Passail is a municipality in the district of Weiz in the Austrian state of Styria.\nIt is situated approximately 30 kilometers north-east of the state capital Graz.",
    "description_length":29,
    "caption_length":29,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1225.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/ab\/Situacion_Vilamart%C3%ADn_de_Valdeorras.PNG",
    "page_title":"Vilamartín de Valdeorras",
    "section_title":null,
    "caption":"Location in Galicia",
    "caption_attribution_description":"Mapa coa localización do concello de Vilamartín de Valdeorras.",
    "description":"Location in Galicia",
    "page_context":"Vilamartín de Valdeorras is a municipality in Ourense in the Galicia region of north-west Spain. It is located in the very northeast of the province.",
    "section_context":"Vilamartín de Valdeorras is a municipality in Ourense (province) in the Galicia region of north-west Spain. It is located in the very northeast of the province.",
    "description_length":19,
    "caption_length":19,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1053.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/4a\/Makovy_frgal.jpg",
    "page_title":"Kolach",
    "section_title":null,
    "caption":"Larger koláč, called \"frgál\", typical of the Moravian Wallachia area",
    "caption_attribution_description":"Čeština: tradiční valašský makový frgál English: Vlachs' typical cakes, baked in Valašsko area. Named koláče (\"colaci\" in Romanian) and also called \"frgály\" (frigare, from \"a frige\", to roast in Romanian). Italiano: I koláče (o frgály), dolci tipici dei Valacchi.",
    "description":"Larger koláč, called \"frgál\", typical of the Moravian Wallachia area",
    "page_context":"A kolach is a type of pastry that holds a portion of fruit surrounded by puffy dough.\nOriginating as a semisweet wedding dessert from Central Europe and later a breakfast item in South London, they have become popular in parts of the United States. The name originates from the Czech, and originally Old Slavonic word kolo meaning \"circle\", \"wheel\". A klobásník, which contains sausage or other meat, is often thought to be a variation of the kolach; however, most Czechs hold the distinction that kolache are only filled with non-meat fillings. Unlike kolache, which came to the United States with Czech immigrants, klobásníky were first made by Czechs who settled in Texas.\nKolaches are often associated with Cedar Rapids and Pocahontas in Iowa where they were introduced by Czech immigrants in the 1870s. They are served at church suppers and on holidays but also as an everyday comfort food. Recipes are usually passed down with some including spices like mace or nutmeg. They can be filled with a combination of prune, apricot, cream cheese, poppy seed or assorted other fillings.",
    "section_context":"A kolach (also spelled kolache, kolace or kolacky \/kəˈlɑːtʃi, -tʃki\/, from the Czech and Slovak plural koláče, sg. koláč) is a type of pastry that holds a portion of fruit surrounded by puffy dough.\nOriginating as a semisweet wedding dessert from Central Europe and later a breakfast item in South London, they have become popular in parts of the United States. The name originates from the Czech (Bohemian), and originally Old Slavonic word kolo meaning \"circle\", \"wheel\". A klobásník, which contains sausage or other meat, is often thought to be a variation of the kolach (koláče); however, most Czechs hold the distinction that kolache are only filled with non-meat fillings. Unlike kolache, which came to the United States with Czech immigrants, klobásníky were first made by Czechs who settled in Texas.\nKolaches are often associated with Cedar Rapids and Pocahontas in Iowa where they were introduced by Czech immigrants in the 1870s. They are served at church suppers and on holidays but also as an everyday comfort food. Recipes are usually passed down with some including spices like mace or nutmeg. They can be filled with a combination of prune, apricot, cream cheese, poppy seed or assorted other fillings.",
    "description_length":68,
    "caption_length":68,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1204.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/7\/79\/Cheb-main_square.JPG",
    "page_title":"Cheb",
    "section_title":null,
    "caption":"George of Poděbrady square",
    "caption_attribution_description":"Deutsch: Der Marktplatz von Eger\/Cheb in Westböhmen in der tschechischen Republik. English: The market square of Cheb\/Eger in Western Bohemia, Czech Republic.",
    "description":"George of Poděbrady square",
    "page_context":"Cheb is a town in the Karlovy Vary Region of the Czech Republic, with about 32,000 inhabitants. It is on the river Ohře, at the foot of the Smrčiny near the border with Germany. Before the 1945 expulsion of the German speaking population, the town was the centre of the German-speaking region known as Egerland, part of the Northern Austro-Bavarian dialect area.\nThe name of the town was in 1061 recorded as Egire; in 1179 it was known as Egra; from 1322 as Eger and the surrounding territory as Regio Egere and Provincia Egrensis; after the 14th century also as Cheb or Chba. From 1850 it was given the twin official names of Eger and Cheb.\nFrom 1938 to 1945 it was one of the municipalities in Sudetenland. In Arthur Conan Doyle’s Sherlock Holmes story \"A Scandal in Bohemia\", it is referred to by Holmes as 'Egria'.",
    "section_context":"Cheb ([ˈxɛp] (listen); German: Eger) is a town in the Karlovy Vary Region of the Czech Republic, with about 32,000 inhabitants. It is on the river Ohře, at the foot of the Smrčiny near the border with Germany. Before the 1945 expulsion of the German speaking population, the town was the centre of the German-speaking region known as Egerland, part of the Northern Austro-Bavarian dialect area.\nThe name of the town was in 1061 recorded as Egire; in 1179 it was known as Egra; from 1322 as Eger and the surrounding territory as Regio Egere and Provincia Egrensis; after the 14th century also as Cheb or Chba. From 1850 it was given the twin official names of Eger and Cheb.\nFrom 1938 to 1945 it was one of the municipalities in Sudetenland. In Arthur Conan Doyle’s Sherlock Holmes story \"A Scandal in Bohemia\", it is referred to by Holmes as 'Egria'.",
    "description_length":26,
    "caption_length":26,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1048.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/20\/Sov%C3%ADnky%2C_old_barn.jpg",
    "page_title":"Sovínky",
    "section_title":null,
    "caption":"Old barn in Sovínky",
    "caption_attribution_description":"Čeština: Rekonstruovaná stodola v Sovínkách English: Old barn in Sovínky, Czech Republic",
    "description":"Old barn in Sovínky",
    "page_context":"Sovínky is a market town in Mladá Boleslav District in the Central Bohemian Region of the Czech Republic. It has about 300 inhabitants. It is located 10 kilometres southwest of Mladá Boleslav and 41 kilometres northeast of Prague.",
    "section_context":"Sovínky  is a market town in Mladá Boleslav District in the Central Bohemian Region of the Czech Republic. It has about 300 inhabitants. It is located 10 kilometres (6.2 mi) southwest of Mladá Boleslav and 41 kilometres (25 mi) northeast of Prague.",
    "description_length":19,
    "caption_length":19,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1123.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/e5\/Marsa-Esgl%C3%A9sia_de_Saint_Loup.JPG",
    "page_title":"Marsa, Aude",
    "section_title":null,
    "caption":"The church in Marsa",
    "caption_attribution_description":"Català: Església parroquial (Marsan) This building is indexed in the Base Mérimée, a database of architectural heritage maintained by the French Ministry of Culture,&#160;under the reference PA00102761 . беларуская (тарашкевіца)‎&#160;| বাংলা&#160;| brezhoneg&#160;| català&#160;| Deutsch&#160;| Ελληνικά&#160;| English&#160;| Esperanto&#160;| español&#160;| euskara&#160;| suomi&#160;| français&#160;| magyar&#160;| italiano&#160;| 日本語&#160;| македонски&#160;| Nederlands&#160;| português&#160;| português do Brasil&#160;| română&#160;| русский&#160;| sicilianu&#160;| svenska&#160;| українська&#160;| العربيَّة&#160;| +\/−",
    "description":"The church in Marsa",
    "page_context":"Marsa is a commune in the Aude department in southern France.",
    "section_context":"Marsa is a commune in the Aude department in southern France.",
    "description_length":19,
    "caption_length":19,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1133.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/bf\/Ubuntu_Feisty_Fawn_Firestarter.png",
    "page_title":"Firestarter (firewall)",
    "section_title":null,
    "caption":"Screenshot of the Firestarter window",
    "caption_attribution_description":"Firestarter firewall in Ubuntu Feisty Fawn.",
    "description":"Screenshot of the Firestarter window",
    "page_context":"Firestarter is a personal firewall tool that uses the Netfilter system built into the Linux kernel. It has the ability to control both inbound and outbound connections. Firestarter provides a graphical interface for configuring firewall rules and settings. It provides real-time monitoring of all network traffic for the system. Firestarter also provides facilities for port forwarding, internet connection sharing and DHCP service.\nFirestarter is free and open-source software and uses GUI widgets from GTK+.",
    "section_context":"Firestarter is a personal firewall tool that uses the Netfilter (iptables\/ipchains) system built into the Linux kernel. It has the ability to control both inbound and outbound connections. Firestarter provides a graphical interface for configuring firewall rules and settings. It provides real-time monitoring of all network traffic for the system. Firestarter also provides facilities for port forwarding, internet connection sharing and DHCP service.\nFirestarter is free and open-source software and uses GUI widgets from GTK+.",
    "description_length":36,
    "caption_length":36,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1212.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/2d\/Giorgio_Moroder_-_First_Avenue_Minneapolis_-_The_Current_%2844776142702%29.jpg",
    "page_title":"Giorgio Moroder",
    "section_title":null,
    "caption":"Moroder at First Avenue, Minneapolis, in 2018",
    "caption_attribution_description":"Giorgio Moroder - First Avenue Minneapolis - The Current",
    "description":"Moroder at First Avenue, Minneapolis, in 2018",
    "page_context":"Giovanni Giorgio Moroder is an Italian composer, songwriter, and record producer. Dubbed the \"Father of Disco\", Moroder is credited with pioneering Italo disco and electronic dance music, and his work with synthesizers heavily influenced several music genres such as new wave, house and techno music.\nWhen in Munich in the 1970s, Moroder started his own record label called Oasis Records, which several years later became a subdivision of Casablanca Records. He is the founder of the former Musicland Studios in Munich, a recording studio used by many artists including The Rolling Stones, Electric Light Orchestra, Led Zeppelin, Deep Purple, Queen and Elton John. He produced singles for Donna Summer during the mid-to-late 1970s disco era, including \"Love to Love You Baby\", \"I Feel Love\", \"Last Dance\", \"MacArthur Park\", \"Hot Stuff\", \"Bad Girls\", \"Dim All the Lights\", \"No More Tears\", and \"On the Radio\". During this period, he also released many albums, including the synthesizer-driven From Here To Eternity and E=MC², the first album to be entirely digitally recorded.",
    "section_context":"Giovanni Giorgio Moroder ([dʒoˈvanni ˈdʒordʒo moˈrɔːder], German: [mɔˈʁoːdɐ]; born 26 April 1940) is an Italian composer, songwriter, and record producer. Dubbed the \"Father of Disco\", Moroder is credited with pioneering Italo disco and electronic dance music, and his work with synthesizers heavily influenced several music genres such as new wave, house and techno music.\nWhen in Munich in the 1970s, Moroder started his own record label called Oasis Records, which several years later became a subdivision of Casablanca Records. He is the founder of the former Musicland Studios in Munich, a recording studio used by many artists including The Rolling Stones, Electric Light Orchestra, Led Zeppelin, Deep Purple, Queen and Elton John. He produced singles for Donna Summer during the mid-to-late 1970s disco era, including \"Love to Love You Baby\", \"I Feel Love\", \"Last Dance\", \"MacArthur Park\", \"Hot Stuff\", \"Bad Girls\", \"Dim All the Lights\", \"No More Tears (Enough Is Enough)\", and \"On the Radio\". During this period, he also released many albums, including the synthesizer-driven From Here To Eternity (1977) and E=MC² (1979), the first album to be entirely digitally recorded.\nHe later began composing film soundtracks and scores, including Midnight Express, American Gigolo, Superman III, Scarface, The NeverEnding Story, and the 1984 restoration of Metropolis. The soundtrack for the film Midnight Express, which contained the international hit \"Chase\", won an Academy Award and a Golden Globe. He also produced a number of electronic disco songs for the Three Degrees, two albums for Sparks, and a handful of songs on Bonnie Tyler's album Bitterblue as well as her 1985 single \"Here She Comes\". In 1990, he composed \"Un'estate italiana\", the official theme song of the 1990 FIFA World Cup.\nHe has created a score of songs for many performers including David Bowie, Kylie Minogue, Irene Cara, Janet Jackson, Madleen Kane, Melissa Manchester, Blondie, Japan and France Joli. Moroder has stated that the work of which he is most proud is Berlin's \"Take My Breath Away\", which earned him two Golden Globes (for Best Original Score and Best Original Song) and the Academy Award for Best Original Song in 1986; he had earned the same awards in 1983 for \"Flashdance... What a Feeling\". In addition to the three Academy Awards and four Golden Globes, Moroder has also received four Grammy Awards, two People's Choice Awards, and more than 100 Golden and Platinum discs. In 2004, he was inducted into the Dance Music Hall of Fame.",
    "description_length":45,
    "caption_length":45,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1006.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c8\/Spheric_Universe_Experience_-_French_Prog_Metal_Band.jpg",
    "page_title":"Spheric Universe Experience",
    "section_title":null,
    "caption":"Spheric Universe Experience - during the essence of progression tour in 2009",
    "caption_attribution_description":"English: Picture of Spheric Universe Experience, french prog metal band, during the essence of progression tour in 2009 Piemontèis: Photo de Spheric Universe Experience, groupe français de metal prog, lors de la tournée Essence of Progression en 2009",
    "description":"Spheric Universe Experience - during the essence of progression tour in 2009",
    "page_context":"Spheric Universe Experience is a band from France formed in 1999 which employ progressive metal with symphonic elements.",
    "section_context":"Spheric Universe Experience is a band from France formed in 1999 which employ progressive metal with symphonic elements.",
    "description_length":76,
    "caption_length":76,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1157.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/06\/Blackwater_City_Hall.jpg",
    "page_title":"Blackwater, Missouri",
    "section_title":null,
    "caption":"Blackwater City Hall",
    "caption_attribution_description":"Blackwater City Hall",
    "description":"Blackwater City Hall",
    "page_context":"Blackwater is a city in northwest Cooper County, Missouri, United States located along the Blackwater River, from which it takes its name. The population was 162 at the 2010 census.\nMany parts of Blackwater's commercial and residential districts are listed on the National Register of Historic Places.",
    "section_context":"Blackwater is a city in northwest Cooper County, Missouri, United States located along the Blackwater River, from which it takes its name. The population was 162 at the 2010 census.\nMany parts of Blackwater's commercial and residential districts are listed on the National Register of Historic Places.",
    "description_length":20,
    "caption_length":20,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1118.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/0c\/Lodi_Arch_2.jpg",
    "page_title":"Lodi, California",
    "section_title":null,
    "caption":"Lodi Arch",
    "caption_attribution_description":"English: Lodi Arch View looking east (from downtown) This is an image of a place or building that is listed on the National Register of Historic Places in the United States of America. Its reference number is 80000848 This is a photo of a place or building that is listed on the California Historical Landmark listing in the United States. Its reference number is 931.",
    "description":"Lodi Arch",
    "page_context":"Lodi is a city located in San Joaquin County, California, in the center portion of California's Central Valley. The population was 62,134 at the 2010 census. The estimated population is approximately 67,586 according to 2019 census data. Lodi is the 132nd largest city in California based on official 2019 estimates from the US Census Bureau.\nLodi is best known for winegrape production although its vintages have traditionally been less prestigious than those of Sonoma and Napa counties. However, in recent years, the Lodi Appellation has become increasingly respected for its Zinfandel and other eclectic wine varietals, along with its focus on sustainability under the Lodi Rules program. National recognition came from the Creedence Clearwater Revival song \"Lodi\" and continued with the \"2015 Wine Region of the Year\" award given to Lodi by Wine Enthusiast Magazine.",
    "section_context":"Lodi (\/ˈloʊdaɪ\/ LOH-dye) is a city located in San Joaquin County, California, in the center portion of California's Central Valley. The population was 62,134 at the 2010 census. The estimated population is approximately 67,586 according to 2019 census data. Lodi is the 132nd largest city in California based on official 2019 estimates from the US Census Bureau.\nLodi is best known for winegrape production although its vintages have traditionally been less prestigious than those of Sonoma and Napa counties. However, in recent years, the Lodi Appellation has become increasingly respected for its Zinfandel and other eclectic wine varietals, along with its focus on sustainability under the Lodi Rules program.  National recognition came from the Creedence Clearwater Revival song \"Lodi\" and continued with the \"2015 Wine Region of the Year\" award given to Lodi by Wine Enthusiast Magazine.",
    "description_length":9,
    "caption_length":9,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1201.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/e9\/Iain_Cook_of_Chvrches_performing_in_Austin%2C_Texas%2C_2014.jpg",
    "page_title":"Iain Cook",
    "section_title":null,
    "caption":"Iain Cook performing with Chvrches in 2014",
    "caption_attribution_description":"English: Iain Cook of Chvrches performing at the Austin City Limits Music Festival in Austin, Texas, 2014-10-10.",
    "description":"Iain Cook performing with Chvrches in 2014",
    "page_context":"Iain Andrew Cook is a Scottish musician, composer, record producer and member of Glasgow-based electronic trio Chvrches. He played guitar for the Scottish post-rock band Aereogramme until their breakup in 2007. Cook also composes music for film and television and is a member of the rock band The Unwinding Hours.",
    "section_context":"Iain Andrew Cook (born 2 November 1974) is a Scottish musician, composer, record producer and member of Glasgow-based electronic trio Chvrches. He played guitar for the Scottish post-rock band Aereogramme until their breakup in 2007. Cook also composes music for film and television and is a member of the rock band The Unwinding Hours.",
    "description_length":42,
    "caption_length":42,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1036.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/58\/Panorama_Saint-Julia_%28Haute_Garonne%29.jpg",
    "page_title":"Saint-Julia",
    "section_title":null,
    "caption":"A general view of Saint-Julia",
    "caption_attribution_description":"English&#x3a;&#32; Saint-Julia, Haute-Garonne, France. View from St Felix de Lauragais.Français&#x202f;&#x3a;&#32; Saint-Julia, Haute-Garonne, France. Vue de St Felix de Lauragais.",
    "description":"A general view of Saint-Julia",
    "page_context":"Saint-Julia is a commune in the Haute-Garonne department in southwestern France.",
    "section_context":"Saint-Julia is a commune in the Haute-Garonne department in southwestern France.",
    "description_length":29,
    "caption_length":29,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1215.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/1\/18\/Wilka_%28014%29.jpg",
    "page_title":"Wilka",
    "section_title":null,
    "caption":"Road with houses",
    "caption_attribution_description":"Polski: Wilka. Polska.",
    "description":"Road with houses",
    "page_context":"Wilka is a village in the administrative district of Gmina Sulików, within Zgorzelec County, Lower Silesian Voivodeship, in south-western Poland, close to the Czech border.\nIt lies approximately 6 kilometres south-west of Sulików, 13 kilometres south of Zgorzelec, and 142 kilometres west of the regional capital Wrocław.",
    "section_context":"Wilka [ˈvilka] is a village in the administrative district of Gmina Sulików, within Zgorzelec County, Lower Silesian Voivodeship, in south-western Poland, close to the Czech border.\nIt lies approximately 6 kilometres (4 mi) south-west of Sulików, 13 kilometres (8 mi) south of Zgorzelec, and 142 kilometres (88 mi) west of the regional capital Wrocław.",
    "description_length":16,
    "caption_length":16,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1146.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/67\/Uettingen_im_Winter.jpg",
    "page_title":"Uettingen",
    "section_title":null,
    "caption":"Uettingen in winter",
    "caption_attribution_description":null,
    "description":"Uettingen in winter",
    "page_context":"Uettingen is a municipality in the district of Würzburg in Bavaria, Germany.",
    "section_context":"Uettingen is a municipality in the district of Würzburg in Bavaria, Germany.",
    "description_length":19,
    "caption_length":19,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1120.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/45\/Madingley_Hall_front_elevation_Aug_2013.jpg",
    "page_title":"Institute of Continuing Education",
    "section_title":null,
    "caption":"The Institute's headquarters at Madingley Hall",
    "caption_attribution_description":"English: Madingley Court front elevation Aug 2013This is a photo of listed building number 1163528.",
    "description":"The Institute's headquarters at Madingley Hall",
    "page_context":"The Institute of Continuing Education is a constituent part of the University of Cambridge, dedicated to providing and promoting continuing education. It is primarily based at Madingley Hall in the village of Madingley, near Cambridge, England. The institute has its origins in a series of lectures given by James Stuart in 1867.",
    "section_context":"The Institute of Continuing Education (ICE) is a constituent part of the University of Cambridge, dedicated to providing and promoting continuing education.  It is primarily based at Madingley Hall in the village of Madingley, near Cambridge, England. The institute has its origins in a series of lectures given by James Stuart in 1867.",
    "description_length":46,
    "caption_length":46,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1083.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/09\/Remoray-Boujeons_%C3%A9glise_de_Boujeons.jpg",
    "page_title":"Remoray-Boujeons",
    "section_title":null,
    "caption":"The church in Boujeons",
    "caption_attribution_description":"Français&#160;: Auteur: Utilisateur:Suaudeau Description: Vue de l'église du hameaux Boujeons de la commune de Remoray-Boujeons.",
    "description":"The church in Boujeons",
    "page_context":"Remoray-Boujeons is a commune in the Doubs department in the Bourgogne-Franche-Comté region in eastern France.",
    "section_context":"Remoray-Boujeons is a commune in the Doubs department in the Bourgogne-Franche-Comté region in eastern France.",
    "description_length":22,
    "caption_length":22,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1126.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/38\/Nice_house_in_ramot_naftali.jpg",
    "page_title":"Ramot Naftali",
    "section_title":null,
    "caption":"A house in Ramot Naftali with the Hula Valley in the background",
    "caption_attribution_description":"English: A picture of a nice house in Ramot Naftali with the Hula valley in the background.",
    "description":"A house in Ramot Naftali with the Hula Valley in the background",
    "page_context":"Ramot Naftali is a moshav in northern Israel. Located in the Upper Galilee near the Lebanese border, it falls under the jurisdiction of Mevo'ot HaHermon Regional Council. In 2018 it had a population of 556.\nThe community is named \"Ramot Naftali\" because it is located in the mountains of Naftali, which was originally in the land owned by the Tribe of Naphtali.",
    "section_context":"Ramot Naftali (Hebrew: רָמוֹת נַפְתָּלִי) is a moshav in northern Israel. Located in the Upper Galilee near the Lebanese border, it falls under the jurisdiction of Mevo'ot HaHermon Regional Council. In 2018 it had a population of 556.\nThe community is named \"Ramot Naftali\" (hills of Naftali) because it is located in the mountains of Naftali, which was originally in the land owned by the Tribe of Naphtali.",
    "description_length":63,
    "caption_length":63,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1064.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/23\/Castello_di_Monte_San_Giovanni_Campano_9.JPG",
    "page_title":"Monte San Giovanni Campano",
    "section_title":null,
    "caption":"The Castle.",
    "caption_attribution_description":"Italiano: Castello di Monte San Giovanni Campano",
    "description":"The Castle.",
    "page_context":"Monte San Giovanni Campano is a comune of about 12,800 inhabitants in the province of Frosinone in the Italian region Lazio, located about 90 kilometres southeast of Rome and about 14 kilometres east of Frosinone. Monte San Giovanni Campano is in the Latin Valley\nIt is best known as the place where Thomas Aquinas was imprisoned by his family for two years. St. Thomas' cell now houses a 16th-century triptych of the Neapolitan School.\nMonte San Giovanni is home to an 11th-century fortress, the Castello di Monte San Giovanni Campano. It was the first western fortification ever to be breached and captured using a bombardment from portable field artillery, when its castle was stormed by the troops of Charles VIII of France in a mere eight hours in 1495.\nMonte San Giovanni was also a summer residence of Pope Adrian IV starting in 1155, and where sojourned the poet Vittoria Colonna.",
    "section_context":"Monte San Giovanni Campano is a comune (municipality) of about 12,800 inhabitants in the province of Frosinone in the Italian region Lazio, located about 90 kilometres (56 mi) southeast of Rome and about 14 kilometres (9 mi) east of Frosinone. Monte San Giovanni Campano is in the Latin Valley\nIt is best known as the place where Thomas Aquinas was imprisoned by his family for two years. St. Thomas' cell now houses a 16th-century triptych of the Neapolitan School.\nMonte San Giovanni is home to an 11th-century fortress, the Castello di Monte San Giovanni Campano.  It was the first western fortification ever to be breached and captured using a bombardment from portable field artillery, when its castle was stormed by the troops of Charles VIII of France in a mere eight hours in 1495.\nMonte San Giovanni was also a summer residence of Pope Adrian IV starting in 1155, and where sojourned the poet Vittoria Colonna.",
    "description_length":11,
    "caption_length":11,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1110.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/96\/FranceNormandieOrvalEglise.jpg",
    "page_title":"Orval-sur-Sienne",
    "section_title":null,
    "caption":"The church in Orval-sur-Sienne",
    "caption_attribution_description":"Orval (Normandie, France). L'église Sainte-Hélène.",
    "description":"The church in Orval-sur-Sienne",
    "page_context":"Orval-sur-Sienne is a commune in the department of Manche, northwestern France. The municipality was established on 1 January 2016 by merger of the former communes of Montchaton and Orval.",
    "section_context":"Orval-sur-Sienne is a commune in the department of Manche, northwestern France. The municipality was established on 1 January 2016 by merger of the former communes of Montchaton and Orval.",
    "description_length":30,
    "caption_length":30,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1103.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/af\/The_Alameda_1.2.jpg",
    "page_title":"The Alameda, San Jose",
    "section_title":null,
    "caption":"The Alameda's tree-lined shopping street.",
    "caption_attribution_description":"English: The alameda in San Jose, California",
    "description":"The Alameda's tree-lined shopping street.",
    "page_context":"The Alameda is an alameda and historic district in San Jose, California, west of Downtown San Jose.\nThe neighborhood is a stronghold of the California Democratic Party. It is located within California’s 28th State Assembly district, represented by Democrat Evan Low, and California’s 10th State Senate district, represented by Democrat Bob Wieckowski. It also lies in California’s 19th Congressional district, represented by Democrat Zoe Lofgren.",
    "section_context":"The Alameda is an alameda (Spanish for tree-lined street) and historic district in San Jose, California, west of Downtown San Jose.\nThe neighborhood is a stronghold of the California Democratic Party. It is located within California’s 28th State Assembly district, represented by Democrat Evan Low, and California’s 10th State Senate district, represented by Democrat Bob Wieckowski. It also lies in California’s 19th Congressional district, represented by Democrat Zoe Lofgren.",
    "description_length":41,
    "caption_length":41,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1113.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/cd\/Map_of_Montour_County%2C_Pennsylvania_Highlighting_Cooper_Township.PNG",
    "page_title":"Cooper Township, Montour County, Pennsylvania",
    "section_title":null,
    "caption":"Map of Montour County, Pennsylvania Highlighting Cooper Township",
    "caption_attribution_description":null,
    "description":"Map of Montour County, Pennsylvania Highlighting Cooper Township",
    "page_context":"Cooper Township is a township in Montour County, Pennsylvania, United States.",
    "section_context":"Cooper Township is a township in Montour County, Pennsylvania, United States.",
    "description_length":64,
    "caption_length":64,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1217.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/f2\/CalienteNV.jpg",
    "page_title":"Caliente, Nevada",
    "section_title":null,
    "caption":"The historic Caliente Railroad Depot",
    "caption_attribution_description":"English: The Caliente Railroad Depot — in Caliente, southern Nevada. The 1923 Mission Revival style train station and railway hotel was designed by John and Donald Parkinson for the Los Angeles and Salt Lake Railroad. On the National Register of Historic Places in Lincoln County. Français&#160;: L'ancienne gare de Caliente (Nevada).",
    "description":"The historic Caliente Railroad Depot",
    "page_context":"Caliente, formerly known as Culverwell and Calientes, is a city in Lincoln County, Nevada, United States. Its elevation is 4,300 feet. The population was 1,130 at the 2010 census, making it the least populated incorporated city in Nevada. The city's name originated from the nearby hot springs, as \"caliente\" is the Spanish word meaning \"hot\".",
    "section_context":"Caliente \/kæliˈɛnti\/, formerly known as Culverwell and Calientes, is a city in Lincoln County, Nevada, United States. Its elevation is 4,300 feet (1,300 m). The population was 1,130 at the 2010 census, making it the least populated incorporated city in Nevada. The city's name originated from the nearby hot springs, as \"caliente\" is the Spanish word meaning \"hot\".",
    "description_length":36,
    "caption_length":36,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1085.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/7\/74\/Doi_Lan-east_of_Thoeng3.JPG",
    "page_title":"Thoeng District",
    "section_title":null,
    "caption":"Doi Ian, roughly 12 km east of Thoeng",
    "caption_attribution_description":"English: Doi Ian, from Tap Tao, east of Thoeng ไทย: ดอยเอียน ทิวเขาผีปันน้ำ",
    "description":"Doi Ian, roughly 12 km east of Thoeng",
    "page_context":"Thoeng is a district in the eastern part of Chiang Rai Province, northern Thailand.",
    "section_context":"Thoeng (Thai: เทิง; IPA: [tʰɤ̄ːŋ]) is a district (amphoe) in the eastern part of Chiang Rai Province, northern Thailand.",
    "description_length":37,
    "caption_length":37,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"997.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/6c\/Alyona_Lanskaya%2C_ESC2013_press_conference_09_%28crop%29.jpg",
    "page_title":"Alyona Lanskaya",
    "section_title":null,
    "caption":"Alyona Lanskaya at a Eurovision Song Contest 2013 press conference",
    "caption_attribution_description":"English: Alyona Lanskaya at a press conference during the Eurovision Song Contest 2013&#160;in Malmö. (Help translate this text)",
    "description":"Alyona Lanskaya at a Eurovision Song Contest 2013 press conference",
    "page_context":"Alyona Lanskaya is a Belarusian singer. In 2011, she won the Slavianski Bazaar Contest in Vitebsk. Alyona represented Belarus in the Eurovision Song Contest 2013 in Malmö, Sweden with the song \"Solayoh\", qualifying from the semi-final of the competition and placing 16th in the final by scoring 48 points.",
    "section_context":"Alyona Lanskaya (Belarusian: Алена Ланская, Romanized: Alena Lanskaja; Russian: Алёна Ланская, Romanized: Alyona Lanskaya; born 7 September 1985) is a Belarusian singer. In 2011,  she won the Slavianski Bazaar Contest in Vitebsk. Alyona represented Belarus in the Eurovision Song Contest 2013 in Malmö, Sweden with the song \"Solayoh\", qualifying from the semi-final of the competition and placing 16th in the final by scoring 48 points.",
    "description_length":66,
    "caption_length":66,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1094.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/d1\/Ph_locator_samar_san_jose_de_buan.png",
    "page_title":"San Jose de Buan",
    "section_title":null,
    "caption":"Map of Samar with San Jose de Buan highlighted",
    "caption_attribution_description":"English: Map of Samar showing the location of San Jose de Buan",
    "description":"Map of Samar with San Jose de Buan highlighted",
    "page_context":"San Jose de Buan, officially the Municipality of San Jose de Buan, is a 4th class municipality in the province of Samar, Philippines. According to the 2015 census, it has a population of 7,769 people.\nSan Jose de Buan was a municipal district of Gandara from 1948 to 1960, and was converted into a municipality in 1969.",
    "section_context":"San Jose de Buan, officially the Municipality of San Jose de Buan (Waray: Bungto han San Jose de Buan; Tagalog: Bayan ng San Jose de Buan), is a 4th class municipality in the province of Samar, Philippines. According to the 2015 census, it has a population of 7,769 people.\nSan Jose de Buan was a municipal district of Gandara from 1948 to 1960, and was converted into a municipality in 1969.",
    "description_length":46,
    "caption_length":46,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1224.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8c\/Mameyes_Arriba%2C_Jayuya-04.jpg",
    "page_title":"Jayuya, Puerto Rico",
    "section_title":null,
    "caption":"Lush vegetation and mountains in Jayuya",
    "caption_attribution_description":"English: Unretouched image of the mountains of Jayuya",
    "description":"Lush vegetation and mountains in Jayuya",
    "page_context":"Jayuya is a municipality of Puerto Rico located in the mountainous center region of the island, north of Ponce; east of Utuado; and west of Ciales. Jayuya is spread over 10 wards called barrios, and Jayuya Pueblo. It is the principal city of the Jayuya Micropolitan Statistical Area.\nNamed after the Taíno tribal leader, Hayuya, Jayuya is known for its skilled wood carvers. Among its monuments are the statue of Nemesio Canales and the bust of Hayuya, both by the Puerto Rican sculptor Tomás Batista.",
    "section_context":"Jayuya ([xaˈʝuʝa]) is a municipality of Puerto Rico (U.S.) located in the mountainous center region of the island, north of Ponce; east of Utuado; and west of Ciales. Jayuya is spread over 10 wards called barrios, and Jayuya Pueblo (the downtown and administrative center of the city). It is the principal city of the Jayuya Micropolitan Statistical Area.\nNamed after the Taíno tribal leader, Hayuya, Jayuya is known for its skilled wood carvers. Among its monuments are the statue of Nemesio Canales and the bust of Hayuya, both by the Puerto Rican sculptor Tomás Batista.",
    "description_length":39,
    "caption_length":39,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1180.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/1\/15\/Rychnovek_from_air_1.jpg",
    "page_title":"Rychnovek",
    "section_title":null,
    "caption":"Aerial view",
    "caption_attribution_description":"English: Villages Zvole and Rychnovek from air, eastern Bohemia, Czech Republic Čeština: Letecký pohled na vesnice Zvole a Rychnovek, východní Čechy",
    "description":"Aerial view",
    "page_context":"Rychnovek is a village and municipality in Náchod District in the Hradec Králové Region of the Czech Republic.",
    "section_context":"Rychnovek (German: Reichenhof) is a village and municipality in Náchod District in the Hradec Králové Region of the Czech Republic.",
    "description_length":11,
    "caption_length":11,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1045.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/ef\/Bucsani_jud_Dambovita.png",
    "page_title":"Bucșani, Dâmbovița",
    "section_title":null,
    "caption":"Location in Dâmbovița County",
    "caption_attribution_description":"English: Locator map of Bucșani Commune in Dâmbovița County, Romania",
    "description":"Location in Dâmbovița County",
    "page_context":"Bucșani is a commune in Dâmbovița County, Muntenia, Romania. It is composed of four villages: Bucșani, Hăbeni, Racovița and Rățoaia.",
    "section_context":"Bucșani is a commune in Dâmbovița County, Muntenia, Romania. It is composed of four villages: Bucșani, Hăbeni, Racovița and Rățoaia.",
    "description_length":28,
    "caption_length":28,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1030.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/a6\/Abdulla_bin_Zaid_Al_Mahmoud_Islamic_Cultural_Centre_seen_from_Corniche_Promenade.jpg",
    "page_title":"Al Souq (Doha)",
    "section_title":null,
    "caption":"The Qatar Central Bank (center, left) and Abdulla Bin Zaid Al Mahmoud Islamic Cultural Center (center, right) as seen from the Doha Corniche promenade.",
    "caption_attribution_description":"English: Abdulla bin Zaid Al Mahmoud Islamic Cultural Centre (Spiral Mosque, Fanar Mosque) from Corniche promenade. Doha, Qatar.",
    "description":"The Qatar Central Bank (center, left) and Abdulla Bin Zaid Al Mahmoud Islamic Cultural Center (center, right) as seen from the Doha Corniche promenade.",
    "page_context":"Al Souq is a commercial district in Qatar, located in the municipality of Doha. It was named for its high density of souqs in the southern section of the district.\nAbdullah bin Jassim Street services numerous government buildings and banks in the northern end of the district, including Abdulla Bin Zaid Al Mahmoud Islamic Cultural Center, Qatar Central Bank, the Ministry of Economy and Finance, and the Supreme Council for Economic Affairs and Investment. All of the district's souqs are located south of Abdullah bin Jassim Street. Its souqs include Souq Al Badi, Souq Al Faleh, Souq Al Asiery, Souq Al Dira, and Souq Al Jaber.\nDoha's largest souq, Souq Waqif, is located to the immediate west of the district in Al Jasrah, which is separated from Al Souq by Grand Hamad Street.",
    "section_context":"Al Souq (Arabic: اسوق‎, romanized: As Sūq; also spelled As Sawq) is a commercial district in Qatar, located in the municipality of Doha. It was named for its high density of souqs (markets) in the southern section of the district.\nAbdullah bin Jassim Street services numerous government buildings and banks in the northern end of the district, including Abdulla Bin Zaid Al Mahmoud Islamic Cultural Center, Qatar Central Bank, the Ministry of Economy and Finance, and the Supreme Council for Economic Affairs and Investment. All of the district's souqs are located south of Abdullah bin Jassim Street. Its souqs include Souq Al Badi, Souq Al Faleh, Souq Al Asiery, Souq Al Dira, and Souq Al Jaber.\nDoha's largest souq, Souq Waqif, is located to the immediate west of the district in Al Jasrah, which is separated from Al Souq by Grand Hamad Street.",
    "description_length":151,
    "caption_length":151,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1100.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/f6\/Administrative_Division_Tongren.png",
    "page_title":"Shiqian County",
    "section_title":null,
    "caption":"Shiqian is the division located at the southwest corner of this map of Tongren",
    "caption_attribution_description":"English: administrative division of Tongren City, Guizhou, China",
    "description":"Shiqian is the division located at the southwest corner of this map of Tongren",
    "page_context":"Shiqian County is a county under the administration of the prefecture-level city of Tongren, in the northeast of Guizhou Province, China.\nArea: 2,172 km².\nPopulation: 370,000 in 2002.\nPostal Code: 555100.\nThe government is located in Tangshan town.",
    "section_context":"Shiqian County (simplified Chinese: 石阡县; traditional Chinese: 石阡縣; pinyin: Shíqiān Xiàn) is a county under the administration of the prefecture-level city of Tongren, in the northeast of Guizhou Province, China.\nArea: 2,172 km² (839 sq mi).\nPopulation: 370,000 in 2002.\nPostal Code: 555100.\nThe government is located in Tangshan town.",
    "description_length":78,
    "caption_length":78,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1096.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/5d\/Bernard_Fowler_2019_Image.jpg",
    "page_title":"Bernard Fowler",
    "section_title":null,
    "caption":"Bernard Fowler publicity photo, 2019",
    "caption_attribution_description":"English: Bernard Fowler promoting his new album, Inside Out",
    "description":"Bernard Fowler publicity photo, 2019",
    "page_context":"Bernard Fowler is an American musician. He is known for a long association with The Rolling Stones, providing backing vocals since 1989 and on their studio recordings and live tours. Fowler has been a featured guest vocalist on the majority of solo albums released by the members of that band. He has released two solo album, and He has also been a regular featured singer on other musicians' recordings and tours. Fowler has toured and recorded with the bands Tackhead and Bad Dog and occasionally with Nicklebag and Little Axe.",
    "section_context":"Bernard Fowler (born January 2, 1960) is an American musician. He is known for a long association with The Rolling Stones, providing backing vocals since 1989 and on their studio recordings and live tours. Fowler has been a featured guest vocalist on the majority of solo albums released by the members of that band. He has released two solo album,  and He has also been a regular featured singer on other musicians' recordings and tours. Fowler has toured and recorded with the bands Tackhead and Bad Dog and occasionally with Nicklebag and Little Axe.",
    "description_length":36,
    "caption_length":36,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1077.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/e7\/%C3%85re_kabinbana.JPG",
    "page_title":"Åre ski resort",
    "section_title":null,
    "caption":"Cable Car in April 2007",
    "caption_attribution_description":"English: Åre kabinbana.",
    "description":"Cable Car in April 2007",
    "page_context":"Åre is a ski resort in Jämtland, Sweden, founded 111 years ago in 1909 and owned by SkiStar AB.\nÅre, short for Årefjällen, is located in Åre Municipality, just outside and above the village of Åre, approximately 80 km from the city of Östersund. The ski lift system is on the Åreskutan mountain, with a summit elevation of 1,420 m, which is not lift-served, but is reachable by snowmobile. The lift-served vertical drop is 870 m, descending from 1,260 m.\nThe village and ski area are accessible by bus and train, and the nearest airport is Åre Östersund Airport. With a latitude of 63.4° north, the ski area is approximately 350 km south of the Arctic Circle.",
    "section_context":"Åre (pronounced like 'Aura') is a ski resort in Jämtland, Sweden, founded 111 years ago in 1909 and owned by SkiStar AB.\nÅre, short for Årefjällen (Åre Mountains), is located in Åre Municipality, just outside and above the village of Åre, approximately 80 km (50 mi.) from the city of Östersund. The ski lift system is on the Åreskutan mountain, with a summit elevation of 1,420 m (4,660 ft), which is not lift-served, but is reachable by snowmobile. The lift-served vertical drop is 870 m (2,850 ft), descending from 1,260 m (4,130 ft).\nThe village and ski area are accessible by bus and train, and the nearest airport is Åre Östersund Airport. With a latitude of 63.4° north, the ski area is approximately 350 km (220 mi) south of the Arctic Circle.",
    "description_length":23,
    "caption_length":23,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1116.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/fc\/101_-_Mairie_-_Croix-Chapeau.jpg",
    "page_title":"Croix-Chapeau",
    "section_title":null,
    "caption":"Town hall",
    "caption_attribution_description":"Français&#160;: Mairie Croix-Chapeau Charente-Maritime France",
    "description":"Town hall",
    "page_context":"Croix-Chapeau is a commune in the Charente-Maritime department in southwestern France.",
    "section_context":"Croix-Chapeau is a commune in the Charente-Maritime department in southwestern France.",
    "description_length":9,
    "caption_length":9,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1013.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/ba\/LittleNicobarIslandMap.jpg",
    "page_title":"Pulopanja",
    "section_title":null,
    "caption":"Pulopanja is located in north-eastern region of the Little Nicobar Island",
    "caption_attribution_description":"Map of Little Nicobar Island",
    "description":"Pulopanja is located in north-eastern region of the Little Nicobar Island",
    "page_context":"Pulopanja is a village in the Nicobar district of Andaman and Nicobar Islands, India. It is on the Little Nicobar Island and is administered as part of the Great Nicobar tehsil. The village suffered severe damage during the 2004 Indian Ocean earthquake and tsunami.",
    "section_context":"Pulopanja is a village in the Nicobar district of Andaman and Nicobar Islands, India. It is on the Little Nicobar Island and is administered as part of the Great Nicobar tehsil. The village suffered severe damage during the 2004 Indian Ocean earthquake and tsunami.",
    "description_length":73,
    "caption_length":73,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1190.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/e4\/Fairfax%2C_Vermont_%2817129795518%29.jpg",
    "page_title":"Fairfax, Vermont",
    "section_title":null,
    "caption":"A house in Fairfax during winter",
    "caption_attribution_description":"Fairfax, Vermont Fairfax, Vermont",
    "description":"A house in Fairfax during winter",
    "page_context":"Fairfax is a town in Franklin County, Vermont, United States. The population was 4,285 at the 2010 census, up from 3,765 at the 2000 census.",
    "section_context":"Fairfax is a town in Franklin County, Vermont, United States. The population was 4,285 at the 2010 census, up from 3,765 at the 2000 census.",
    "description_length":32,
    "caption_length":32,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1209.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/7\/7b\/Fa%C3%A7ade_de_l%27%C3%A9glise_Saint-Pierre_de_Fleury.jpg",
    "page_title":"Fleury, Somme",
    "section_title":null,
    "caption":"The church in Fleury",
    "caption_attribution_description":"Français&#160;: Façade de l'église Saint-Pierre de Fleury (Somme)",
    "description":"The church in Fleury",
    "page_context":"Fleury is a commune in the Somme department in Hauts-de-France in northern France.",
    "section_context":"Fleury is a commune in the Somme department in Hauts-de-France in northern France.",
    "description_length":20,
    "caption_length":20,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"996.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/04\/Rzepin_-_Ko%C5%9Bci%C3%B3%C5%82.jpg",
    "page_title":"Rzepin",
    "section_title":null,
    "caption":"Sacred Heart church in Rzepin",
    "caption_attribution_description":"English: Church in Rzepin (Poland). Polski: Kościół w Rzepinie.",
    "description":"Sacred Heart church in Rzepin",
    "page_context":"Rzepin is a town in western Poland. Situated in the Lubusz Voivodeship, in Słubice County it is a seat of the urban-rural Rzepin Gmina. From 1975 until 1998 the town, from an administrative point of view, belonged to the Gorzów Wielkopolski Voivodeship. As of 2019, the town had a population of 6,529 inhabitants.",
    "section_context":"Rzepin [ˈʐɛpʲin] (German: Reppen) is a town in western Poland. Situated in the Lubusz Voivodeship (since 1999), in Słubice County it is a seat of the urban-rural Rzepin Gmina. From 1975 until 1998 the town, from an administrative point of view, belonged to the Gorzów Wielkopolski Voivodeship. As of 2019, the town had a population of 6,529 inhabitants.",
    "description_length":29,
    "caption_length":29,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1220.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8f\/WOODSTOCK_VILLAGE_HISTORIC_DISTRICT.jpg",
    "page_title":"Woodstock (village), Vermont",
    "section_title":null,
    "caption":"General Lyman Mower House on the Green",
    "caption_attribution_description":"English: 1823 GENERAL LYMAN MOWER HOUSE WHICH IS LOCATED ON THE GREEN WHICH IS THE DIRECT CENTER OF THE HISTORIC DISTRICT This is an image of a place or building that is listed on the National Register of Historic Places in the United States of America. Its reference number is 73000274",
    "description":"General Lyman Mower House on the Green",
    "page_context":"Woodstock is an incorporated village located within the town of Woodstock in Windsor County, Vermont, United States. As of the 2010 census, the village population was 900.",
    "section_context":"Woodstock is an incorporated village located within the town of Woodstock in Windsor County, Vermont, United States. As of the 2010 census, the village population was 900.",
    "description_length":38,
    "caption_length":38,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1112.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/05\/Kar%C3%A1d_l%C3%A1tk%C3%A9pe_a_sz%C5%91l%C5%91hegyr%C5%91l.jpg",
    "page_title":"Karád",
    "section_title":null,
    "caption":"View of the village from the vineyard hill",
    "caption_attribution_description":"Magyar: Karád látképe a szőlőhegyről Español: Vista del pueblo Karád (Hungría)",
    "description":"View of the village from the vineyard hill",
    "page_context":"Karád is a village in Somogy county, Hungary.\nThe settlement is part of the Balatonboglár wine region.",
    "section_context":"Karád (Croatian: Karadin) is a village in Somogy county, Hungary.\nThe settlement is part of the Balatonboglár wine region.",
    "description_length":42,
    "caption_length":42,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"993.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/22\/%C3%87anakkale_districts.png",
    "page_title":"Bayramiç",
    "section_title":null,
    "caption":"Location of Bayramiç within Turkey.",
    "caption_attribution_description":"Map of the districts of Canakkale province in Turkey. Created by Rarelibra 19:28, 1 December 2006 (UTC) for public domain use, using MapInfo Professional v8.5 and various mapping resources. Edited by One Homo Sapiens Corrected text where İ,Ş,ı,ğ,or ş occurs in name. Source: [statoids-com]. Increased font size and enhanced color differences among adjacent districts.",
    "description":"Location of Bayramiç within Turkey.",
    "page_context":"Bayramiç is a town and district of Çanakkale Province in the Marmara region of Turkey. According to the 2000 census, population of the district is 32,314 of which 13,420 live in the town of Bayramiç. The district covers an area of 1,284 km², and the town lies at an elevation of 107 m.",
    "section_context":"Bayramiç is a town and district of Çanakkale Province in the Marmara region of Turkey. According to the 2000 census, population of the district is 32,314 of which 13,420 live in the town of Bayramiç. The district covers an area of 1,284 km² (496 sq mi), and the town lies at an elevation of 107 m (351 ft).",
    "description_length":35,
    "caption_length":35,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1109.jpg"
  }
]