[
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/6e\/Stanford%2C_California%2C_United_States_Post_Office%2C_March_2019.jpg",
    "page_title":"Stanford, California",
    "section_title":null,
    "caption":"Stanford post office",
    "caption_attribution_description":"English: The photograph is of the front exterior of the Stanford Post Office as viewed from the southwest. Photograph taken on 2019-03-15T20:43:14Z.",
    "description":"Stanford post office",
    "page_context":"Stanford is a census-designated place in the northwest corner of Santa Clara County, California, United States and is the home of Stanford University. The population was 13,809 at the 2010 census, with a daily population of 35,000.\nStanford is an unincorporated area of Santa Clara County and is adjacent to the city of Palo Alto.\nMost of the Stanford University campus and other core University owned land is situated within the census-designated place of Stanford though the Stanford University Medical Center, the Stanford Shopping Center, and the Stanford Research Park are officially part of the city of Palo Alto. Its resident population consists of the inhabitants of on-campus housing, including graduate student residences and single-family homes and condominiums owned by their faculty inhabitants but located on leased Stanford land. A residential neighborhood adjacent to the Stanford campus, College Terrace, featuring streets named after universities and colleges, is neither part of the Stanford CDP nor owned by the University but is instead part of Palo Alto.",
    "section_context":"Stanford is a census-designated place (CDP) in the northwest corner of Santa Clara County, California, United States and is the home of Stanford University. The population was 13,809 at the 2010 census, with a daily population of 35,000.\nStanford is an unincorporated area of Santa Clara County and is adjacent to the city of Palo Alto.\nMost of the Stanford University campus and other core University owned land is situated within the census-designated place of Stanford though the Stanford University Medical Center, the Stanford Shopping Center, and the Stanford Research Park are officially part of the city of Palo Alto. Its resident population consists of the inhabitants of on-campus housing, including graduate student residences and single-family homes and condominiums owned by their faculty inhabitants but located on leased Stanford land.  A residential neighborhood adjacent to the Stanford campus, College Terrace, featuring streets named after universities and colleges, is neither part of the Stanford CDP nor owned by the University (except for a few individual houses) but is instead part of Palo Alto.",
    "description_length":20,
    "caption_length":20,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1155.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/be\/Edward_Brooke-Hitching.jpg",
    "page_title":"Edward Brooke-Hitching",
    "section_title":null,
    "caption":"Edward Brooke-Hitching",
    "caption_attribution_description":"English: Edward Brooke-Hitching",
    "description":"Edward Brooke-Hitching",
    "page_context":"Edward Brooke-Hitching is an English author, and a writer and researcher for the BBC panel show QI, as a member of the team known as the \"QI Elves\". He is the son of the rare book dealer Franklin Brooke-Hitching and a descendant of the printer and bibliographer William Blades, who wrote the history of book preservation The Enemies of Books.\nHis Fox Tossing, Octopus Wrestling and Other Forgotten Sports described 90 obsolete pastimes and The Spectator's reviewer said \"A book like this, the result of enormously diligent library ferreting, doesn't have any pressing reason to exist, but I am glad it does. Its pointlessness is its pleasure.\" It described sports including fox tossing, octopus wrestling and ski ballet. His The Phantom Atlas describes places which appear on maps but do not exist: the Times reviewer says that it \"shows how places that aren’t there can endure, sometimes for centuries, once a map-maker has inked them in\". The Sky Atlas was shortlisted for the 2019 Edward Stanford Travel Writing Awards in the \"Illustrated travel book\" category and picked as one of the 50 Christmas books of the year by The Herald.",
    "section_context":"Edward Brooke-Hitching is an English author, and a writer and researcher for the BBC panel show QI, as a member of the team known as the \"QI Elves\". He is the son of the rare book dealer Franklin Brooke-Hitching and a descendant of the printer and bibliographer William Blades, who wrote the history of book preservation The Enemies of Books.\nHis Fox Tossing, Octopus Wrestling and Other Forgotten Sports described 90 obsolete pastimes and  The Spectator's reviewer said \"A book like this, the result of enormously diligent library ferreting, doesn't have any pressing reason to exist, but I am glad it does. Its pointlessness is its pleasure.\" It described sports including fox tossing, octopus wrestling and ski ballet. His The Phantom Atlas describes places which appear on maps but do not exist: the Times reviewer says that it \"shows how places that aren’t there can endure, sometimes for centuries, once a map-maker has inked them in\".  The Sky Atlas was shortlisted for the 2019 Edward Stanford Travel Writing Awards in the \"Illustrated travel book\" category and picked as one of the 50 Christmas books of the year by The Herald.\nIn 2007 he directed a short documentary about the Edinburgh-based Really Terrible Orchestra. \nHe appeared on BBC Radio 4's The Museum of Curiosity in October 2019. His hypothetical donation to this imaginary museum was \"A land grant for 60 acres of land in Poyais\", being a document produced by 1820s fraudster Gregor MacGregor.",
    "description_length":22,
    "caption_length":22,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1047.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/35\/Hilham-SR85-tn.jpg",
    "page_title":"Hilham, Tennessee",
    "section_title":null,
    "caption":"SR 85 (Hilham Highway) in Hilham",
    "caption_attribution_description":"English: Tennessee State Route 85 (Hilham Highway), looking west toward its intersection with State Route 136, in Hilham, Tennessee, United States.",
    "description":"SR 85 (Hilham Highway) in Hilham",
    "page_context":"Hilham is an unincorporated community in Overton County, Tennessee. The community is situated around the junction of Tennessee State Route 136 and Tennessee State Route 85. Although not a census-designated place, Hilham is part of a Zip Code Tabulation Area that covers most of rural northwest Overton County and part of northeast Jackson County. As of the 2000 census, the population of this entire area was less than 2000.\nHilham was established in 1797 by Dartmouth graduate Moses Fisk, who believed the site was the geographic center of the United States. Fisk platted Hilham so that roads radiated out from the center of the community to the north, south, east and west, believing that Hilham would eventually be the ultimate crossroads of the new nation. In 1806, Fisk established one of the first female academies in the southeast at Hilham.\nThe 11,000-acre Standing Stone State Park and Forest is located 5 miles north of Hilham along State Route 136.",
    "section_context":"Hilham is an unincorporated community in Overton County, Tennessee. The community is situated around the junction of Tennessee State Route 136 (which runs north-to-south) and Tennessee State Route 85 (which runs east-to-west). Although not a census-designated place, Hilham is part of a Zip Code Tabulation Area (38568) that covers most of rural northwest Overton County and part of northeast Jackson County. As of the 2000 census, the population of this entire area was less than 2000.\nHilham was established in 1797 by Dartmouth graduate Moses Fisk (1759-1840), who believed the site was the geographic center of the United States (at the time, the Mississippi River was still the nation's western boundary). Fisk platted Hilham so that roads radiated out from the center of the community to the north, south, east and west, believing that Hilham would eventually be the ultimate crossroads of the new nation. In 1806, Fisk established one of the first female academies in the southeast at Hilham.\nThe 11,000-acre (45 km²) Standing Stone State Park and Forest is located 5 miles (8.0 km) north of Hilham along State Route 136.",
    "description_length":32,
    "caption_length":32,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"987.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/08\/Furnas_County_Courthouse_from_S.JPG",
    "page_title":"Beaver City, Nebraska",
    "section_title":null,
    "caption":"Furnas County courthouse",
    "caption_attribution_description":"English: Furnas County courthouse in Beaver City, Nebraska; seen from the south. The building was constructed in 1949.",
    "description":"Furnas County courthouse",
    "page_context":"Beaver City is a city in Furnas County, on the southern border of Nebraska, United States. The population was 609 at the 2010 census. It is the county seat of Furnas County.",
    "section_context":"Beaver City is a city in Furnas County, on the southern border of Nebraska, United States. The population was 609 at the 2010 census. It is the county seat of Furnas County.",
    "description_length":24,
    "caption_length":24,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1023.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/9a\/Cucurrumacho-Navalosa.jpg",
    "page_title":"Navalosa",
    "section_title":null,
    "caption":"Cucurrumacho, character of the carnival in Navalosa, Ávila, Spain",
    "caption_attribution_description":"Español: Estatua del Cucurumacho, personaje del Carnaval de Navalosa, Ávila, España English: Cucurrumacho, character of the carnival in Navalosa, Ávila, Spain",
    "description":"Cucurrumacho, character of the carnival in Navalosa, Ávila, Spain",
    "page_context":"Navalosa is a municipality located in the province of Ávila, Castile and León, Spain. According to the 2006 census, the municipality has a population of 433 inhabitants.",
    "section_context":"Navalosa is a municipality located in the province of Ávila, Castile and León, Spain. According to the 2006 census (INE), the municipality has a population of 433 inhabitants.",
    "description_length":65,
    "caption_length":65,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1049.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/39\/Orem_Utah_City_Center.jpeg",
    "page_title":"Orem, Utah",
    "section_title":null,
    "caption":"Orem City Center",
    "caption_attribution_description":"English: Orem City Center, Orem, Utah, United States.",
    "description":"Orem City Center",
    "page_context":"Orem is a city in Utah County, Utah, United States, in the northern part of the state. It is adjacent to Provo, Lindon, and Vineyard and is about 45 miles south of Salt Lake City. Orem is one of the principal cities of the Provo-Orem, Utah Metropolitan Statistical Area, which includes all of Utah and Juab counties. The 2019 population estimate was 97,828, while the 2010 population was 88,328 making it the fifth-largest city in Utah. Utah Valley University is located in Orem. The Orem Owlz of the minor league baseball Pioneer League play their home games at the college.\nOrem uses the slogan \"Family City USA.\" In 2010 Forbes rated it the 5th best place to raise a family. Time magazine rated the Provo-Orem area as the best place to live for spiritual well-being, due to a high population of members of The Church of Jesus Christ of Latter-day Saints.",
    "section_context":"Orem is a city in Utah County, Utah, United States, in the northern part of the state. It is adjacent to Provo, Lindon, and Vineyard and is about 45 miles (72 km) south of Salt Lake City. Orem is one of the principal cities of the Provo-Orem, Utah Metropolitan Statistical Area, which includes all of Utah and Juab counties.  The 2019 population estimate was 97,828, while the 2010 population was 88,328 making it the fifth-largest city in Utah. Utah Valley University is located in Orem. The Orem Owlz of the minor league baseball Pioneer League play their home games at the college.\nOrem uses the slogan \"Family City USA.\" In 2010 Forbes rated it the 5th best place to raise a family. Time magazine rated the Provo-Orem area as the best place to live for spiritual well-being, due to a high population of members of The Church of Jesus Christ of Latter-day Saints.",
    "description_length":16,
    "caption_length":16,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1015.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/a7\/AKMap-doton-PortAlsworth.PNG",
    "page_title":"Port Alsworth, Alaska",
    "section_title":null,
    "caption":"Location of Port Alsworth, Alaska",
    "caption_attribution_description":"Adapted from Wikipedia's AK borough maps by Seth Ilys.",
    "description":"Location of Port Alsworth, Alaska",
    "page_context":"Port Alsworth is a census-designated place in Lake and Peninsula Borough, Alaska, United States. It is 165 miles by air southwest of Anchorage. The population was 159 at the 2010 census, up from 104 in 2000.\nPort Alsworth was founded in 1950 by Babe Alsworth, a missionary and bush pilot, and Mary Alsworth, who was the town's first postmaster.\nPort Alsworth is located on private land within Lake Clark National Park and Preserve and is the site of the national park's field headquarters.\nSamaritan's Purse operates a lodge for wounded United States military veterans located within the town for \"Operation Heal Our Patriots\". There is also a summer camp called \"Tanalian Bible Camp\" where youth, ages 8–19, from the surrounding villages can attend.\nFrom the summer of 2013 to the spring of 2014, the local Tanalian School underwent renovation and a dearly needed expansion. The renovation involved tripling school square footage, all new furniture, and doubling the size of the gym.",
    "section_context":"Port Alsworth is a census-designated place (CDP) in Lake and Peninsula Borough, Alaska, United States. It is 165 miles (266 km) by air southwest of Anchorage. The population was 159 at the 2010 census, up from 104 in 2000.\nPort Alsworth was founded in 1950 by Babe Alsworth, a missionary and bush pilot, and Mary Alsworth, who was the town's first postmaster.\nPort Alsworth is located on private land within Lake Clark National Park and Preserve and is the site of the national park's field headquarters.\nSamaritan's Purse operates a lodge for wounded United States military veterans located within the town for \"Operation Heal Our Patriots\" (OHOP). There is also a summer camp called \"Tanalian Bible Camp\" where youth, ages 8–19, from the surrounding villages can attend.\nFrom the summer of 2013 to the spring of 2014, the local Tanalian School underwent renovation and a dearly needed expansion. The renovation involved tripling school square footage, all new furniture, and doubling the size of the gym.",
    "description_length":33,
    "caption_length":33,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1019.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/0a\/Barnum%2C_WI_from_the_south.JPG",
    "page_title":"Barnum, Wisconsin",
    "section_title":null,
    "caption":"Entering Barnum from the south on WIS 131",
    "caption_attribution_description":"English: Barnum, Wisconsin from the south on Wisconsin Highway 131.",
    "description":"Entering Barnum from the south on WIS 131",
    "page_context":"Barnum is an unincorporated community located in the town of Haney, in Crawford County, Wisconsin, United States. Barnum is on the Kickapoo River north of Steuben and is served by Wisconsin Highway 131. The community was founded around 1892 by Edward S. Barnum from Bristol, Ontario County, New York, who purchased land along the Kickapoo River in 1857.",
    "section_context":"Barnum is an unincorporated community located in the town of Haney, in Crawford County, Wisconsin, United States. Barnum is on the Kickapoo River north of Steuben and is served by Wisconsin Highway 131. The community was founded around 1892 by Edward S. Barnum from Bristol, Ontario County, New York, who purchased land along the Kickapoo River in 1857.",
    "description_length":41,
    "caption_length":41,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1057.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/41\/LongueVueClubandGolfCourse.jpg",
    "page_title":"Penn Hills Township, Allegheny County, Pennsylvania",
    "section_title":null,
    "caption":"Longue Vue Club and Golf Course, founded in 1920",
    "caption_attribution_description":"English: Picture of Longue Vue Club and Golf Course, located at 400 Longue Vue Drive, Verona, Penn Hills Township, Allegheny County, Pennsylvania, on November 22, 2009. Longue Vue Club was founded in 1920. The clubhouse was designed by Benno Janssen, and constructed by Edward A. Wehr. It was completed in December 1923, in use by 1924, but not fully finished until 1925. Ralph E. Griswold was the landscape architect, and Robert White was the original designer. Over the years, Geoffrey Cornish and Ron Forse also contributed to the design of the course. Longue Vue Club and Golf Course is listed on the National Register of Historic Places.",
    "description":"Longue Vue Club and Golf Course, founded in 1920",
    "page_context":"Penn Hills is a township with home rule status in Allegheny County, Pennsylvania, United States. The population as of the 2010 census was 42,329. Penn Hills is the second-largest municipality in Allegheny County, after the city of Pittsburgh.",
    "section_context":"Penn Hills is a township with home rule status in Allegheny County, Pennsylvania, United States. The population as of the 2010 census was 42,329. Penn Hills is the second-largest municipality in Allegheny County, after the city of Pittsburgh.",
    "description_length":48,
    "caption_length":48,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1097.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/47\/US_1_in_Mystic%2C_Connecticut.JPG",
    "page_title":"Mystic, Connecticut",
    "section_title":null,
    "caption":"Main Street, downtown Mystic",
    "caption_attribution_description":"English: U.S. Route 1 in downtown Mystic, Connecticut.",
    "description":"Main Street, downtown Mystic",
    "page_context":"Mystic is a U.S. village and census-designated place in Groton and Stonington, Connecticut. Mystic has no independent government because it is not a municipality in the state of Connecticut.\nHistorically, Mystic was a leading seaport of the area. The story of Mystic's nautical background is told at Mystic Seaport, the nation's largest maritime museum, which has preserved a number of sailing ships, such as the whaling ship Charles W. Morgan. The village is located on the Mystic River, which flows into Long Island Sound, giving access to the sea. The Mystic River Bascule Bridge crosses the river in the center of the village. According to the Mystic River Historical Society, the name \"Mystic\" comes from the Pequot words \"missi-tuk\" as describing a large river whose waters are driven into waves by tides or wind. The population was 4,205 at the 2010 census.",
    "section_context":"Mystic is a U.S. village and census-designated place (CDP) in Groton and Stonington, Connecticut. Mystic has no independent government because it is not a municipality in the state of Connecticut.\nHistorically, Mystic was a leading seaport of the area. The story of Mystic's nautical background is told at Mystic Seaport, the nation's largest maritime museum, which has preserved a number of sailing ships, such as the whaling ship Charles W. Morgan. The village is located on the Mystic River, which flows into Long Island Sound, giving access to the sea. The Mystic River Bascule Bridge crosses the river in the center of the village.  According to the Mystic River Historical Society, the name \"Mystic\" comes from the Pequot words \"missi-tuk\" as describing a large river whose waters are driven into waves by tides or wind. The population was 4,205 at the 2010 census.",
    "description_length":28,
    "caption_length":28,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1075.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/6b\/West_Palm_Beach_Aerial_November_2014_photo_D_Ramey_Logan.jpg",
    "page_title":"West Palm Beach, Florida",
    "section_title":null,
    "caption":"West Palm Beach",
    "caption_attribution_description":"English: West Palm Beach Aerial November 2014 photo D Ramey Logan",
    "description":"West Palm Beach",
    "page_context":"West Palm Beach is a city in and the county seat of Palm Beach County, Florida, United States. It is located immediately to the west of the adjacent Palm Beach, which is situated on a barrier island across the Lake Worth Lagoon. The population was 99,919 at the 2010 census. West Palm Beach is a principal city of the Miami metropolitan area, which was home to an estimated 6,158,824 people in 2017.\nIt is the oldest incorporated municipality in the south Florida area, having been incorporated as a city two years before Miami in November 1894. West Palm Beach is located approximately 68 miles north of Downtown Miami.",
    "section_context":"West Palm Beach is a city in and the county seat of Palm Beach County, Florida, United States. It is located immediately to the west of the adjacent Palm Beach, which is situated on a barrier island across the Lake Worth Lagoon. The population was 99,919 at the 2010 census. West Palm Beach is a principal city of the Miami metropolitan area, which was home to an estimated 6,158,824 people in 2017.\nIt is the oldest incorporated municipality in the south Florida area, having been incorporated as a city two years before Miami in November 1894. West Palm Beach is located approximately 68 miles (109 km) north of Downtown Miami.",
    "description_length":15,
    "caption_length":15,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1079.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/af\/Sainte-Catherine-de-Fierbois_-_%C3%89glise_Sainte-Catherine_-_1.jpg",
    "page_title":"Sainte-Catherine-de-Fierbois",
    "section_title":null,
    "caption":"The church of Sainte-Catherine, in Sainte-Catherine-de-Fierbois",
    "caption_attribution_description":"English: Sainte-Catherine's church of Sainte-Catherine-de-Fierbois (Indre-et-Loire, Centre, France). Français&#160;: L'église Sainte-Catherine de Sainte-Catherine-de-Fierbois (Indre-et-Loire, Centre, France).",
    "description":"The church of Sainte-Catherine, in Sainte-Catherine-de-Fierbois",
    "page_context":"Sainte-Catherine-de-Fierbois is a commune in the Indre-et-Loire department in central France.\nIt is a stop on the Way of St. James.",
    "section_context":"Sainte-Catherine-de-Fierbois is a commune in the Indre-et-Loire department in central France.\nIt is a stop on the Way of St. James.",
    "description_length":63,
    "caption_length":63,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1073.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/2c\/Great_Harbor_Cay_horseshoe.jpg",
    "page_title":"Berry Islands",
    "section_title":null,
    "caption":"Great Harbour Cay offers three horseshoe beaches",
    "caption_attribution_description":"Great Harbour Cay, one of the three horseshoe beaches.",
    "description":"Great Harbour Cay offers three horseshoe beaches",
    "page_context":"The Berry Islands are a chain of islands and a district of the Bahamas, covering about thirty square miles of the northwestern part of the Out Islands.\nThe Berry Islands consist of about thirty islands and over one hundred small islands or cays, often referred to as \"The Fish Bowl of the Bahamas.\" They have a population of 807, most of whom are on Great Harbour Cay. The islands were settled in 1836 by Governor William Colebrooke with a group of freed slaves.",
    "section_context":"The Berry Islands are a chain of islands and a district of the Bahamas, covering about thirty square miles (78 km²) of the northwestern part of the Out Islands.\nThe Berry Islands consist of about thirty islands and over one hundred small islands or cays, often referred to as \"The Fish Bowl of the Bahamas.\" They have a population of 807 (2010 census), most of whom are on Great Harbour Cay. The islands were settled in 1836 by Governor William Colebrooke with a group of freed slaves.",
    "description_length":48,
    "caption_length":48,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1187.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/ac\/Chris_Pirillo_Tshirt.jpg",
    "page_title":"Gnomedex",
    "section_title":null,
    "caption":"Chris Pirillo wearing the Gnomedex 2007 T-shirt.",
    "caption_attribution_description":"Chris Pirillo wearing the Gnomedex 2007 t-shirt.",
    "description":"Chris Pirillo wearing the Gnomedex 2007 T-shirt.",
    "page_context":"Gnomedex is a single-track technology conference hosted by Chris Pirillo, the owner of Lockergnome, LLC and is produced by Chris Pirillo and his staff at Lockergnome. Pirillo was the co-host of the show Call For Help on the former cable television channel TechTV. Gnomedex started as an outgrowth of Pirillo's technology newsletters, IRC channel and web site. The conference name is a satirical portmanteau of Pirillo's Lockergnome and the now-defunct Comdex technology trade show, which was a massive and influential annual event at the time of the first Gnomedex conference.\nGnomedex has grown into a conference exploring new and emerging technologies with influencers, entrepreneurs and tech enthusiasts as the primary audience. It bills itself as the crossroads between producers and observers, between users and developers. The conference format is meant to serve the needs of the attendees, many of whom are prolific bloggers and podcasters.\nThe first Gnomedex took place in October 2001 in Des Moines, Iowa, while the tenth Gnomedex took place in August 2010 in Seattle, Washington.",
    "section_context":"Gnomedex is a single-track technology conference hosted by Chris Pirillo, the owner of Lockergnome, LLC  and is produced by Chris Pirillo and his staff at Lockergnome.  Pirillo was the co-host of the show Call For Help on the former cable television channel TechTV.  Gnomedex started as an outgrowth of Pirillo's technology newsletters, IRC channel and web site.  The conference name is a satirical portmanteau of Pirillo's Lockergnome and the now-defunct Comdex technology trade show, which was a massive and influential annual event at the time of the first Gnomedex conference.\nGnomedex has grown into a conference exploring new and emerging technologies with influencers, entrepreneurs and tech enthusiasts as the primary audience.  It bills itself as the crossroads between producers and observers, between users and developers.  The conference format is meant to serve the needs of the attendees, many of whom are prolific bloggers and podcasters.\nThe first Gnomedex took place in October 2001 in Des Moines, Iowa, while the tenth Gnomedex took place in August 2010 in Seattle, Washington.  Gnomedex organizer Chris Pirillo announced that due to the difficulties in operating such events, that the tenth was likely to be the last Gnomedex unless additional backing and resources were brought forward to help spread the administrative and organizational overhead. A Gnomedex stage was included in the first Seattle Interactive Conference in November 2011 after Jake Ludington reportedly convinced Chris Pirillo to continue the event. In March 2015, Chris Pirillo announced that Gnomedex will be making a return sometime in 2015.",
    "description_length":48,
    "caption_length":48,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1061.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c0\/Cussy_le_Chatel.jpg",
    "page_title":"Cussy-le-Châtel",
    "section_title":null,
    "caption":"The church and surroundings in Cussy-le-Châtel",
    "caption_attribution_description":"Esperanto: Cussy-le-Châtel",
    "description":"The church and surroundings in Cussy-le-Châtel",
    "page_context":"Cussy-le-Châtel is a commune in the Côte-d'Or department in eastern France.",
    "section_context":"Cussy-le-Châtel  is a commune in the Côte-d'Or department in eastern France.",
    "description_length":46,
    "caption_length":46,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1186.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/e2\/Hugier%2C_le_lavoir-abreuvoir.jpg",
    "page_title":"Hugier",
    "section_title":null,
    "caption":"The wash house in Hugier",
    "caption_attribution_description":"Français&#160;: le lavoir-abreuvoir",
    "description":"The wash house in Hugier",
    "page_context":"Hugier is a commune in the Haute-Saône department in the region of Bourgogne-Franche-Comté in eastern France.",
    "section_context":"Hugier is a commune in the Haute-Saône department in the region of Bourgogne-Franche-Comté in eastern France.",
    "description_length":24,
    "caption_length":24,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1147.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/en\/f\/f0\/Fabric_Row_signage.jpg",
    "page_title":"Fabric Row (Philadelphia)",
    "section_title":null,
    "caption":"Fabric Row on South 4th Street",
    "caption_attribution_description":null,
    "description":"Fabric Row on South 4th Street",
    "page_context":"Fabric Row is a historic Jewish textile and garment district located on South 4th Street in the Queen Village neighborhood of Philadelphia between Bainbridge Street and Catherine Street.",
    "section_context":"Fabric Row (Der Ferder, \"the fourth\", in Yiddish) is a historic Jewish textile and garment district located on South 4th Street in the Queen Village neighborhood of Philadelphia between Bainbridge Street and Catherine Street.",
    "description_length":30,
    "caption_length":30,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1169.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/b9\/Whitewood_virginia.jpg",
    "page_title":"Whitewood, Virginia",
    "section_title":null,
    "caption":"Whitewood, Va.",
    "caption_attribution_description":"English: Whitewood, Virginia",
    "description":"Whitewood, Va.",
    "page_context":"Whitewood is an unincorporated community in Buchanan County, Virginia. As of the 2000 census, the Whitewood area had a population of 485. It is located along the Dismal River, which is part of the watershed of the Big Sandy River.",
    "section_context":"Whitewood is an unincorporated community in Buchanan County, Virginia. As of the 2000 census, the Whitewood area had a population of 485. It is located along the Dismal River, which is part of the watershed of the Big Sandy River.",
    "description_length":14,
    "caption_length":14,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1052.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/7\/7a\/OKMap-doton-Leach.PNG",
    "page_title":"Leach, Oklahoma",
    "section_title":null,
    "caption":"Location of Leach, Oklahoma",
    "caption_attribution_description":"Adapted from Wikipedia's OK county maps by Seth Ilys.",
    "description":"Location of Leach, Oklahoma",
    "page_context":"Leach is an unincorporated community and census-designated place in southwestern Delaware County, Oklahoma, United States, along U.S. Highway 412 Scenic. The population was 237 at the 2010 census.",
    "section_context":"Leach is an unincorporated community and census-designated place (CDP) in southwestern Delaware County, Oklahoma, United States, along U.S. Highway 412 Scenic. The population was 237 at the 2010 census.",
    "description_length":27,
    "caption_length":27,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1111.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/d8\/Sttrojan33_mairie.JPG",
    "page_title":"Saint-Trojan",
    "section_title":null,
    "caption":"The town hall in Saint-Trojan",
    "caption_attribution_description":"Français&#160;: Mairie de Saint-Trojan, Gironde, France",
    "description":"The town hall in Saint-Trojan",
    "page_context":"Saint-Trojan is a commune in the Gironde department in Nouvelle-Aquitaine in southwestern France. The United States Navy established a naval air station on 14 July 1918 to operate seaplanes during World War I. The base closed shortly after the First Armistice at Compiègne.",
    "section_context":"Saint-Trojan  is a commune in the Gironde department in Nouvelle-Aquitaine in southwestern France. The United States Navy established a naval air station on 14 July 1918 to operate seaplanes during World War I. The base closed shortly after the First Armistice at Compiègne.",
    "description_length":29,
    "caption_length":29,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1161.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/3b\/Bethel_Township%2C_Clark_County%2C_Ohio.jpg",
    "page_title":"Bethel Township, Clark County, Ohio",
    "section_title":null,
    "caption":"Lakes in southwestern Bethel Township",
    "caption_attribution_description":"English: Aerial view of far southwestern Bethel Township, Clark County, Ohio, United States. Picture taken from a Diamond Eclipse light airplane at an altitude of 4,550 feet MSL and a bearing of approximately 213º.",
    "description":"Lakes in southwestern Bethel Township",
    "page_context":"Bethel Township is one of the ten townships of Clark County, Ohio, United States. The 2010 census reported 18,523 people living in the township, 12,440 of whom were in the unincorporated portions of the township.",
    "section_context":"Bethel Township is one of the ten townships of Clark County, Ohio, United States. The 2010 census reported 18,523 people living in the township, 12,440 of whom were in the unincorporated portions of the township.",
    "description_length":37,
    "caption_length":37,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1140.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/4b\/Watch_Out_For_Snakes_at_DNA_Lounge%2C_November_2019.jpg",
    "page_title":"Watch Out For Snakes",
    "section_title":null,
    "caption":"Watch Out For Snakes at DNA Lounge, San Francisco in November 2019.",
    "caption_attribution_description":"English: Watch Out For Snakes at DNA Lounge, San Francisco in November 2019.",
    "description":"Watch Out For Snakes at DNA Lounge, San Francisco in November 2019.",
    "page_context":"Watch Out For Snakes is the pseudonym of Atlanta-based musician and producer Matt Baum. He is often credited as a pioneer of the chipwave genre, fusing elements of chiptune and synthwave.\nHe is also known for placing emphasis on his live performances, which employ a keytar and have been characterized as high-energy and aggressive. He has participated in a number of synthwave, chiptune, and video game music festivals including Echosynthetic Fest, Neon Rose Fest, and MAGFest.\nBaum synthesizes his chiptune instrumentation from the Nintendo and Game Boy video game systems. His albums have been described as imaginary video game soundtracks and he has stated that they draw thematically from personal events in his own life.",
    "section_context":"Watch Out For Snakes is the pseudonym of Atlanta-based musician and producer Matt Baum. He is often credited as a pioneer of the chipwave genre, fusing elements of chiptune and synthwave.\nHe is also known for placing emphasis on his live performances, which employ a keytar and have been characterized as high-energy and aggressive. He has participated in a number of synthwave, chiptune, and video game music festivals including Echosynthetic Fest, Neon Rose Fest, and MAGFest.\nBaum synthesizes his chiptune instrumentation from the Nintendo and Game Boy video game systems. His albums have been described as imaginary video game soundtracks and he has stated that they draw thematically from personal events in his own life.",
    "description_length":67,
    "caption_length":67,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1074.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8e\/Mugdrum_-_geograph.org.uk_-_675365.jpg",
    "page_title":"Carpow Roman Fort",
    "section_title":null,
    "caption":"The Tay estuary showing the area around the Roman Fort",
    "caption_attribution_description":"English: Mugdrum Mugdrum Island from Carpow Hill.",
    "description":"The Tay estuary showing the area around the Roman Fort",
    "page_context":"The Roman Fort of Carpow was situated at the confluence of the rivers Tay and Earn in what is now Scotland.\nIt was a large fortress with an area of thirty acres occupied by two legions at different times, Legio II Augusta and Legio VI Victrix, and thus of solid, permanent construction using stone, brick and tiles.\nThe fort was occupied from the late second century AD until the early third century AD. The site of the fort has not been comprehensively excavated but it is believed to have served as a naval supply depot for Roman forces in the central lowlands. Its occupation also coincided with the campaigns of Septimius Severus in the area.\nHowever, its site on the southern side of the Tay estuary is incompatible with its use as a base for Severan offensive operations to the north and, along with other evidence, it is more likely that the fortress was built under Commodus in 185 to support his campaigns.\nIt has been suggested that the Carpow fort was the place named as \"Horrea Classis\" or \"Poreo Classis\" in the Ravenna Cosmography.",
    "section_context":"The Roman Fort of Carpow was situated at the confluence of the rivers Tay and Earn in what is now Scotland.\nIt was a large fortress with an area of thirty acres occupied by two legions at different times, Legio II Augusta and Legio VI Victrix, and thus of solid, permanent construction using stone, brick and tiles.\nThe fort was occupied from the late second century AD until the early third century AD. The site of the fort has not been comprehensively excavated but it is believed to have served as a naval supply depot for Roman forces in the central lowlands. Its occupation also coincided with the campaigns of Septimius Severus in the area.\nHowever, its site on the southern side of the Tay estuary is incompatible with its use as a base for Severan offensive operations to the north and, along with other evidence, it is more likely that the fortress was built under Commodus in 185 to support his campaigns. \nIt has been suggested that the Carpow fort was the place named as \"Horrea Classis\" or \"Poreo Classis\" in the Ravenna Cosmography.",
    "description_length":54,
    "caption_length":54,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1032.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/89\/New_River-Welcome_to_New_River_Marker.jpg",
    "page_title":"New River, Arizona",
    "section_title":null,
    "caption":"Welcome to New River",
    "caption_attribution_description":"English: Welcome to the town of New River sign.",
    "description":"Welcome to New River",
    "page_context":"New River is an unincorporated community and a census-designated place in Maricopa County, Arizona, United States. The population was 14,952 at the 2010 census.",
    "section_context":"New River is an unincorporated community and a census-designated place (CDP) in Maricopa County, Arizona, United States. The population was 14,952 at the 2010 census.",
    "description_length":20,
    "caption_length":20,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"994.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/69\/Micasasa_jud_Sibiu.jpg",
    "page_title":"Micăsasa",
    "section_title":null,
    "caption":"Location in Sibiu County",
    "caption_attribution_description":"Română: Micasasa jud Sibiu",
    "description":"Location in Sibiu County",
    "page_context":"Micăsasa is a commune located in Sibiu County, Transylvania, Romania. It is composed of four villages: Chesler, Micăsasa, Țapu and Văleni. Micăsasa and Țapu villages have fortified churches.\nAt the 2011 census, 93.4% of inhabitants were Romanians, 4.4% Hungarians, 1.5% Roma and 0.6% Germans.",
    "section_context":"Micăsasa (German: Feigendorf; Hungarian: Mikeszásza) is a commune located in Sibiu County, Transylvania, Romania. It is composed of four villages: Chesler, Micăsasa, Țapu and Văleni. Micăsasa and Țapu villages have fortified churches.\nAt the 2011 census, 93.4% of inhabitants were Romanians, 4.4% Hungarians, 1.5% Roma and 0.6% Germans.",
    "description_length":24,
    "caption_length":24,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1084.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/33\/Sand_Lake_WI.jpg",
    "page_title":"Sand Lake, Sawyer County, Wisconsin",
    "section_title":null,
    "caption":"Sand Lake, WI from Highway 70",
    "caption_attribution_description":"English: Sand Lake, Wisconsin",
    "description":"Sand Lake, WI from Highway 70",
    "page_context":"Sand Lake is a town in Sawyer County, Wisconsin, United States. The population was 774 at the 2000 census. The census-designated place of Stone Lake is located partially in the town. The unincorporated community of Hauer is also located in the town.",
    "section_context":"Sand Lake is a town in Sawyer County, Wisconsin, United States. The population was 774 at the 2000 census. The census-designated place of Stone Lake is located partially in the town. The unincorporated community of Hauer is also located in the town.",
    "description_length":29,
    "caption_length":29,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1068.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/6f\/Vicksburg_December_2018_32_%28Warren_County_Courthouse%29.jpg",
    "page_title":"Warren County, Mississippi",
    "section_title":null,
    "caption":"The Warren County Courthouse in Vicksburg was built c. 1940. It is located across from the Old Courthouse Museum.",
    "caption_attribution_description":"English: The Warren County Courthouse in Vicksburg, Mississippi (United States).",
    "description":"The Warren County Courthouse in Vicksburg was built c. 1940. It is located across from the Old Courthouse Museum.",
    "page_context":"Warren County is a county in the U.S. state of Mississippi. As of the 2010 census, 48,773 people lived there. Its county seat is Vicksburg.",
    "section_context":"Warren County is a county in the U.S. state of Mississippi. As of the 2010 census, 48,773 people lived there. Its county seat is Vicksburg.",
    "description_length":113,
    "caption_length":113,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1132.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/d3\/Chateau_clavieres-ayrens_ruines_fa%C3%A7ade.jpg",
    "page_title":"Ayrens",
    "section_title":null,
    "caption":"Ruins of the chateau of Clavières-Ayrens",
    "caption_attribution_description":"Français&#160;: Façade en ruine de l'ancien château de Clavière-Ayrens à Ayrens (15)",
    "description":"Ruins of the chateau of Clavières-Ayrens",
    "page_context":"Ayrens is a commune in the Cantal department in the Auvergne region of south-central France.\nThe inhabitants of the commune are known as Ayrencois or Ayrencoises.",
    "section_context":"Ayrens is a commune in the Cantal department in the Auvergne region of south-central France.\nThe inhabitants of the commune are known as Ayrencois or Ayrencoises.",
    "description_length":40,
    "caption_length":40,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1050.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/af\/Jigjiga_Main_Street.jpg",
    "page_title":"Jijiga",
    "section_title":null,
    "caption":"Jijiga city centre",
    "caption_attribution_description":"English: Main Street",
    "description":"Jijiga city centre",
    "page_context":"Jijiga is a city in the Somali Region of Ethiopia. It became the capital of the Somali Regional State in 1995 after it was moved from Godey. Located in the Fafan Zone with 60 km west of the border with Somalia, the city has an elevation of 1,609 metres above sea level.",
    "section_context":"Jijiga (Amharic: ጂጂጋ; Somali: Jigjiga) is a city in the Somali Region of Ethiopia.  It became the capital of the Somali Regional State in 1995 after it was moved from Godey . Located in the Fafan Zone with 60 km (37 mi) west of the border with Somalia, the city has an elevation of 1,609 metres above sea level.",
    "description_length":18,
    "caption_length":18,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1165.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/9f\/Ph_locator_map_apo.png",
    "page_title":"Apo Island",
    "section_title":null,
    "caption":"Map of Negros Oriental showing the location of Apo Island.",
    "caption_attribution_description":"English: Map of Negros Oriental showing the location of Apo Island",
    "description":"Map of Negros Oriental showing the location of Apo Island.",
    "page_context":"Apo Island is a volcanic island covering 74 hectares in land area, 7 kilometers off the southeastern tip of Negros Island and 30 kilometers south of the Negros Oriental capital of Dumaguete in the Philippines. The name \"Apo\" means \"elder\" or \"respected ancestor\" in the Visayan languages.\nThe marine habitat around the island is a marine reserve, protected by the National Integrated Protected Area Act and under the jurisdiction of the Protected Area Management Board. It has become a popular dive site and snorkeling destination with tourists. There are two resorts on Apo Island, each with a dive center: Apo Island Beach Resort and Liberty's Lodge. There is also a ranger station and a lighthouse.\nThe island is under the jurisdiction of the municipality of Dauin, Negros Oriental, and is one of the municipality's 23 barangays. As of the 2010 census, the island has a population of 918.",
    "section_context":"Apo Island \/ˈæpoʊ\/ is a volcanic island covering 74 hectares in land area, 7 kilometers off the southeastern tip of Negros Island and 30 kilometers south of the Negros Oriental capital of Dumaguete in the Philippines. The name \"Apo\" means \"elder\" or \"respected ancestor\" in the Visayan languages.\nThe marine habitat around the island is a marine reserve, protected by the National Integrated Protected Area Act (NIPA) and under the jurisdiction of the Protected Area Management Board (PAMB). It has become a popular dive site and snorkeling destination with tourists. There are two resorts on Apo Island, each with a dive center: Apo Island Beach Resort and Liberty's Lodge. There is also a ranger station and a lighthouse.\nThe island is under the jurisdiction of the municipality of Dauin, Negros Oriental, and is one of the municipality's 23 barangays. As of the 2010 census, the island has a population of 918.",
    "description_length":58,
    "caption_length":58,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1022.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/f8\/Ingr%C3%A9_mairie_1.jpg",
    "page_title":"Ingré",
    "section_title":null,
    "caption":"The town hall in Ingré",
    "caption_attribution_description":"Français&#160;: Mairie, Ingré, Loiret, France",
    "description":"The town hall in Ingré",
    "page_context":"Ingré is a commune in the Loiret department in north-central France.",
    "section_context":"Ingré is a commune in the Loiret department in north-central France.",
    "description_length":22,
    "caption_length":22,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1144.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/0d\/AG-40_Monomoy.jpg",
    "page_title":"USS Monomoy (AG-40)",
    "section_title":null,
    "caption":"USS Monomoy (AG-40)",
    "caption_attribution_description":"English: USS Monomoy (AG-40) in drydock, 27 August 1943, at Maryland Drydock Co., Baltimore, Maryland (USA).",
    "description":"USS Monomoy (AG-40)",
    "page_context":"USS Monomoy (AG-40) was a commercial cargo ship acquired by the U.S. Navy during World War II. She was outfitted with guns and depth charges and sent into the dangerous waters of the North Atlantic Ocean to furnish data used to predict storm movement and severe weather conditions to safeguard the continuous movement of merchant convoys, naval warships, and airplanes between North America and the United Kingdom, Murmansk, and other destinations. She served as an escort vessel when required. She was manned by a U.S. Coast Guard crew and was eventually transferred to that agency as USCGC Monomoy.",
    "section_context":"USS Monomoy (AG-40) was a commercial cargo ship acquired by the U.S. Navy during World War II. She was outfitted with guns and depth charges and sent into the dangerous waters of the North Atlantic Ocean to furnish data used to predict storm movement and severe weather conditions to safeguard the continuous movement of merchant convoys, naval warships, and airplanes between North America and the United Kingdom, Murmansk, and other destinations.  She served  as an escort vessel when required. She was manned by a U.S. Coast Guard crew and was eventually transferred to that agency as USCGC Monomoy (WAG-275).",
    "description_length":19,
    "caption_length":19,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1063.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/4\/40\/Indianapolis-motor-speedway.jpg",
    "page_title":"Speedway, Indiana",
    "section_title":null,
    "caption":"Speedway and Indianapolis Motor Speedway in 2005.",
    "caption_attribution_description":null,
    "description":"Speedway and Indianapolis Motor Speedway in 2005.",
    "page_context":"Speedway is a town in Wayne Township, Marion County, Indiana, United States. The population was 11,812 at the 2010 census. Speedway, which is an enclave of Indianapolis, is the home of the Indianapolis Motor Speedway.",
    "section_context":"Speedway is a town in Wayne Township, Marion County, Indiana, United States. The population was 11,812 at the 2010 census. Speedway, which is an enclave of Indianapolis, is the home of the Indianapolis Motor Speedway.",
    "description_length":49,
    "caption_length":49,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1098.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/a0\/Ft._Pierce%2C_FL%2C_Courthouse%2C_St._Lucie_County%2C_08-07-2010_%288%29.JPG",
    "page_title":"St. Lucie County, Florida",
    "section_title":null,
    "caption":"St. Lucie County Courthouse",
    "caption_attribution_description":"English: Courthouse, St. Lucie County, Ft. Pierce, FL",
    "description":"St. Lucie County Courthouse",
    "page_context":"St. Lucie County is a county in the state of Florida. The county seat is the city of Fort Pierce. As of 2000, 192,695 people lived there. The 2005 census estimate for the county was 241,305.",
    "section_context":"St. Lucie County is a county in the state of Florida.  The county seat is the city of Fort Pierce.  As of 2000, 192,695 people lived there.  The 2005 census estimate for the county was 241,305.",
    "description_length":27,
    "caption_length":27,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"995.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/5a\/Serra_d%27Urbasa_20180731_145941.jpg",
    "page_title":"Alsasua – Altsasu",
    "section_title":null,
    "caption":"Aerial view of Altsasu\/Alsasua",
    "caption_attribution_description":"Català: Fotos preses en una excursió al \"mendizaleen ibilbidea\" o camí dels muntanyencs, un itinerari des del centre d'informació que hi ha al coll d'Urbasa fins a la carena sobre la Sakana. La major part transcorre per fagedes i part del primer tram coincideix amb un itinerari adaptat. Euskara: \"Mendizaleen ibilbidean\" hartutako irudiak, Urbasa mendilerroan dagoen informazio zentroak Sakanaz gain burutzen duen ibilbidea. Zati gehiena pagadien artean egiten da eta ibilbidearen lehen zatiak egokitutako ibilbidearekin bat egiten du.",
    "description":"Aerial view of Altsasu\/Alsasua",
    "page_context":"Alsasua is a town located in the autonomous community of Navarre, northern Spain. Its population in 2017 was 7,419. The Battle of Alsasua took place here in 1834. 30 years later the town turned into a railway hub, transforming its demography, economy, and cultural landscape. In 2016, a fight erupting in a bar escalated into an Audiencia Nacional judicial case that stirred the town.",
    "section_context":"Alsasua (in Spanish, Altsasu in Basque; official name: Altsasu\/Alsasua) is a town located in the autonomous community of Navarre, northern Spain.  Its population in 2017 was 7,419. The Battle of Alsasua took place here in 1834. 30 years later the town turned into a railway hub, transforming its demography, economy, and cultural landscape. In 2016, a fight erupting in a bar escalated into an Audiencia Nacional judicial case that stirred the town.",
    "description_length":30,
    "caption_length":30,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1195.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/1\/12\/%E6%99%AF%E5%B7%9E%E5%A1%94_Jingzhou_Pagoda.JPG",
    "page_title":"Jing County, Hebei",
    "section_title":null,
    "caption":"Jingzhou Pagoda",
    "caption_attribution_description":"中文: 開福寺釋迦文舍利塔，俗稱景州塔，位於河北景縣。始建於北朝，北齊、隋代重修，現存建築為宋代風格，應是北宋時重建。1996年被列為第四批全國重點文物保護單位。 This is a photo of a (or part of a) Major National Historical and Cultural Site in China identified by the ID 4-82",
    "description":"Jingzhou Pagoda",
    "page_context":"Jing County or Jingxian is a county in Hengshui, Hebei province, People's Republic of China. It has an area of 1,183 km² and has 500,000 inhabitants. Its seat is the town of Jingzhou.",
    "section_context":"Jing County or Jingxian (simplified Chinese: 景县; traditional Chinese: 景縣; pinyin: Jǐng Xiàn) is a county in Hengshui, Hebei province, People's Republic of China. It has an area of 1,183 km² (457 sq mi) and has 500,000 inhabitants. Its seat is the town of Jingzhou (景州镇).",
    "description_length":15,
    "caption_length":15,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1199.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/04\/RO_BV_Sanpetru_St_Nicholas_church_1.jpg",
    "page_title":"Sânpetru",
    "section_title":null,
    "caption":"St. Nicholas Church",
    "caption_attribution_description":"English: Saint Nicholas' church in Sânpetru, Brașov County, RomaniaRomână: Biserica „Sfântul Nicolae” din Sânpetru, județul Brașov, România This is a photo of a historic monument in județul Brașov, classified with number BV-II-m-A-11816",
    "description":"St. Nicholas Church",
    "page_context":"Sânpetru is a commune in Brașov County, Transylvania, Romania, located 5 km north of the county capital Brașov. It is composed of a single village, Sânpetru.\nThis area was home to many Transylvanian Saxons although after 1989 much of this community emigrated to Germany. The center of the village was built by this group and shows the influence of German architecture. Separate from this there is a crowded Romanian-built area featuring a small church and houses dating at least to the early 19th century. A new center was built closer to Brașov during the communist era to house migrating workers for the tractor and bus factories in the city.\nSince the Romanian Revolution of 1989 new, more luxurious houses have been built on the outskirts of the village, slowly linking it with Brașov.\nAt the 2011 census, 91.8% of inhabitants were Romanians, 2.7% Hungarians and 1.7% each Germans and Roma.",
    "section_context":"Sânpetru (German: Petersberg; Hungarian: Barcaszentpéter) is a commune in Brașov County, Transylvania, Romania, located 5 km north of the county capital Brașov. It is composed of a single village, Sânpetru.\nThis area was home to many Transylvanian Saxons although after 1989 much of this community emigrated to Germany.  The center of the village was built by this group and shows the influence of German architecture.  Separate from this there is a crowded Romanian-built area featuring a small church and houses dating at least to the early 19th century. A new center was built closer to Brașov during the communist era to house migrating workers for the tractor and bus factories in the city.\nSince the Romanian Revolution of 1989 new, more luxurious houses have been built on the outskirts of the village, slowly linking it with Brașov.\nAt the 2011 census, 91.8% of inhabitants were Romanians, 2.7% Hungarians and 1.7% each Germans and Roma.",
    "description_length":19,
    "caption_length":19,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1172.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/09\/Topol_pri_Medvodah_Slovenia.JPG",
    "page_title":"Topol pri Medvodah",
    "section_title":null,
    "caption":"Topol pri Medvodah. The sign at left reads \"Welcome to Katarina.\"",
    "caption_attribution_description":"English: Topol pri Medvodah, Municipality of Medvode, Slovenia. The pre-1955 name Katarina (nad Medvodami) is visible at left, and the official name Topol (pri Medvodah) at right.",
    "description":"Topol pri Medvodah. The sign at left reads \"Welcome to Katarina.\"",
    "page_context":"Topol pri Medvodah is a small settlement in the Municipality of Medvode in the Upper Carniola region of Slovenia. It lies in the hills northwest of the Slovene capital Ljubljana and is a popular destination for short trips with locals.",
    "section_context":"Topol pri Medvodah ([ˈtɔːpɔl pɾi mɛˈdʋoːdax]) is a small settlement in the Municipality of Medvode in the Upper Carniola region of Slovenia. It lies in the hills northwest of the Slovene capital Ljubljana and is a popular destination for short trips with locals.",
    "description_length":65,
    "caption_length":65,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1188.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/eb\/MC_Toby_Manhire_%288184647611%29.jpg",
    "page_title":"Toby Manhire",
    "section_title":null,
    "caption":"Manhire in 2012 as host of the New Zealand Open Source Awards",
    "caption_attribution_description":"New Zealand Open Source Awards 2012 ceremony in Wellington on 7 November 2012",
    "description":"Manhire in 2012 as host of the New Zealand Open Source Awards",
    "page_context":"Toby Manhire is a New Zealand journalist and columnist. He describes himself as a \"freelance writer & editor, mostly scribbling for Listener, Herald, Guardian\". He is the son of poet Bill Manhire.",
    "section_context":"Toby Manhire is a New Zealand journalist and columnist. He describes himself as a \"freelance writer & editor, mostly scribbling for Listener, Herald, Guardian\". He is the son of poet Bill Manhire.",
    "description_length":61,
    "caption_length":61,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1095.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c5\/Schloss_Schl%C3%BC%C3%9Flberg-Torturm.jpg",
    "page_title":"Schlüßlberg",
    "section_title":null,
    "caption":"Castle gate tower",
    "caption_attribution_description":"Schloss_Schlüßlberg-Torturm",
    "description":"Castle gate tower",
    "page_context":"Schlüßlberg is a municipality in the district of Grieskirchen in the Austrian state of Upper Austria.",
    "section_context":"Schlüßlberg is a municipality in the district of Grieskirchen in the Austrian state of Upper Austria.",
    "description_length":17,
    "caption_length":17,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1229.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/00\/Lee_Jeans_Booth_Kansas_City.jpg",
    "page_title":"Lee (jeans)",
    "section_title":"History",
    "caption":"A Lee Jeans booth at a local 5k race in Kansas City.",
    "caption_attribution_description":"English: A Lee Jeans booth at a local 5k race in Kansas City.",
    "description":"A Lee Jeans booth at a local 5k race in Kansas City.",
    "page_context":"Lee is an American brand of denim jeans, first produced in 1889 in Salina, Kansas. The company is owned by Kontoor Brands, a spin-off of VF Corporation's Jeans wear Division.\nIts headquarters is currently in Merriam, Kansas, just outside Kansas City, Missouri. The company states that they are an international retailer and manufacturer of casual wear and work wear and that they have more than 400 employees in the United States. In Australasia, the brand is owned by Pacific Brands since 2007, after it was acquired from Yakka.",
    "section_context":"The company was formed in 1889 by Henry David Lee as the HD Lee Mercantile Company at Salina, Kansas producing dungarees and jackets. The growth of Lee was prompted by the introduction of the Union-All work jumpsuit in 1913 and their first overall in 1920. Later in the 1920s Lee introduced a zipper fly and continued to expand. Around this time, the first children's overall line was sold. In 1928 H.D. Lee, founder and president of The H.D. Lee Mercantile Company, died. During the 1930s and 1940s the company became the leading manufacturer of work clothes in the US. In 1944, the Lazy \"S\" became the official Lee back pocket. A flood wiped out Lee's Kansas City distribution center. It ruined the entire stock of merchandise, except the Buddy Lee dolls, which floated. In 1954, Lee expanded into casual wear. During the 1960s the company expanded to 81 countries and in 1969 was acquired by VF Corporation, becoming a brand. Lee aired its first television advertisement, which promoted Lee western wear.\nIn the 1970s Lee shifted its focus from the workwear business and began catering to fashion cycles. Lee created an all-new fit for women under the Ms. Lee label. A youth wear line for boys and girls was introduced. In 1996, the company launched Lee National Denim Day as part of National Breast Cancer Awareness Month. Working with the Entertainment Industry Foundation, Lee National Denim Day has raised over $75 million to help fund breast cancer research programs. In 2014, the brand was relaunched in Paris via the Citadium Paris store. In 2019, Lee, Wrangler, Rock & Republic, and VF Outlet were Separated from VF Corporation into Kontoor Brands.",
    "description_length":52,
    "caption_length":52,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1167.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/84\/Cohas_h65046a.jpg",
    "page_title":"SS Empire Simba",
    "section_title":null,
    "caption":"West Cohas slides down the ways at her launching on 4 June 1918",
    "caption_attribution_description":"English: West Cohas (American Freighter, 1918) Enters the water during her launching at the Skinner &amp; Eddy Corporation shipyard, Seattle, Washington, on 6 June 1918, after being on the building ways for 54 days. This ship was delivered by the builder on 29 June 1918 and placed in commission as USS West Cohas (ID # 3253). She was returned to the U.S. Shipping Board on 9 May 1919. The original print is in National Archives' Record Group 19-LCM. U.S. Naval Historical Center Photograph.",
    "description":"West Cohas slides down the ways at her launching on 4 June 1918",
    "page_context":"SS Empire Simba was a British steam-powered cargo ship. She was originally an American ship, launched in 1918 as SS West Cohas. During a stint in the United States Navy from 1918 to 1919, she was called USS West Cohas.\nWest Cohas was built in 1918 for the United States Shipping Board as part of the West boats, a series of steel-hulled cargo ships built on the West Coast of the United States for the World War I war effort. She was the 24th ship built by Skinner & Eddy of Seattle, Washington, and was completed in 88 calendar days. She was commissioned into the Naval Overseas Transportation Service of the United States Navy as USS West Cohas in June 1918. After several overseas trips for the Navy, she was decommissioned in May 1919 and returned to the USSB.\nWest Cohas ran aground off Sable Island in 1925 while trying to assist a vessel in distress, but otherwise had a relatively uneventful merchant career for the USSB. In 1933, she was sold to the Lykes Brothers Steamship Company. In 1939, she collided with the Irish passenger ship Munster, which damaged both vessels. In June 1940, West Cobalt was sold to British interests and renamed Empire Simba.",
    "section_context":"SS Empire Simba was a British steam-powered cargo ship. She was originally an American ship, launched in 1918 as SS West Cohas. During a stint in the United States Navy from 1918 to 1919, she was called USS West Cohas (ID-3253).\nWest Cohas was built in 1918 for the United States Shipping Board (USSB) as part of the West boats, a series of steel-hulled cargo ships built on the West Coast of the United States for the World War I war effort. She was the 24th ship built by Skinner & Eddy of Seattle, Washington, and was completed in 88 calendar days. She was commissioned into the Naval Overseas Transportation Service (NOTS) of the United States Navy as USS West Cohas (ID-3253) in June 1918. After several overseas trips for the Navy, she was decommissioned in May 1919 and returned to the USSB.\nWest Cohas ran aground off Sable Island in 1925 while trying to assist a vessel in distress, but otherwise had a relatively uneventful merchant career for the USSB. In 1933, she was sold to the Lykes Brothers Steamship Company. In 1939, she collided with the Irish passenger ship Munster, which damaged both vessels. In June 1940, West Cobalt was sold to British interests and renamed Empire Simba.\nDuring convoy service in World War II, Empire Simba initially sailed between the United Kingdom and North America carrying cargos of scrap iron from the United States. She was bombed by a German aircraft on 1 March and abandoned. She was towed to port for repairs but was struck by a German land mine dropped in a bombing raid. After six months of repairs, she began sailing roundtrips to Freetown, Sierra Leone. On one return voyage to the UK in July 1944, she collided with another ship in the convoy. After splitting the rest of the war between voyages to North America and Africa, Empire Simba was loaded with chemical weapons in August 1945 and scuttled west of Ireland.",
    "description_length":63,
    "caption_length":63,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1010.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/a1\/Porvoo_in_January.jpg",
    "page_title":"Porvoo",
    "section_title":null,
    "caption":"A view of buildings in the Porvoo Old Town, including the Porvoo Cathedral",
    "caption_attribution_description":"Русский: Финляндия, город Порвоо. Вид на Старый Город.English: Finland, Porvoo. View to the Old City.",
    "description":"A view of buildings in the Porvoo Old Town, including the Porvoo Cathedral",
    "page_context":"Porvoo is a city and a municipality situated on the southern coast of Finland about 35 kilometres east of the city border of Helsinki and approximately 50 kilometres of the city centre. It is one of the six medieval towns in Finland, first mentioned as a city in texts from the 14th century. Porvoo is the seat of the Swedish-speaking Diocese of Borgå of the Evangelical Lutheran Church of Finland.\nThe Porvoo Old Town is a popular tourist destination, known for its well-preserved 18th and 19th century buildings and 15th century cathedral, the Porvoo Cathedral. The Old Town together with Porvoonjoki River Valley is recognized as historically and culturally significant as one of the National landscapes of Finland. Porvoo is internationally considered to be one of the most beautiful towns in Finland.\nThe municipality's official languages are Finnish and Swedish. In 2014, 64.6% of the population spoke Finnish as their native language, while 30.1% were Swedish speakers. 5.4% had a different native language.\nPorvoo's neighbouring municipalities are Askola, Loviisa, Myrskylä, Pornainen, and Sipoo; and the sub-region maintained by Porvoo includes Askola, Myrskylä and Pukkila.",
    "section_context":"Porvoo ([ˈporʋoː]; Swedish: Borgå [ˈbǒrːɡo] (listen)) is a city and a municipality situated on the southern coast of Finland about 35 kilometres (22 mi) east of the city border of Helsinki and approximately 50 kilometres (30 mi) of the city centre. It is one of the six medieval towns in Finland, first mentioned as a city in texts from the 14th century. Porvoo is the seat of the Swedish-speaking Diocese of Borgå of the Evangelical Lutheran Church of Finland.\nThe Porvoo Old Town is a popular tourist destination, known for its well-preserved 18th and 19th century buildings and 15th century cathedral, the Porvoo Cathedral. The Old Town together with Porvoonjoki River Valley is recognized as historically and culturally significant as one of the National landscapes of Finland. Porvoo is internationally considered to be one of the most beautiful towns in Finland.\nThe municipality's official languages are Finnish and Swedish. In 2014, 64.6% of the population spoke Finnish as their native language, while 30.1% were Swedish speakers. 5.4% had a different native language.\nPorvoo's neighbouring municipalities are Askola, Loviisa, Myrskylä, Pornainen, and Sipoo; and the sub-region maintained by Porvoo includes Askola, Myrskylä and Pukkila.",
    "description_length":74,
    "caption_length":74,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1125.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/60\/Wall_house_front.JPG",
    "page_title":"Cheltenham Township, Montgomery County, Pennsylvania",
    "section_title":null,
    "caption":"Richard Wall house in Elkins Park, the second oldest house in Pennsylvania",
    "caption_attribution_description":"English: Wall House in PA, USA",
    "description":"Richard Wall house in Elkins Park, the second oldest house in Pennsylvania",
    "page_context":"Cheltenham Township is a home rule township in Montgomery County, Pennsylvania, United States. Cheltenham's population density ranges from over 10,000 per square mile in rowhouses and high-rise apartments along Cheltenham Avenue to historic neighborhoods in Wyncote and Elkins Park. It is the most densely populated township in Montgomery County. The population was 36,793 at the 2010 U.S. Census, making it the third most populous township in Montgomery County and the 27th most populous municipality in Pennsylvania. It was originally part of Philadelphia County, and it became part of Montgomery County upon that county's creation in 1784.\nCheltenham is located 5 miles from Center City, Philadelphia and surrounded by the North and Northeast sections of Philadelphia, Abington, Jenkintown, and Springfield. The SEPTA Main Line passes through Cheltenham via 5 regional rail stations, some of which are the busiest in the SEPTA system.",
    "section_context":"Cheltenham Township is a home rule township in Montgomery County, Pennsylvania, United States. Cheltenham's population density ranges from over 10,000 per square mile in rowhouses and high-rise apartments along Cheltenham Avenue to historic neighborhoods in Wyncote and Elkins Park. It is the most densely populated township in Montgomery County. The population was 36,793 at the 2010 U.S. Census, making it the third most populous township in Montgomery County and the 27th most populous municipality in Pennsylvania. It was originally part of Philadelphia County, and it became part of Montgomery County upon that county's creation in 1784.\nCheltenham is located 5 miles from Center City, Philadelphia and surrounded by the North and Northeast sections of Philadelphia, Abington, Jenkintown, and Springfield. The SEPTA Main Line passes through Cheltenham via 5 regional rail stations, some of which are the busiest in the SEPTA system. Cheltenham is served by the SEPTA City Transit Division and is adjacent to Fern Rock Transportation Center and the Broad Street Line subway which terminates at the South Philadelphia Sports Complex and also the Frankford Transportation Center and the El, which terminates at 69th Street in Upper Darby Township. The northern terminus of Broad Street is in Cheltenham, at its intersection with Cheltenham Avenue (Pennsylvania Route 309).",
    "description_length":74,
    "caption_length":74,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1012.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/96\/La_Chapelle-sous-Orbais_-_%C3%89glise_Saint-Pierre-Saint-Paul_2.jpg",
    "page_title":"La Chapelle-sous-Orbais",
    "section_title":null,
    "caption":"The church in La Chapelle-sous-Orbais",
    "caption_attribution_description":"Français&#160;: Vue générale de l'église",
    "description":"The church in La Chapelle-sous-Orbais",
    "page_context":"La Chapelle-sous-Orbais is a commune in the Marne department in north-eastern France.",
    "section_context":"La Chapelle-sous-Orbais  is a commune in the Marne department in north-eastern France.",
    "description_length":37,
    "caption_length":37,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1177.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/30\/Slime_%E2%80%93_Hafen_Rock_2016_01.jpg",
    "page_title":"Slime (band)",
    "section_title":null,
    "caption":"Slime performing in 2016",
    "caption_attribution_description":"Deutsch: Slime beim Hafen Rock 2016 in Hamburg",
    "description":"Slime performing in 2016",
    "page_context":"Slime is a German punk rock band, founded in Hamburg in 1979. They were one of the defining bands of the 1980s German punk scene. Musically and lyrically, they developed from simple, straightforward songs in the style of late 70's British punk into complex song structures with layered and cryptic texts. Their anti-fascist messages in particular had an enormous influence on the later Deutschpunk scene; many slogans from their earlier work were adopted in the autonomist scene.\nSlime's work was the subject of controversy. During their periods of growing success, they were accused of selling out. Their anti-American songs were also criticized by the leftist scene. Their first EP, Wir wollen keine Bullenschweine was the subject of preliminary proceedings by the public prosecutor.\nThe band first dissolved in 1984 and reunited in 1990 as violence against refugees began to mount and released two albums, experiencing their first commercial success before dissolving again in 1994. The band reunited in 2009 after fifteen years and has released two additional albums.",
    "section_context":"Slime is a German punk rock band, founded in Hamburg in 1979. They were one of the defining bands of the 1980s German punk scene. Musically and lyrically, they developed from simple, straightforward songs in the style of late 70's British punk into complex song structures with layered and cryptic texts. Their anti-fascist messages in particular had an enormous influence on the later Deutschpunk scene; many slogans from their earlier work were adopted in the autonomist scene.\nSlime's work was the subject of controversy. During their periods of growing success, they were accused of selling out. Their anti-American songs were also criticized by the leftist scene. Their first EP, Wir wollen keine Bullenschweine (\"We don't want any fucking cops\") was the subject of preliminary proceedings by the public prosecutor.\nThe band first dissolved in 1984 and reunited in 1990 as violence against refugees began to mount (e.g. Hoyerswerda riots, Rostock-Lichtenhagen riots) and released two albums, experiencing their first commercial success before dissolving again in 1994. The band reunited in 2009 after fifteen years and has released two additional albums.",
    "description_length":24,
    "caption_length":24,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1024.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/65\/Adirondacks_Mount_Marcy_From_Mount_Haystack.JPG",
    "page_title":"Keene, New York",
    "section_title":null,
    "caption":"Mount Marcy from Mount Haystack",
    "caption_attribution_description":"English: Mount Marcy in the Adirondacks mountain range, New York State, USA. Photo taken from Mount Haystack, looking across Panther Gorge.",
    "description":"Mount Marcy from Mount Haystack",
    "page_context":"Keene is a town in central Essex County, New York, United States. It includes the hamlets of Keene, Keene Valley, and St. Huberts, with a total population of 1,105 as of the 2010 census.\nThe town is part of the Adirondack Park, and includes 15 of the 46 High Peaks, including Mount Marcy, New York's highest mountain, and the rest of the Great Range. It also includes the Ausable Lakes, the source of the Ausable River. Trailheads for many of the High Peaks are located within the town, along with the Johns Brook Lodge of the Adirondack Mountain Club.",
    "section_context":"Keene is a town in central Essex County, New York, United States. It includes the hamlets of Keene, Keene Valley, and St. Huberts, with a total population of 1,105 as of the 2010 census.\nThe town is part of the Adirondack Park, and includes 15 of the 46 High Peaks, including Mount Marcy, New York's highest mountain, and the rest of the Great Range. It also includes the Ausable Lakes, the source of the Ausable River. Trailheads for many of the High Peaks are located within the town, along with the Johns Brook Lodge of the Adirondack Mountain Club.",
    "description_length":31,
    "caption_length":31,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1014.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8d\/F-22_Raptor_over_home_base_-_030929-F-0000J-003.jpg",
    "page_title":"Tyndall Air Force Base",
    "section_title":null,
    "caption":"The first operational F-22A Raptor flies over Tyndall AFB on its delivery flight during 2003.",
    "caption_attribution_description":"English: TYNDALL AIR FORCE BASE, Fla. -- The first operational F\/A-22 Raptor flies over the base on its delivery flight. Tyndall is home of the world's first F\/A-22 squadron.",
    "description":"The first operational F-22A Raptor flies over Tyndall AFB on its delivery flight during 2003.",
    "page_context":"Tyndall Air Force Base is a United States Air Force Base located 12 miles east of Panama City, Florida. The base was named in honor of World War I pilot 1st Lt. Frank Benjamin Tyndall. The base operating unit and host wing is the 325th Fighter Wing of the Air Combat Command. The base had a resident population of 2,994 at the 2010 census. In October 2018, Hurricane Michael caused catastrophic damage to the base.",
    "section_context":"Tyndall Air Force Base is a United States Air Force Base located 12 miles (19 km) east of Panama City, Florida. The base was named in honor of World War I pilot 1st Lt. Frank Benjamin Tyndall. The base operating unit and host wing is the 325th Fighter Wing (325 FW) of the Air Combat Command (ACC). The base had a resident population of 2,994 at the 2010 census. In October 2018, Hurricane Michael caused catastrophic damage to the base.",
    "description_length":93,
    "caption_length":93,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1066.jpg"
  },
  {
    "language":"en",
    "image_url":"http:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/a6\/TXMap-doton-Poteet.PNG",
    "page_title":"Poteet, Texas",
    "section_title":null,
    "caption":"Location of Poteet, Texas",
    "caption_attribution_description":"Adapted from Wikipedia's TX county maps by Seth Ilys.",
    "description":"Location of Poteet, Texas",
    "page_context":"Poteet is a city in Atascosa County, Texas, United States. The population was 3,260 as of the 2010 census. It is part of the San Antonio Metropolitan Statistical Area. It was named for its first postmaster, Francis Marion Poteet. It is best known as the birthplace of country music star, George Strait.\nPoteet is known for its \"Poteet Strawberry Festival\". Poteet Canyon, Steve Canyon's ward in the long-running comic strip by Milton Caniff, is named after the town. In James Michener's classic, Centennial, cattleman R. J. Poteet led the drive of a large herd of Texas Longhorns north from Texas to Colorado.",
    "section_context":"Poteet is a city in Atascosa County, Texas, United States. The population was 3,260 as of the 2010 census. It is part of the San Antonio Metropolitan Statistical Area. It was named for its first postmaster, Francis Marion Poteet. It is best known as the birthplace of country music star, George Strait.\nPoteet is known for its \"Poteet Strawberry Festival\". Poteet Canyon, Steve Canyon's ward in the long-running comic strip by Milton Caniff, is named after the town (and a mosaic of Poteet Canyon stands in front of the town's fire station). In James Michener's classic, Centennial, cattleman R. J. Poteet led the drive of a large herd of Texas Longhorns north from Texas to Colorado.",
    "description_length":25,
    "caption_length":25,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1163.jpg"
  },
  {
    "language":"en",
    "image_url":"https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/e7\/Map_NL_Tytsjerksteradiel_Aldtsjerk.png",
    "page_title":"Aldtsjerk",
    "section_title":null,
    "caption":"Location of the village in Tytsjerksteradiel",
    "caption_attribution_description":"Kaartsje fan himrik fan Aldtsjerk",
    "description":"Location of the village in Tytsjerksteradiel",
    "page_context":"Aldtsjerk is a small village on the highway from Leeuwarden to Dokkum. It is part of Tytsjerksteradiel municipality, Friesland, the Netherlands and had around 615 inhabitants as of January 2018.\nIts annual festivities include the Doarpsfeest, including a parade, held in the summer.\nLocal landmarks include the Heemstra State, former residence of the aristocratic Sminia family. The village's main road, the van Sminiaweg is about 1.5 km long and named after the Sminia family.\nThe village also houses a former baker who was quite famous for his Oranjekoek and Suikerbrood, but who retired in 2000 when the euro was introduced.\nLocal shopping facilities are scarce: the nearest grocery market is located in Oentsjerk, about three kilometers outside town limits. The most notable shop of the town is a bike dealership and a store called Bram en Jannie's, which stands not actually in the village itself, but halfway between Aldtjserk and Oentsjerk.\nIn the center of the village is located the Aldtsjerk church, which was built in 12th century and gives the village its name.\nNear the village is the Aldtsjerkster mar, a small lake which is an important point on the Elfstedentocht.",
    "section_context":"Aldtsjerk (Dutch: Oudkerk) is a small village on the highway from Leeuwarden to Dokkum. It is part of Tytsjerksteradiel municipality, Friesland, the Netherlands and had around 615 inhabitants as of January 2018. \nIts annual festivities include the Doarpsfeest, including a parade, held in the summer.\nLocal landmarks include the Heemstra State, former residence of the aristocratic Sminia family. The village's main road, the van Sminiaweg is about 1.5 km long and named after the Sminia family.\nThe village also houses a former baker who was quite famous for his Oranjekoek and Suikerbrood, but who retired in 2000 when the euro was introduced.\nLocal shopping facilities are scarce: the nearest grocery market is located in Oentsjerk, about three kilometers outside town limits. The most notable shop of the town is a bike dealership and a store called Bram en Jannie's, which stands not actually in the village itself, but halfway between Aldtjserk and Oentsjerk.\nIn the center of the village is located the Aldtsjerk church, which was built in 12th century and gives the village its name (\"Old Church\"). \nNear the village is the Aldtsjerkster mar, a small lake which is an important point on the Elfstedentocht.\nIn Dutch, the village is called Oudkerk (\"Old Church\"); Aldtsjerk is its West Frisian name. It was one of the first Frisian towns to be generally listed under its West Frisian, rather than its Dutch name. The Ouderkerkermolen is a preserved windmill in Aldtsjerk.",
    "description_length":44,
    "caption_length":44,
    "identical_text":true,
    "avg_caption_len_bylang":56.9643428997,
    "heuristic_category":"ident",
    "img_id":"1143.jpg"
  }
]